[{"id":77969,"title":"Slideshow: Spirit Dances","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/slideshow-spirit-dances\/","content":"At the final Spirit Week 2014 rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school. The Associated Student Body <a href=\"https:\/\/twitter.com\/palyASB\/status\/528338947512872960\" target=\"_blank\">tweeted<\/a> later that evening that the seniors' dance won first place. The rest of the scores from Day Five will be released at Homecoming tonight and on ASB's <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\" target=\"_blank\">website<\/a>.\r\n\r\n[slideshow post_id=77969]","excerpt":"At the final Spirit Week rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school.","date":"2014-11-01 20:52:54","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/pappas.jpg","categories":["Spirit Week 2014"],"tags":{"29391":"georgeluphotography","31770":"last rally","8953":"paly","9107":"slideshow","9780":"spirit dance","31769":"spirit dances","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78006,"title":"Liveblog: Homecoming 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/liveblog-homecoming-2014\/","content":"[liveblog]","excerpt":"","date":"2014-11-01 18:30:01","author":"Saba Moussavian","categories":["Uncategorized"],"tags":[]},{"id":77785,"title":"Day Five Recap: Rain does not stop Spirit Week","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/day-five-recap-rain-does-not-stop-spirit-week\/","content":"[caption id=\"attachment_77797\" align=\"alignnone\" width=\"550\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10743719_10204702638793525_1404602102_n.jpg\"><img class=\"wp-image-77797\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10743719_10204702638793525_1404602102_n.jpg\" alt=\"Juniors Clara Wolfe, Rachel Selingson, Emma Scott and Aiva Petriceks pose as Griffin Carlson jumps of the float. Photo by George Lu.\" width=\"550\" height=\"366\" \/><\/a> Juniors Clara Wolfe, Rachel Selingson, Emma Scott and Aiva Petriceks pose as Griffin Carlson jumps of the float. Photo by George Lu.[\/caption]\r\n\r\nThe rain did not stop Palo Alto High School students from competing in the final two rallies on Day Five of Spirit Week.\r\n\r\nThe lunch rally was held in the rain, but there was still a huge turnout from all grades. However, due to the weather, the \"Mummy Game\" had to be canceled because it required the use of paper. The freshmen won the second game \"Pumpkin Bowling,\" and there was a three-way tie for second.\r\n\r\nAccording to students, Spirit Commissioners Emma Cole and Ariya Momeny handled the situation perfectly despite the difficulties brought upon by the rain.\r\n\r\n“I felt that the planning committee did a good job adapting to the circumstances,” sophomore Naveen Pai said. “Things would have been too chaotic if the rally was moved to the gym.”\r\n\r\nPaly students thought that the rain added to Spirit Week and made it more exciting.\r\n\r\n“I loved getting soaked with everyone during the rally while we cheered for our class,” senior dance member Johnny Lee said.\r\n\r\nPai agrees with Lee.\r\n\r\n“It was a cool experience to be out in the rain with the rest of my class even if that meant one game had to be canceled,\"Pai said.\r\n\r\nThe rain stopped just in time for the floats to be displayed and the dancers to perform for students, parents and staff during the after-school rally.\r\n\r\n“Paly's spirit was clearly noticeable, and the atmosphere was electric,” Pai said.\r\n\r\nThe seniors won best dance and gained the privilege to perform their dance at the halftime of the Homecoming football game.\r\n\r\nCheck back to The Paly Voice for scores.","excerpt":"The rain did not stop Palo Alto High School students from competing in the final two rallies on Day Five of Spirit Week.","date":"2014-11-01 17:27:03","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/juniorconfetti.jpg","categories":["Spirit Week 2014"],"tags":[]},{"id":77962,"title":"Editorial: Spirit Week should be about unity","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/editorial-spirit-week-should-be-about-unity\/","content":"This week, Palo Alto High School students are participating in the annual tradition of Spirit Week. This is the third year since the Associated Student Body introduced a new Spirit Week scoring policy in order to ensure fairness among classes and supposedly remove senior class-favoritism. With juniors currently in the lead and seniors trailing behind, the plausibility for a junior win during Spirit Week becomes more and more apparent. The tension between the classes has escalated to the point where the essence of Spirit Week is eclipsed.\r\n\r\nOver the past years, students have grown to become more preoccupied with earning the championship title rather than just having fun and enjoying the week. Both inter- and intra-class drama and petty disputes have become an all too familiar part of Spirit Week.\r\n\r\nASB’s intentions to create a fairer Spirit Week are inherently good, but the reality of a non-senior win has perverted the true meaning behind Spirit Week — an event to bring classes together in support of Paly as a school. In recent years, instead of unifying the student body, this change has caused heightened tensions between classes, one especially evident this year between the junior and senior classes. Students’ focus on winning Spirit Week has caused a rivalry to the extent that it generates an almost unhealthy competitiveness among the student body.\r\n\r\nRigged or not, Spirit Week should be about coming together as a community and having fun. Instead of pitting the classes against each other, ASB should incorporate joint-class activities and encourage cross-class collaboration. The fault at hand is not only of ASB, but of each and every student. The Paly Voice acknowledges and supports the competitive nature of Spirit Week; however, we believe that in order to preserve the integrity of the week, students should tone down the level of competitiveness. Under these newly revised scoring criteria, the student body as a whole should bring Spirit Week back to its roots: a time for togetherness and appreciation for Paly.\r\n\r\n&nbsp;","excerpt":"As a heated Spirit Week comes to a close, The Paly Voice urges for the Paly community to bring Spirit Week back to its roots by promoting unity and Paly pride instead of unhealthy competition.","date":"2014-10-31 23:56:48","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-31-at-11.57.40-PM.png","categories":["Editorial","Spotlight"],"tags":{"12701":"2014","19460":"2015","31768":"2016","31764":"appreciation","8496":"ASB","31767":"dispute","8654":"drama","8816":"junior","31766":"rivalry","31765":"roots","9119":"Spirit Week","27181":"spirit week 2014","31763":"togetherness","31762":"unity"}},{"id":77789,"title":"Video: Spirit Week Day Five","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/video-spirit-week-day-five\/","content":"On the final day of this year's Spirit Week, the freshmen, sophomores and juniors decked out in white and green while the seniors wore camo. The lunch rally, held outside in the rain, included pumpkin bowling and a staff dance. Check back to The Paly Voice for more Spirit Week coverage.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/o5mpZMyNMHQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"On the final day of this year's Spirit Week, the freshmen, sophomores and juniors decked out in white and green while the seniors wore camo. The lunch rally, held outside in the rain, included pumpkin bowling and a staff dance.","date":"2014-10-31 18:18:47","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-31-at-6.12.23-PM.png","categories":["Spirit Week 2014"],"tags":{"9796":"camo","9851":"day 5","31337":"day five","8745":"Green","31381":"pumpking bowling","9027":"rain","27181":"spirit week 2014","9793":"staff dance","9228":"white"}},{"id":77644,"title":"Liveblog: Homecoming football vs. Santa Clara","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/liveblog-homecoming-football-vs-santa-clara\/","content":"<em>Check back at 7 p.m. for live coverage as the Palo Alto High School football team (2-5, 1-2) hosts the Santa Clara High School Bruins (2-5, 0-3) in this year's homecoming game. <\/em> [liveblog]","excerpt":"Check back at 7 p.m. for live coverage as the Palo Alto High School football team (2-5, 1-2) hosts the Santa Clara High School Bruins (2-5, 0-3) in this year's homecoming game.","date":"2014-10-31 16:34:15","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o.jpg","categories":["Sports"],"tags":[]},{"id":77755,"title":"Storify: Spirit Week Day Five as seen through the eyes of students","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/storify-spirit-week-day-five-as-seen-through-the-eyes-of-students\/","content":"<div class=\"storify\">Follow this year's Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts!\r\n<div class=\"storify\">\r\n<div class=\"storify\"><iframe src=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-five\/embed?header=false&amp;border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-five.js?header=false&amp;border=false\"><\/script><noscript>[<a href=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-five\" target=\"_blank\">View the story \"Spirit Week 2014 Day Five\" on Storify<\/a>]<\/noscript>\r\n","excerpt":"Follow the last day of Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts.","date":"2014-10-31 10:20:31","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6675.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","9796":"camo","9851":"day 5","31337":"day five","30939":"instagram","31338":"last day","8944":"palo alto high school","31339":"paly pride day","30938":"social media","9119":"Spirit Week","27181":"spirit week 2014","30934":"storify","29808":"twitter"}},{"id":77378,"title":"Spirit Week Day Four results","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/spirit-week-day-four-results\/","content":"Going into the last day of Spirit Week, the juniors stay ahead of the seniors. The sophomores had a standout day, earning the highest amount of points today out of all classes. View official scores on ASB’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">website<\/a>.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/3168735-spirit-week-2014-day-4\" width=\"600\" height=\"931\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"Going into the last day of Spirit Week, the juniors stay ahead of the seniors. The sophomores had a standout day, earning the highest amount of points today out of all classes. View official scores on ASB’s website.","date":"2014-10-31 07:08:51","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7186.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","31232":"day four","30840":"generation day","8729":"Generations day","30978":"results","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":77370,"title":"Slideshow: Spirit Week Day Four","permalink":"http:\/\/palyvoice.com\/2014\/10\/30\/slideshow-spirit-week-day-four\/","content":"Palo Alto High School celebrated Generations Day during Day Four of Spirit Week. The seniors dressed up as senior citizens, the juniors as sophisticates, the sophomores as teeny boppers and the freshmen as babies. The lunchtime rally included \"Mannequin Painting\" and \"Rapid Fire.\" Minute to Win It competitions. During Advisory, there was a \"Three Point Contest\" in the Big Gym.\r\n\r\n[slideshow post_id=77370]\r\n\r\n&nbsp;","excerpt":"Palo Alto High School celebrated Generation Day this Thursday, Day 4 of Spirit Week. The seniors dressed up as senior citizens, the juniors as sophisticates, the sophomores as teeny boppers and the freshmen as babies. ","date":"2014-10-30 23:37:33","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7189.jpg","categories":["Spirit Week 2014"],"tags":{"27181":"spirit week 2014"}},{"id":77406,"title":"Day Four Recap: Seniors catching up to juniors","permalink":"http:\/\/palyvoice.com\/2014\/10\/30\/day-four-recap-seniors-catching-up-to-juniors\/","content":"The seniors are hoping to catch to the juniors as a result of Thursday’s Spirit Week festivities. For the Generation Day theme, the freshmen dressed up as babies, the sophomores as teeny boppers, the juniors as sophisticates and the seniors as senior citizens. Activities included “Mannequin Painting” and “Rapid Fire” during the lunch rally and the annual “Three Point Contest” during the advisory rally.\r\n\r\nFor the “Mannequin Painting” competition, four students from each grade painted a white mannequin in their grade’s color in three minutes using paintbrushes.\r\n\r\nFreshman participant Ashley Zhang thought the challenge was a fun addition to the Spirit Week activities.\r\n\r\n\"It was really messy, but I loved working with my friends to get points for Spirit Week,\" Zhang said.\r\n\r\n[caption id=\"attachment_77661\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7226.jpg\"><img class=\"size-full wp-image-77661\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7226.jpg\" alt=\"Freshmen Ashley Zhang, Jackie Cai, Marie Davis and Izzy Min cover their mannequin in orange paint, racing against the other grades in the activity “Mannequin Painting.” Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> Freshmen Ashley Zhang, Jackie Cai, Marie Davis and Izzy Min cover their mannequin in orange paint, racing against the other grades in the activity “Mannequin Painting.” Photo by Ana Caklovic.[\/caption]\r\n\r\nThe “Rapid Fire” activity was a fierce Minute to Win It battle in which two students from each grade attempted to knock over 10 empty soda cans using rubber bands. Juniors Chuck Stephenson and James Wang secured first place, seniors Molly Mackris and James Chau came in second, sophomores Emma van der Veen and Louie Marzano won third, and freshmen Nigel Chen and Raymond Fang came in last.\r\n\r\nSophomore Sam Guillet, best dressed nominee, was impressed with her grade's energy during the lunchtime rally.\r\n\r\n\"I think the sophomores have awesome cheers, and we work really well together.\" Guillet said. \"We're going to do great tomorrow,\" Guillet said.\r\n\r\n[caption id=\"attachment_77655\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7202.jpg\"><img class=\"size-full wp-image-77655\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_7202.jpg\" alt=\"The sophomore bleachers are filled with teeny boppers and greasers as sophomore Class President Noa Ben-Efraim leads the cheer. Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> The sophomore bleachers are filled with teeny boppers as sophomore Class President Noa Ben-Efraim leads the cheer. Photo by Ana Caklovic.[\/caption]\r\n\r\nThe lunch rally concluded with some high energy cheers and seniors went to their sixth period classes anticipating a comeback during the advisory rally.\r\n\r\nThe advisory rally in the Big Gym involved just one competition: the “Three Point Contest.\" Each grade put their faith into one girl and one boy, who each attempted to score as many three pointers in one minute as possible. There were six rounds: the freshmen played the seniors and the sophomores played the juniors, followed by the finalists. In the boys' finals, the seniors and sophomores played each other in a close game that resulted in a victory for the senior class. The girls' finals resulted in a freshmen upset over last year's champions, the sophomores.\r\n\r\nScores will be posted later tonight. Check back to the Paly Voice for more <a href=\"http:\/\/palyvoice\/spiritweek-2014\/\">Spirit Week 2014<\/a> information.\r\n\r\n&nbsp;","excerpt":"The seniors are hoping to catch to the juniors as a result of Thursday’s Spirit Week festivities. For the Generation Day theme, the freshmen dressed up as babies, <a href=\"http:\/\/palyvoice.com\/2014\/10\/30\/day-four-recap-seniors-catching-up-to-juniors\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-30 23:33:07","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_96471.jpg","categories":["Spirit Week 2014","Spotlight"],"tags":{"9700":"#palyspirit","31320":"3 Point Contest","31232":"day four","30840":"generation day","31301":"mannequin painting","9119":"Spirit Week"}}]