[{"id":78131,"title":"Preview: Girls&#8217; volleyball to play Gunn on Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/05\/preview-girls-volleyball-to-play-gunn-on-senior-night\/","content":"[caption id=\"attachment_76374\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg\"><img class=\"size-full wp-image-76374\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg\" alt=\"Senior captain and outside hitter Jade Schoenberger spikes the ball through a block in the game against Mountain View High School. Photo by Liana Pickrell. \" width=\"600\" height=\"399\" \/><\/a> Senior captain and outside hitter Jade Schoenberger hits the ball over a block in the game against Mountain View High School on Oct. 14. Mountain View won this match in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School girls' volleyball team (3-8, 17-11) will play crosstown rival Gunn High School (3-7, 16-12) on its Senior Night at 6:45 p.m. Thursday at home.\r\n\r\nThe Vikings' last match against Gunn resulted in a close loss (25-21, 25-23, 25-21) and a Twitter fight over school pride. However, in light of Gunn's recent <a href=\"http:\/\/palyvoice.com\/2014\/11\/04\/administration-offers-student-support-in-wake-of-gunn-student-death\/\" target=\"_blank\">tragedy<\/a>, senior defense specialist Kabria Dame says that she hopes that the competition does not get too out of hand.\r\n\r\n\"I don't want the competition between Gunn and Paly to overrule the volleyball spirit,\" Dame said. \"I also want people to come support the Gunn seniors because they deserve to be supported after their loss.\"\r\n\r\nRegardless, senior setter and right side Gillian Chryst says the team has the drive to win this game against its rival.\r\n\r\n“We’re just really excited,\" Chryst said. \"We’ve been playing these girls since the beginning of high school, so it’s kind of bittersweet. They [Gunn] stole one early from us, and it was a close match even though we lost in three sets, but I definitely think that we can take them.\"\r\n\r\nChryst also said that this game is important in order to prove that this year's volleyball team, with a less impressive record than those of previous seasons, is still strong.\r\n\r\n“This is the last time we can show the school and everyone that we are a good team and that we all have talent,” Chryst said.\r\n\r\nDame agreed, stressing the importance of Senior Night in that this match is the closing game of their years at Paly.\r\n\r\n“This is our last game in the Big Gym, and it’s our Senior Night,\" Dame said. \"We need to win.\"\r\n\r\nThe match will start at 6:45 p.m., but there will be commemorations for the seven seniors beforehand.","excerpt":"The Palo Alto High School girls' volleyball team (2-8, 16-11) will play crosstown rival Gunn High School (3-7, 16-12) in its Senior Night at 6:45 p.m. on Thursday at home. Although the match starts at 6:45 p.m., there will be commemorations for the seven seniors beforehand.","date":"2014-11-05 17:52:51","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg","categories":["Sports","Spotlight"],"tags":{"8751":"gunn","8953":"paly","9087":"Senior Night","9216":"volleyball"}},{"id":78121,"title":"Administration offers student support in wake of Gunn student death","permalink":"http:\/\/palyvoice.com\/2014\/11\/04\/administration-offers-student-support-in-wake-of-gunn-student-death\/","content":"The Palo Alto High School administration team is offering support for both students and teachers in response to the <a title=\"Palo Alto Teen Killed on Tracks Tuesday\" href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/11\/04\/palo-alto-teen-killed-on-tracks-tuesday\" target=\"_blank\">death<\/a> of a Gunn High School student earlier this morning.\r\n\r\nPaly Principal Kim Diorio sent a <a title=\"Kim Diorio Letter\" href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/2014-11-04-11-35-10_Gunn-letter.pdf\" target=\"_blank\">follow-up message<\/a> to the school community today after Palo Alto Unified School District Superintendent Max McGee sent an <a title=\"Superintendent Message\" href=\"http:\/\/pausd.org\/community\/Superintendent\/IC%20Message%2011.4.14.pdf\" target=\"_blank\">email<\/a> to parents this morning confirming that the Gunn student lost his life to suicide.\r\n\r\nDiorio’s letter reminds students that members of the district's Crisis Response Team, a unit formed in 2009 after a cluster of Palo Alto teen suicides, are “available to meet with students individually and in groups today as well as over the coming days and weeks.”\r\n\r\nIn an interview with The Paly Voice, Diorio noted that the Crisis Response Team has been meeting with students all day and that the school administration has taken steps to ensure support on campus.\r\n\r\n“We [the Paly administration] canceled all of our meetings today and all of our IEPs [Individualized Education Programs],” Diorio said. “I’ve gone out and checked on teachers because we have teachers who have their own children at Gunn or connections to Gunn, and we just want to be really mindful of how people react.”\r\n\r\nDiorio also mentioned that there will be a Parent Teacher Student Association General Meeting on Thursday at 8:30 a.m. in the SSRC to discuss suicide and mental illness. This meeting will be an open forum according to Teacher on Special Assignment Eric Bloom.\r\n\r\n“We’ll have some of our mental health team there to talk about suicide and how adults can help youth cope,” Diorio said.\r\n\r\nIn addition to assisting in the establishment of suicide-prevention network <a title=\"Project Safety Net\" href=\"http:\/\/www.psnpaloalto.com\/psn-plan\/implementation\/intervention\/\" target=\"_blank\">Project Safety Net<\/a>, PAUSD created a <a title=\"Suicide Prevention Toolkit\" href=\"http:\/\/pausd.org\/parents\/services\/health\/downloads\/ComprehensiveSuicidePreventionToolkitforSchools.pdf\" target=\"_blank\">Suicide Prevention Toolkit<\/a> in 2009 after a cluster of high school student suicides in Palo Alto, according to Assistant Principal Victoria Kim.\r\n\r\n“There was a Suicide Prevention Toolkit that was created district-wide ... by a committee of representatives from various school sites,” Kim said. “It’s a very comprehensive guide in preventing suicide – anywhere from what to look for, symptoms to look for, what to do, who to call, things like that.”\r\n\r\nAccording to Assistant Principal Jerry Berkson, Paly always provides help for students regardless of current situations.\r\n\r\n“The support’s always there,” Berkson said. “We have ACS [Adolescent Counseling Services] counseling, [and] we have our own counseling department.”\r\n\r\nBerkson said that although the administrative guidance is currently concentrated at Gunn, there is still help for Paly students.\r\n\r\n“Some of our staff members are over at Gunn helping out,” Berkson said. “There [are] different [Paly] students who are more affected by things than others, whether it’s a history in the family or all sorts of reasons, so we check in [on] them.”\r\n\r\nSpanish teacher and WASC Coordinator Emily Garrison and Special Education Instructional Supervisor Laura Bricca stood on the overpass that leads to Town and Country during Lunch today and handed out candy to passing students.\r\n\r\n“We just want to make sure that Paly students know that Paly teachers love Paly students and wish everyone a happy lunch and good rest of their day,” Garrison said. “We want to make sure students know how important they are to us. Really, really, really are. We care a lot about you guys.”\r\n\r\n&nbsp;\r\n\r\n<em>A list of school and community resources are available on the <a title=\"PAUSD Health Services\" href=\"http:\/\/pausd.org\/parents\/services\/health\/index.shtml\" target=\"_blank\">PAUSD Health Services page<\/a> and the <a title=\"PAUSD Counseling Services\" href=\"http:\/\/pausd.org\/parents\/services\/counseling\/\" target=\"_blank\">Counseling Services page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. If you feel you or someone you know needs immediate support, please call 911.<\/em>","excerpt":"The Palo Alto High School Administration team is offering support for both students and teachers in response to the death of a Gunn High School student earlier this morning.","date":"2014-11-04 14:38:23","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/imgres.jpg","categories":["News","Spotlight"],"tags":{"27775":"emily garrison","20197":"glenn max mcgee","8751":"gunn","9954":"jerry berkson","8834":"Kim Diorio","32445":"max mcgee","9135":"suicide","11606":"superintendent","9207":"victoria kim"}},{"id":78125,"title":"PTSA School Climate open forum on mental health concerns at 8:30 a.m. Thursday in SSRC","permalink":"http:\/\/palyvoice.com\/2014\/11\/04\/ptsa-school-climate-open-forum-on-mental-health-concerns-at-830-a-m-thursday-in-ssrc\/","content":"","excerpt":"","date":"2014-11-04 14:07:55","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32431":"open forum","9019":"PTSA","10609":"school climate","32430":"suicides"}},{"id":76175,"title":"APPetite blog: Heads Up!","permalink":"http:\/\/palyvoice.com\/2014\/11\/03\/appetite-blog-heads-up\/","content":"<em>Here is the third installment of APPetite featuring \"Heads Up!\" Read our blog to discover great games and other apps available in Apple’s App Store. We will cover apps ranging from retrofitted classic games to useful productivity apps. Check in each week to fulfill your hunger for a new addictive app fix!<\/em>\r\n\r\nMouse over the stars on the infographic below to learn more about \"Heads Up!\"\r\n<iframe src=\"\/\/www.thinglink.com\/card\/578831857039179777\" width=\"419\" height=\"455\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<strong>Heads Up!<\/strong>\r\n<strong>Price: 99 cents<\/strong> <strong>on App Store and FREE on Google Play<\/strong>\r\n<strong>In-App Purchases: Extra decks are available (99 cents each) <\/strong>\r\n<strong>Available: App Store, Google Play<\/strong>\r\n<strong>Rank: 4.5\/5<\/strong>\r\n<strong>Why you should download: \"<del><\/del>Heads Up!\" is a fun twist on charades and provides hours of laughter.\r\n<\/strong>\r\n\r\nCan you guess this word from these hints?\r\n\r\n1) The holiday that worships a bunny.\r\n\r\n2) Colorful plastic eggs.\r\n\r\n3) Lots of chocolate and candy.\r\n\r\nIf you guessed Easter you are going to love \"Heads Up!\"\r\n\r\n\"Heads Up!\" is a modern spin on charades and one of my favorite games. It is very intuitive to play as well. Just pick a category like \"Animals Gone Wild\" or \"Superstars\" and start guessing. \"Heads Up!\" requires at least two players, but can include as may people as you want. One player is the designated guesser and places the mobile device on their forehead. The other players act out or describe the word displayed. Tilt up for correct answers and tilt down to pass. At the end of the minute, the app shows which words the person got right and wrong. During the game, \"Heads Up!\" uses the front-facing camera to record the round, and at the end,  you can replay it for laughs.\r\n\r\n\"Heads Up!\" also offers extra category decks for 99 cents such as \"Movie Buff\" and \"Superheroes.\" I bought one extra deck \"Wish You Were Here\" that had famous cities and locations. Although it was fun, I'm not sure it was worth the money. The included decks are more than enough for hours of entertainment.\r\n\r\nMy personal favorite deck is \"Act It Out\" where you are only allowed to use gestures to describe the words. It is always super funny to watch and fun to act out.\r\n\r\nI rate it two thumbs and one \"Heads Up!\"\r\n\r\n&nbsp;","excerpt":"Here is the third installment of APPetite featuring Heads Up! Read our blog to discover great games and other apps available in Apple’s App Store. Check in each week to fulfill your hunger for a new addictive app fix!","date":"2014-11-03 14:07:41","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/appetite.jpg","categories":["APPetite","Entertainment"],"tags":{"29416":"APPetite","29997":"appstore","29478":"blog","8793":"iphone"}},{"id":78076,"title":"Students celebrate San Francisco Giants&#8217; win in World Series","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/students-celebrate-san-francisco-giants-win-in-world-series\/","content":"[caption id=\"attachment_78078\" align=\"alignnone\" width=\"535\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png\"><img class=\"wp-image-78078\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png\" alt=\"Screen Shot 2014-11-02 at 11.16.47 AM\" width=\"535\" height=\"402\" \/><\/a> San Francisco Giants players Buster Posey and Santiago Casilla stand on top of a double-decker bus at the Giants parade that traveled from Market Street to the Civic Center on Friday. The parade was held in honor of the season and the Giants' third World Series championship in five years. Although it was raining at the parade, no spirits were dampened. \"The parade was so fun despite the rain,\" Palo Alto High School senior Priscilla Bell said. Photo by Priscilla Bell.[\/caption]\r\n\r\nPalo Alto High School students express their excitement for the San Francisco Giants' third World Series win in five years by attending the rain-soaked streets of San Francisco for a parade on Friday.\r\n\r\n“It was just magical the way everything came together to get them into the World Series,” said junior Nikhil Rajaram, who was not able to attend the parade. “It's just great to be able to grow up in a time where we have as great a local baseball team as we do.”\r\n\r\nThe parade that began on Market Street and ended at the Civic Center celebrated the Giants' season and their championship. In the victory game on Thursday, which was led by the pitcher and World Series Most Valuable Player Madison Bumgarner, the Giants took Game seven of the 2014 World Series on the road against the Kansas City Royals by a score of 3-2.\r\n\r\nThe Giants now have established what many consider a dynasty: three World Series wins in five seasons: 2010, 2012 and 2014. Although he did not attend the parade, senior Galen Byrd is excited about the Giants being able to win so many World Series championships in such a small period of time.\r\n\r\n“It is just exciting to be watching history unfold in front of our eyes,” Byrd said. “I think a lot of kids don't understand how rare it is to win a championship in any major league sport, so to have won three in five years is just crazy.”\r\n\r\nSenior Priscilla Bell, a passionate Giants fan, attended the rainy and confetti-filled parade in 2010, 2012 and 2014.\r\n\r\n“There were so many people, and we all kept cheering,” Bell said. “All the players were on top of double-decked buses and waving.”\r\n\r\nDespite the rain, Bell managed to have a great time.\r\n\r\n“It [the parade] was just about embracing being there and [being] around everyone else who is a massive Giants fan, and [I was] so happy to be there,” Bell said.\r\n\r\nThe parade celebrated the legendary game that had Tim Hudson as the starting pitcher, the oldest pitcher ever to start a Game seven in the World Series. He ran into trouble in the second inning after an RBI [runs batted in] double and a sacrifice fly. This forced manager Bruce Bochy to bring in left-handed reliever Jeremy Affeldt to take his place. Affeldt responded by pitching 2.1 scoreless innings of relief, setting the stage for Bumgarner in the fifth inning with the Giants leading 3-2.\r\n\r\nBumgarner was named the MVP of the series after setting an Major League Baseball record for most innings pitched in a single postseason. His relief appearance in Game seven, five shutout innings, came just three days after he threw 117 pitches while throwing a complete-game shutout in Game 5 on Sunday.\r\n\r\n“I've been a Giants fan since I can remember, and it's always nice to see a Bay Area team win something so amazing,” junior Maddy Atwater said.","excerpt":"Many San Francisco Giants fans from Palo Alto lined up on the rain-soaked streets of San Francisco on Friday to celebrate the San Francisco Giants' third win in the World Series in five years.","date":"2014-11-02 20:39:23","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png","categories":["Sports"],"tags":{"31867":"buster posey","31864":"civic center","8732":"giants","31866":"kansas city royals","31865":"market street","9655":"San Francisco Giants","31868":"santiago casilla","9239":"world series"}},{"id":77397,"title":"Spirit Week Final Results","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/spirit-week-final-results\/","content":"The seniors won both the Spirit Dance and best float on Day Five of Spirit Week, which allowed them to beat the juniors. Despite their lead throughout the week, the juniors came in 71 points behind the seniors. View official scores on ASB's <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">website<\/a>.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/3168737-spirit-week-2014-day-5\" width=\"600\" height=\"933\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The senior class wins Spirit Week 2014. ","date":"2014-11-02 12:39:18","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/gatsby.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","31233":"final results","30978":"results","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78074,"title":"Main Office to collect Spirit Week outfit donations from Nov. 3 to Nov. 7","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/spirit-week-outfit-donations-to-be-collected-from-nov-3-to-nov-7-in-the-main-office\/","content":"","excerpt":"","date":"2014-11-02 10:25:48","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8596":"clothes","31863":"costumes","8651":"donations","30835":"outfits","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78070,"title":"Election Day on Nov. 4, polls open from 7 a.m. to 8 p.m.","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/election-day-on-nov-4-poll-open-from-7-a-m-to-8-p-m\/","content":"","excerpt":"","date":"2014-11-02 10:19:55","author":"Lizzie Chun","categories":["Uncategorized"],"tags":{"31862":"election day","8667":"elections","31861":"local election"}},{"id":77769,"title":"Video: Spirit Dance 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/video-spirit-dance-2014\/","content":"This year’s Spirit Week came to its grand finale this Friday with an after-school rally showcasing each class's float and Spirit Dance. The senior class, winners of the best dance performance, performed at halftime during the Homecoming football game. For the first time, the Spirit Dances were performed on both the track and the field and the previous restriction on a maximum number of participants was lifted. Check out the full performances below. See The Paly Voice's complete Spirit Week coverage <a href=\"http:\/\/palyvoice.com\/spiritweek-2014\/\">here<\/a>.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/N86D_nPi59w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/H9qDaRY_qlE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/vOnqlQXsqPI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/SSjvFXbjXKI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Watch this year's Spirit Dances.","date":"2014-11-02 01:20:27","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-12.55.52-AM.png","categories":["Multimedia","Spirit Week 2014","Video"],"tags":{"12701":"2014","8626":"dance","9779":"dances","9795":"freshman","8726":"gatsby","31062":"great gatsby","31771":"juiors","30873":"lion king","30851":"pirates","30844":"red card","9090":"seniors","9114":"Sophomores","9780":"spirit dance","9119":"Spirit Week","31860":"world cup"}},{"id":77969,"title":"Slideshow: Spirit Dances","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/slideshow-spirit-dances\/","content":"At the final Spirit Week 2014 rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school. The Associated Student Body <a href=\"https:\/\/twitter.com\/palyASB\/status\/528338947512872960\" target=\"_blank\">tweeted<\/a> later that evening that the seniors' dance won first place. The rest of the scores from Day Five will be released at Homecoming tonight and on ASB's <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\" target=\"_blank\">website<\/a>.\r\n\r\n[slideshow post_id=77969]","excerpt":"At the final Spirit Week rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school.","date":"2014-11-01 20:52:54","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/pappas.jpg","categories":["Spirit Week 2014"],"tags":{"29391":"georgeluphotography","31770":"last rally","8953":"paly","9107":"slideshow","9780":"spirit dance","31769":"spirit dances","9119":"Spirit Week","27181":"spirit week 2014"}}]