[{"id":78713,"title":"Liveblog: Girls&#8217; water polo plays second round CCS","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/liveblog-girls-water-polo-plays-second-round-ccs\/","content":"The Palo Alto High School girls' water polo team (13-14, 6-6) will play against Carlmont High School (12-6, 4-3) in the second round of Central Coast Section playoffs at 7 p.m. today at Paly. They won their last game 12-7 against Woodside High School (4-9, 1-3). Check here for live updates of the game.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls&#8217; water polo team (13-14, 6-6) will play against Carlmont High School (12-6, 4-3) in the second round of Central <a href=\"http:\/\/palyvoice.com\/2014\/11\/13\/liveblog-girls-water-polo-plays-second-round-ccs\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-11-13 13:23:56","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10807060_340765169436392_266510215_n.jpg","categories":["Sports"],"tags":{"8568":"CCS","8734":"girls","9846":"water polo"}},{"id":76769,"title":"The ultimate pearl milk tea challenge: A weekend in the city","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/the-ultimate-pearl-milk-tea-challenge-a-weekend-in-the-city\/","content":"[caption id=\"attachment_76774\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg\"><img class=\"size-full wp-image-76774\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg\" alt=\"Plentea is this week's best reviewed PMT. Plentea specializes in fruit teas, crema oolong teas and pearl milk teas. Photo by Alex Merkle-Raymond\" width=\"650\" height=\"488\" \/><\/a> Plentea is this week's best reviewed PMT. Plentea specializes in fruit teas, crema oolong teas and pearl milk teas. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nWelcome to the third installment of the ultimate Pearl Milk Tea challenge. You can find previous PMT reviews <a href=\"http:\/\/palyvoice.com\/category\/the-ultimate-pmt-challenge\/\" target=\"_blank\">here<\/a>.\r\n\r\nThis week, I am reviewing the PMT I tried while in San Francisco. This city brought out the best PMT I’ve ever had, and also the worst.\r\n\r\n<strong>Boba Guys<\/strong>\r\n\r\n<em><span style=\"color: #222222;\">3491 19th St., San Francisco 94110<\/span><\/em>\r\n\r\n[caption id=\"attachment_76776\" align=\"alignleft\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9877.jpg\"><img class=\"size-full wp-image-76776\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9877.jpg\" alt=\"Boba Guys' PMT was very sweet but the pearls were delicious. Everything is very modern and organic. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Boba Guys' PMT was very sweet, but the pearls were delicious. Everything is very modern and organic. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 6.5\/10\r\n\r\n<em>What I ordered<\/em>: Classic milk tea with almond milk and pearls ($4)\r\n\r\n<em>Features<\/em>:\r\n\r\nThis place is very trendy. There are weekly tastings of tea flavors and additions to make the store seem more communal. The syrups and almond jelly are made from scratch, and almost everything is organic, according to the <a href=\"http:\/\/www.bobaguys.com\" target=\"_blank\">Boba Guys website<\/a>.\r\n\r\nI ordered a drink with almond milk because Boba Guys is one of the few places I’ve been to that has a dairy free option, and I wanted to take advantage of it.\r\n\r\nThe server was generous with the pearls, which were very chewy and flavorful and did not disintegrate. The tea flavor was very strong, but the drink was incredibly sweet. At certain points, some sips would be almost unbearably sweet if the syrup wasn’t completely mixed in.\r\n\r\nA downfall was the slow service, but Boba Guys does call the drinks the \"Slow Bar\" in warning. Also, the drink was served with a snap-on lid. Some people may not understand the importance of this, but without a vacuum sealed lid, it is impossible to shake the drink into a perfect mixture with no too-sweet spots.\r\n\r\n&nbsp;\r\n\r\n<strong>Boba Delight<\/strong>\r\n\r\n<address style=\"font-weight: inherit;\"><span style=\"font-weight: inherit; font-style: inherit;\">528 Larkin St., <\/span><span style=\"font-weight: inherit; font-style: inherit;\">San Francisco<\/span>, <span style=\"font-weight: inherit; font-style: inherit;\">94102<\/span><\/address>\r\n\r\n[caption id=\"attachment_76781\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9884.jpg\"><img class=\"wp-image-76781 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9884.jpg\" alt=\"Boba Delight was very sweet and watery. The pearls were also very sweet and disintegrating. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Boba Delight was very sweet and watery. The pearls were also sweet and disintegrated. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 2.5\/10\r\n\r\n<em>What I ordered<\/em>: Small coconut green pearl milk tea ($2.45)\r\n\r\n<em>Features:<\/em>\r\n\r\nBoba Delight features a small selection of ice cream, a significant array of funky foods and a large variety of pearl milk tea drinks. It’s relatively new, and you can purchase glass bottles to bring in again for a discount. Boba Delight also has a stamping rewards system that gives you a free drink after you buy 10 drinks.\r\n\r\nI personally will not return and do not recommend that anyone try it. The service was very slow, and once I finally received my drink, I was less than impressed.\r\n\r\nThe drink was incredibly sweet and super syrupy. At the time time, it seemed like they used water instead of milk because it was so thin and not at all creamy. I could not mix the drink to see if it was just mixed poorly because it had a snap-on lid.\r\n\r\nThe pearls were very soft and would often clog up the straw. They started to disintegrate quickly and would leave a tapioca pearl residue on the sides of the cup. Everything seemed very artificial, and I could barely tell if they gave me the flavor I asked for.\r\n\r\n&nbsp;\r\n\r\n<strong>Quickly<\/strong>\r\n\r\n<em>300 Walnut St., <span style=\"font-weight: inherit;\">Redwood City<\/span>, <span style=\"font-weight: inherit;\">Calif.,<\/span> <span style=\"font-weight: inherit;\">94063<\/span><\/em>\r\n\r\n[caption id=\"attachment_76779\" align=\"alignleft\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9888.jpg\"><img class=\"size-full wp-image-76779\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9888.jpg\" alt=\"Quickly was not very flavorful but the service was very fast and the sizes are large. Quickly is everywhere and a deal for people who can find a flavor they really like. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Quickly was not very flavorful, but the service was fast and the sizes are large. Quickly is everywhere and a monetary steal for people who can find a flavor they really like. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 4\/10\r\n\r\n<em>What I ordered:<\/em> Small jasmine pearl milk tea ($2.70)\r\n\r\n<em>Features:<\/em>\r\n\r\nQuickly is everywhere. I would personally call it the McDonald’s of pearl milk tea places. I have had Quickly on multiple occasions, and I have never been particularly impressed. This location was no exception.\r\n\r\nIt has very fast service, large cup sizes and many options for mix-ins. I chose the usual tapioca pearls which were large and very chewy. The pearls did not leave remnants in the cup, but coated the inner straw and mouth. In general, the drink was sweet, very milky and not very flavorful.\r\n\r\nThe straws were not wrapped, which I have never seen before and made me a little suspicious. Quickly uses the FIVESTARS reward card system and is cash only. I would say that if you can find a flavor you like, go because it’s cheap, but be aware that it’s not very good either.\r\n\r\n&nbsp;\r\n\r\n<strong>Plentea<\/strong>\r\n\r\n[caption id=\"attachment_76782\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9927.jpg\"><img class=\"wp-image-76782 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9927.jpg\" alt=\"Plentea did not have many flavor options but what it did have was delicious. The tea was very flavorful and consistent in sweetness and texture. The pearls were large and chewy. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Plentea did not have many flavor options, but what it did have was delicious tea. The tea was very flavorful and consistent in sweetness and texture. The pearls were large and chewy. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<address style=\"font-weight: inherit;\"><span style=\"font-weight: inherit; font-style: inherit;\">341 Kearny St., <\/span><span style=\"font-weight: inherit; font-style: inherit;\">San Francisco<\/span>, <span style=\"font-weight: inherit; font-style: inherit;\">94108<\/span><\/address><em>Overall Rating<\/em>: 9\/10\r\n\r\n<em>What I ordered:<\/em> Black pearl milk tea ($5.00)\r\n\r\n<em>Features:<\/em>\r\n\r\nPlentea is right next to Chinatown and the financial district in San Francisco, so it was difficult to find parking, but once I did, it was worth it. The store is two stories and very modern. The food menu is mainly fancy variations on waffles and sandwiches.\r\n\r\nThe staff members were very informative and answered all my questions – when I went back the next day, they remembered me and were very glad I was back. All drinks are served in cool glass containers, and the store will give you a 10 percent discount if brought back. The bottles also have a lid for transportation and reusability.\r\n\r\nThere was a line out the door that was very slow moving, but once you’ve ordered, the drinks come quickly. There are few flavor options, but there are fruit drinks, smoothies, teas and many combinations of all of these.\r\n\r\nThe tea was very flavorful with large, soft pearls. The drink was very creamy and because there was no flavoring, there was no mixing required for a perfectly smooth drink. The texture was even throughout the bottle, which I very much appreciated.\r\n\r\n<i>Please leave a comment to suggest Pearl Milk Tea places you would like reviewed. <\/i>","excerpt":"Staff writer Alex Merkle-Raymond takes the PMT challenge to San Francisco where she experiences the best and worst PMT she's ever had. Through the Mission District, the Tenderloin and the Financial District, Pearl Milk Tea is judged fairly and in great detail. Please leave a comment for any suggestions of other places to try.","date":"2014-11-13 13:10:15","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg","categories":["Blog","Spotlight","The ultimate PMT challenge"],"tags":{"29478":"blog","29703":"boba","30534":"boba delight","30533":"boba guys","29705":"pearl milk tea","30536":"plentea","29704":"pmt","30535":"quickly","9061":"San Francisco"}},{"id":78700,"title":"Breaking news: Crystal-Foster concedes school board race","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/breaking-news-crystal-foster-pulls-out-of-school-board-race\/","content":"The contest for the remaining seat on the Palo Alto school board came to an end this morning when Catherine Crystal-Foster announced today that she is conceding the race.\r\n\r\nAll the vote-by-mail ballots have been counted, which secured the first seat to Ken Dauber, according to Santa Clara County registrar of voters. In a competition for the second open seat and with the provisional ballots uncounted, Crystal-Foster trailed 199 votes behind Godfrey at last count, and the \"uncounted ballots are unlikely to change the outcome,\" Crystal-Foster said in an email to her campaign staff and supporters.\r\n\r\nHere is the full text of her email announcement:\r\n\r\n\"We've all been watching the living lesson that every vote truly counts in our democracy. At this point, the county has recorded all remaining vote-by-mail ballots, and there are only a few thousand uncounted provisional ballots remaining county-wide. Ken Dauber has secured one school board seat, and Terry Godfrey is ahead of me by 199 votes for the second seat. The uncounted ballots are unlikely to change the outcome, so I offer my sincere congratulations to Ken and Terry as the new members of our school board. Both Terry and Ken will be staunch advocates for our students, and I wish them both the best. I have great regard for the talent and dedication that all the candidates brought to this race. My best to Gina Dalma and Jay Cabrera, as well, who share a commitment to education and will, I'm confident, continue their good work on behalf of students. I look forward to continuing my service to the schools and our students, and will do so in a spirit of collaboration with all our school leaders.\r\n\r\n\"I am grateful for the opportunity to have spent these past six months discussing the future of Palo Alto’s schools with so many in our community. I continue to be energized by you, by the opportunities before us, and by the ambition of our new superintendent. To those of you who walked, called, endorsed, created, gave, wrote, informed, and inspired over this campaign -- many, many thanks. We created a network of positive thinkers who care about education that will continue long after the final ballots are counted.\r\n\r\n\"I am privileged to have been surrounded and supported by so many wonderful friends and neighbors in this journey. I thank you all from the bottom of my heart.\"\r\n\r\nAn announcement on Crystal-Foster's Facebook page reads:\r\n\r\n\"The last vote-by-mail ballots have been counted, and Ken has retained the first school board seat and Terry is ahead of me by 199 votes for the second. While provisional ballots remain uncounted, it is unlikely that those will change the outcome. Thus, I've reached out to Ken and Terry to congratulate them as our new school board members. They both care deeply about students and I wish them the very best. To each and every one of you, I offer my deepest thanks for all your hard work, belief in our positive and forward-looking message, and for your friendship and support. I feel privileged to have worked with such a wonderful team and look forward to continuing to work with you in our schools and community for the benefit of all our students.\"","excerpt":"The contest for the remaining seat on the Palo Alto school board came to an end this morning when Catherine Crystal-Foster announced today that she is pulling out of the race.","date":"2014-11-13 11:28:08","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/rsz_img_7834.jpg","categories":["News"],"tags":{"12701":"2014","32676":"catherine crystal-foster","32598":"crystal-foster","29789":"dauber","8667":"elections","29787":"godfrey","8828":"ken dauber","32677":"palo alto school board","9069":"School Board","32674":"terry godfrey","32675":"votes","9219":"voting"}},{"id":78474,"title":"Vikings to close out regular season at Saratoga","permalink":"http:\/\/palyvoice.com\/2014\/11\/12\/vikings-to-close-out-regular-season-at-saratoga\/","content":"The Palo Alto High School football team (3-6, 2-3) looks to finish out its regular season with a critical victory when it faces the Saratoga High School Falcons (4-5, 2-3) this Friday on the road with potential Central Coast Section playoff implications at stake.\r\n\r\n[caption id=\"attachment_78532\" align=\"alignnone\" width=\"550\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-10-at-8.40.13-PM.png\"><img class=\"wp-image-78532\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-10-at-8.40.13-PM.png\" alt=\"Junior quarterback Justin Hull surveys his receivers downfield during a 55-26 victory against the Santa Clara Bruins on Oct. 31. as junior Mikey Grandy and senior Jon Martinez protect him. Photo by Josh Yuen.  \" width=\"550\" height=\"363\" \/><\/a> Junior quarterback Justin Hull surveys his receivers downfield as junior Mikey Grandy and senior Jon Martinez protect him from Santa Clara Bruin pass rushers. The Vikings defeated the Bruins 55-26. Photo by Josh Yuen.[\/caption]\r\n\r\nAfter a solid <a href=\"http:\/\/palyvoice.com\/2014\/10\/31\/liveblog-homecoming-football-vs-santa-clara\/\">55-26 win at the Homecoming game<\/a> against the Santa Clara High School Bruins, the Vikings suffered a bitter defeat against the Milpitas High School Trojans on Senior Night, 47-7.\r\n\r\nMeanwhile, the Falcons are coming off of a tough 42-6 loss on the road at the hands of the Los Gatos High School Wildcats.\r\n\r\nWith the Vikings and Falcons possessing identical league records (2-3) heading into the final regular season game of the season, it is likely that the winner of the contest will advance to the first round of the CCS playoffs, and the losing team's season will be over.\r\n\r\nSenior running back and team captain Jayshawn Puckett stressed consistency as the top priority for getting the decisive victory.\r\n\r\n\"I would like to see the team as a whole stay consistent each quarter,\" Puckett said. \"This game is a must-win game because we want to compete for CCS.\"\r\n\r\nVikings head coach Jake Halas emphasized that this Friday's game must be treated as a playoff matchup.\r\n\r\n\"People have been projecting that we go into the playoffs,\" Halas said. \"We're treating it as a playoff game. I told my players that if the projections are correct, we just keep playing until we lose.\"\r\n\r\nDuring last week's blow-out loss against Milpitas, several players were disciplined with minimal playing time due to a lack of focus and commitment during practice over the course of the past few weeks. Junior running back and linebacker Tak Nishi is excited to have key players back for Friday's big game.\r\n\r\n\"I'm happy to have the guys we didn't have last week back to play our final regular season game and get to the playoffs,\" Nishi said. \"This game will decide if we go to CCS or not, so we'll be working hard this week in practice to get the win.\"\r\n\r\nHalas agreed with Nishi on the importance of practicing hard.\r\n\r\n\"I need 100 percent attendance, participation, dialed-in mentality and focus this week,\" Halas said. \"That's what I really want. We have to have that. One hundred percent attendance in practice. We still have not had that consistently this year. I want to see a strong work week.\"\r\n\r\nThe Vikings and Falcons kick off at 7 p.m. on Friday, Nov. 14, at Saratoga High School.","excerpt":"The Palo Alto High School football team (3-6, 2-3) will look to finish out its regular season with a critical victory when it faces the Saratoga High School Falcons (4-5, 2-3) this Friday on the road with potential Central Coast Section playoff implications at stake. ","date":"2014-11-12 20:16:46","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-10-at-8.40.13-PM.png","categories":["Football","Sports","Spotlight"],"tags":{"8568":"CCS","8714":"football","8944":"palo alto high school","9012":"preview","10752":"saratoga high school"}},{"id":78630,"title":"Liveblog: Girls&#8217; volleyball plays Independence in first round of CCS","permalink":"http:\/\/palyvoice.com\/2014\/11\/12\/liveblog-girls-volleyball-plays-independence-in-ccs-first-round\/","content":"[caption id=\"attachment_76368\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_1064.jpg\"><img class=\"size-full wp-image-76368\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_1064.jpg\" alt=\"Freshman Chelsea Fan spikes the ball past the Mountain View blocker. Fan had the winning kill in the fourth set, which tied the teams at two sets a piece. Mountain View won the match on Oct. 14 in five sets: 25-21, 18-25, 25-20, 17-25, 15-7.  Photo by Liana Pickrell.\" width=\"600\" height=\"399\" \/><\/a> Freshman Chelsea Fan spikes the ball past the Mountain View blocker. Fan had the winning kill in the fourth set, which tied the teams at two sets a piece. Mountain View won the match on Oct. 14 in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\n<em>The Palo Alto High School girls' volleyball team takes on Independence High School in the first round of the Coastal Coast Section playoffs. Check back at 7 p.m. for live updates.<\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls' volleyball team takes on Independence High School in the first round of the Coastal Coast Section playoffs. Check back at 7 p.m. for live updates.","date":"2014-11-12 17:10:27","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_1064.jpg","categories":["Sports"],"tags":{"8568":"CCS","32591":"first round","8734":"girls","8855":"liveblog","8939":"palo alto","32590":"round one","9216":"volleyball"}},{"id":78538,"title":"Liveblog: Girls&#8217; water polo CCS first round vs. Woodside","permalink":"http:\/\/palyvoice.com\/2014\/11\/11\/liveblog-girls-water-polo-ccs-first-round-vs-woodside\/","content":"<em>Check back at 7 p.m. this Tuesday, Nov. 11 for live coverage as the Palo Alto High School girls' water polo team (13-14, 6-6) hosts the Woodside High School Wildcats (4-9, 1-3) in the first round of the CCS playoffs. <\/em>\r\n\r\n[liveblog]","excerpt":"Check back at 7 p.m. this Tuesday, Nov. 11 for live coverage as the Palo Alto High School girls' water polo team (13-14, 6-6) hosts the Woodside High School Wildcats (4-9, 1-3) in the first round of the CCS playoffs. ","date":"2014-11-11 20:21:08","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-10-at-8.40.13-PM.png","categories":["Sports"],"tags":[]},{"id":76888,"title":"Students launch successful gaming app","permalink":"http:\/\/palyvoice.com\/2014\/11\/11\/students-launch-successful-gaming-app\/","content":"[caption id=\"attachment_76891\" align=\"alignnone\" width=\"670\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-22-at-3.14.09-PM.png\"><img class=\"size-full wp-image-76891\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-22-at-3.14.09-PM.png\" alt=\"IPhone screen shots of Method to Madness. Photo By Samuel Desré\" width=\"670\" height=\"573\" \/><\/a> iPhone screen shots of \"Method to Madness.\" Photos By Samuel Desré.[\/caption]\r\n\r\nTwo Palo Alto High School students, a junior and a sophomore, are receiving positive feedback after launching their new gaming app \"Method to Madness\" last month.\r\n\r\nThe game was not only a success at the Paly level, but it was also a worldwide one. Nearly 1,000 downloads have been recorded as of last week from the App store, according to \"Method to Madness\" programmer junior Matt Seligson.\r\n\r\n\"The most surprising part of these sales was the fact that people from such a wide variety of countries downloaded the app,\" said sophomore programmer and President of the iOS club Brian Tracy. \"The only things I know about Uzbekistan are that it is somewhere in Asia, and that someone there appreciates Method to Madness.\"\r\n\r\n\"Method to Madness is a fun game, and I keep playing it because the board changes every time and you can keep trying to get a bigger score,\" junior Zach Segal said.\r\n\r\nBoth Seligson and Tracy were shocked after receiving that amount of positive feedback. Their app is rated five stars out of five on the App Store.\r\n\r\n\"[The] explosion in the first week took us by surprise,\" Tracy said.\"We had expected a couple of downloads from people at Paly, but not the near 1,000 that we got.\"\r\n\r\nSeligson and Tracy say they have put many hours into their project.\r\n\r\n\"The app was a work in progress throughout most of the summer,\" Tracy said. \"A couple several-hour sprints were required to put the final touches on the app during the school year.\"\r\n\r\nAnother member of iOS club also launched an app this past week. The vice president of iOS club, sophomore Naveen Pai, developed \"Master-Plan,\" an app that has for goal to help students keep track of their assignments, \"Master-Plan\" can also be downloaded from the App Store.","excerpt":"A gaming app was launched by two students Palo Alto High School student last month.","date":"2014-11-11 18:01:45","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-10-22-at-3.14.09-PM.png","categories":["Entertainment"],"tags":{"29479":"App Store","15394":"apps","32581":"brian tracy","15410":"game","32580":"ios club","12054":"matt seligson","11983":"Matthew Seligson","32579":"method to madness"}},{"id":78470,"title":"Opinion: Honoring our veterans","permalink":"http:\/\/palyvoice.com\/2014\/11\/11\/opinion-honoring-our-veterans\/","content":"People look forward to a random day with no work and no school as extra time to relax. It seems that Palo Alto High School teachers and students are making plans to adventure with friends, get ahead on work or spend the day watching Netflix. But why do we have this day off? Let's not forget the importance and austerity behind the true meaning of Veterans Day.\r\n\r\nWorld War I officially ended in June of 1919. However, the horrific fighting actually stopped after an armistice was signed by the Allied nations and Germany months earlier. Guess when this armistice went into effect.  The 11th hour of the 11th day of the 11th month <span style=\"color: #545454;\">—<\/span> the beginning of Veterans Day as we know it today.\r\n\r\nIn November of 1919, President Woodrow Wilson proclaimed that Nov. 11 should be forevermore revered as Armistice Day. According to the <a href=\"http:\/\/www.va.gov\/opa\/vetsday\/vetdayhistory.asp\">U.S. Department of Veterans Affairs<\/a>, President Wilson said, \"To us in America, the reflections of Armistice Day will be filled with solemn pride in the heroism of those who died in the country’s service and with gratitude for the victory, both because of the thing from which it has freed us and because of the opportunity it has given America to show her sympathy with peace and justice in the councils of the nations...\"\r\n\r\nThe name changed after World War II in which the largest amount of soldiers, marines and airmen were deployed in national history. Since then, Nov. 11 was officially renamed to Veterans Day to commemorate all American veterans who represented their country in a time of war.\r\n\r\nSo let's stop complaining that Veterans Day falls on a Tuesday this year and that we didn't have Monday off as well. Veterans Day should not be about the long weekend. It should be about remembering and honoring those who have committed and given their lives in the name of our country.\r\n\r\nYesterday the Secretary of Veterans Affairs, Robert McDonald, announced a major restructuring of the VA department. These plans come in response to an <a href=\"http:\/\/www.cbsnews.com\/news\/va-moves-to-fire-4-senior-executives-due-to-scandal\/\">incident<\/a> that left over a hundred thousand veterans waiting painstakingly long for access to healthcare, according to <a href=\"http:\/\/www.cnn.com\/2014\/11\/10\/politics\/va-reforms-and-restructuring\/index.html\">CNN<\/a>. Veterans, even with their hard work for our country, often fall through the cracks of employment or healthcare when they return home.\r\n\r\nYes, it is nice to have a day off. However, we should not ignore the true intent behind this day in history. I encourage all to take a break from catching up on their favorite shows or doing homework on Tuesday to be thankful for those who have dedicated their lives to protect ours. Don't just take this free time for granted, because the soldiers we commemorate did not always have that luxury.","excerpt":"People look forward to a random day with no work and no school as extra time to relax. But why do we have this day off? Let's not forget the importance and austerity behind the true meaning of Veterans Day.","date":"2014-11-11 08:41:56","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_4.jpeg","categories":["Opinion","Opinion Editor's Pick"],"tags":{"32533":"veterans day"}},{"id":78526,"title":"Extended lunch for annual Turkey Trot on Nov. 21","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/extended-lunch-for-annual-turkey-trot-on-nov-21\/","content":"","excerpt":"","date":"2014-11-10 18:54:16","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32577":"extended lunch","32578":"special schedule","10165":"turkey trot"}},{"id":78523,"title":"Second quarter progress report grading period ends Nov. 14","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/second-quarter-progress-report-grading-period-ends-nov-14\/","content":"","excerpt":"","date":"2014-11-10 18:53:01","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8741":"grades","32575":"grading period","32576":"progress report","32574":"second quarter"}}]