[{"id":73117,"title":"Season preview: Girls&#8217; golf tees off new season","permalink":"http:\/\/palyvoice.com\/2014\/09\/07\/season-preview-girls-golf-tees-off-new-season\/","content":"[caption id=\"attachment_73484\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-4.jpg\"><img class=\"wp-image-73484\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-4.jpg\" alt=\"Senior Olivia Johnson takes a swing during practice at the Palo Alto Municipal golf course. Photo by Claire Krugler. \" width=\"600\" height=\"450\" \/><\/a> Senior Olivia Johnson takes a swing during practice at the Palo Alto Municipal golf course. Photo by Claire Krugler.[\/caption]\r\n\r\nAfter placing first in the Central Coast Section and placing fourth in the California Interscholastic Federation State Championship last year, the Palo Alto High School girls' golf team hopes to bring its past success into the 2014 season.\r\n\r\nThere will be spots to fill because the team graduated seniors Annie Chen and Audrey Horn last year, however, coach Doyle Knight is confident that the team will be strong despite this loss.\r\n\r\n“With [senior] Michelle Xie and [sophomore] Emily Hwang leading the team,\" Knight said, \"and returning players [sophomore] Celia Willner, [sophomore] Elise Kiya, [senior] Olivia Johnson and [sophomore] Alice On improving several strokes better than last year and four new additions, we should still have a very strong team.\"\r\n\r\nJohnson says she is looking forward to this season and is confident in the team’s ability to do well.\r\n\r\n“This season we hope to win leagues because last year we lost to Gunn by just two strokes,” Johnson said. “That was a disappointment. We made it to CCS and won CCS last year and we hope to do that again. Hopefully we’ll make it to States again.”\r\n\r\nSophomore Emily Hwang is expecting just as strong of a season as last year.\r\n\r\n“Last year, especially as a freshman and since it was the first year of the team, I didn't really know what to expect at all,” Hwang said. “I think our team is almost or just as strong as it was last year so hopefully we can win CCS again and make it to States.”\r\n\r\nThe girls are scheduled to play Los Gatos at 3:00 p.m. Sept. 11 at Los Gatos High School for their season opener.\r\n\r\n“We beat Los Gatos last year so hopefully we can beat them again,\" Johnson said. \"I think there’s a lot of excitement right now. Everyone is looking forward to the first tournament at Poplar Creek and then we’re all looking forward to our first match, so hopefully it should go well.\"\r\n\r\nKnight is also ready for the team's first opener tournament.\r\n\r\n“Our goal is to repeat the great season we had last year,” Knight said. “Whether we do or don't will remain to be seen, but the girls are working hard to give it their best.”\r\n\r\nTheir first home match will be at 3:30 p.m. Sept. 25 against Gunn High School.","excerpt":"After placing first in the Central Coast Section and placing fourth in the California Interscholastic Federation State Championship last year, the Palo Alto High School girls' golf team hopes to bring its past success into the 2014 season.","date":"2014-09-07 22:54:13","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-4.jpg","categories":["Golf","Sports"],"tags":{"10012":"emily hwang","10175":"girls golf","8738":"Golf","25081":"knight","10010":"michelle xie","25082":"olivia johnson","25080":"paly girls golf","14521":"paly golf"}},{"id":73447,"title":"Principal greets PTSA with new changes","permalink":"http:\/\/palyvoice.com\/2014\/09\/05\/principal-greets-ptsa-with-the-new-changes\/","content":"[caption id=\"attachment_73453\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/011a1.jpg\"><img class=\"wp-image-73453 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/011a1.jpg\" alt=\"\" width=\"800\" height=\"600\" \/><\/a> Principal Kim Diorio presents a motivational meme to parents at the first PTSA General Association Meeting of the 2014-15 school year. She added flavor to her PowerPoint presentation with memes and venn diagrams. \"I want to assure you that... we're going to do everything we can to love your students- to love them and care for them,\" Diorio said. Photo by Jeanette Wong.[\/caption]\r\n\r\nPalo Alto High School Principal Kim Diorio is welcoming the 2014-15 school year with optimism and candor, according to comments she made at the first Parent Teacher Student Association General Association Meeting of the school year last night at Paly’s Media Arts Center. Diorio addressed the improved learning spaces, new teacher leadership positions and smaller class sizes.\r\n\r\nThe MAC and History\/Math building are two of several improvements to the Paly campus. The new additions received positive feedback from the public, according to Diorio.\r\n\r\nAccording to Diorio, the demolition of the gyms has been delayed due to budget issues. If the final price comes in at budget or below, the renovation process is set to start around Dec. 15. The library is also set to be renovated some time in the future.\r\n\r\nIn addition to the new features of the campus, there are new staff positions designed to help better the school community.\r\n\r\n“We’ve created some additional teacher leadership positions on campus called TOSAs – Teacher on Special Assignment,” Diorio said. “Some of our teacher leaders are focused on incorporating technology in the classrooms, helping and supporting teachers so that the lessons are more engaging.”\r\n\r\nAnother beneficial aspect is the smaller class sizes. Most freshmen and sophomore English courses have 19 to 20 students in each class, according to Diorio.\r\n\r\n“We really wanted to lower those class size ratios so that our teachers are able to have more opportunities to personalize the learning for students and give them feedback in a more timely fashion,” Diorio said.\r\n\r\nIn order to further enhance students’ learning experiences, some of the classrooms have new furnishings.\r\n\r\n“When teachers are teaching – even if it’s direct instruction – a lot of times, we find that [students] are moving maybe in the [new swivel] chairs, but their eyes are still focused on the teacher,” Diorio said. “So just being able to move their body a little bit and that sensory motor integration is really important in terms of keeping them focused.”\r\n\r\nIn addition to the presentation, Diorio held a Q&amp;A session for the parents. The PTSA also approved the new budget and bylaw changes at the meeting.","excerpt":"Palo Alto High School Principal Kim Diorio is welcoming the 2014-15 school year with optimism and candor, according to comments she made at the first Parent Teacher Student Association General Association Meeting of the school year last night at Paly’s Media Arts Center. ","date":"2014-09-05 21:55:10","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/011a.jpg","categories":["News"],"tags":[]},{"id":73414,"title":"Spirit Dance to undergo major changes","permalink":"http:\/\/palyvoice.com\/2014\/09\/05\/spirit-dance-to-undergo-major-changes\/","content":"[caption id=\"attachment_63821\" align=\"alignright\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A7363.jpg\"><img class=\"wp-image-63821 size-full\" title=\"julia asin\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A7363.jpg\" alt=\"Performers pull off a stunt in last years spirit dance competition. This year, the routines will take place on the football field and will have no maximum number of participants per grade. Photo by Cathy Rong. \" width=\"640\" height=\"468\" \/><\/a> Performers pull off a stunt in last year's Spirit Dance competition. This year, the routines will take place on the football field and will not have a maximum number of participants per grade, according to ASB's press release. Photo by Cathy Rong.[\/caption]\r\n\r\nAfter many conflicts and issues with Spirit Dance over the past few years, the Associated Student Body at Palo Alto High School voted this week to change the format of the dances significantly for this year's Spirit Week.\r\n\r\nThe most important change to the Spirit Dances will be the number of dancers in each grade's dance. In previous years, students wishing to participate in the dance would audition, and from that group, five guys and five girls were chosen. This year, anyone will be allowed to sign up for their grade's dance, and the minimum number of participants will be five guys and five girls. However, there is no specified maximum, according to <a href=\"https:\/\/docs.google.com\/document\/d\/1AK7YSINyJVLwji-zyfTxk47aUUyb8oM7JCIs6-oT90w\/edit?pli=1\">ASB's meeting minutes<\/a>, which are posted online daily.\r\n\r\nSimilar to Gunn High School's \"airbands\" dances, ASB hopes this new format will promote grade unity and inclusiveness, according to ASB President Claire Liu.\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330\">\r\n<div class=\"_5wd9\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\"><span class=\"_5yl5\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0.0\">\"Making changes to the old Spirit Dance structure and selection process has been a goal that ASB has been thinking about for a while now, but it has sat on the back burner until very recently,\" Liu said. \"<\/span>It was definitely by no means a casual switch-up ASB just decided to carry out, but a very serious topic of debate that took up hours of class time and out-of-school brainstorming and debate.\"\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">The new scoring system will be include one point given for each class member in the dance.\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\"Spirit Dance final scores will remain at 800 for 1st place, 700 for 2nd place, 600 for 3rd place and 500 for 4th place,\" ASB's <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxwYWhzYXNifGd4OmEyOWU3NTliNzUzYzk2Mg\">press release<\/a> states. \"Classes will receive one point for each student that performs in the Spirit Dance. For example, a class that earns second place in the dance with 40 dancers participating would receive 700 points for 2nd place, as well as 40 additional points, resulting in a final total score of 740.\"\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">Although some students prefer the smaller selected group of dancers for the Spirit Week dances, ASB is confident that the new system will bring out a positive change for the school, according to Liu.\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\"Both ASB and I emphasize, this is not at all an 'unrealistic' or 'impossible' change,\" Liu said. \"Gunn High School and many other high schools in the Bay Area utilize a completely inclusive Spirit Dance structure, and they pull it off beautifully.\"\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">The leaders of these dances will be chosen by the respective class officers using an application system. Two to four people will be chosen per grade to lead their group's dance, according to <a href=\"https:\/\/docs.google.com\/document\/d\/1AK7YSINyJVLwji-zyfTxk47aUUyb8oM7JCIs6-oT90w\/edit?pli=1\">ASB's meeting minutes<\/a>.\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div data-reactid=\".1m.$mid=11409868505667=2e05a727f6401394330.2:0.0.0.0\">\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".1m.$mid=11409868587447=23f680717443ec55816\">\r\n<div class=\"_3ry4\" data-reactid=\".1m.$mid=11409868587447=23f680717443ec55816.2:1\">\"As a body, ASB realizes that the new structure of Spirit Dance will initially be more challenging in some ways,\" Liu said. \"But we believe strongly in the potential of our peers to find ways to solve these obstacles and create some amazing numbers.\"\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".1m.$mid=11409868782070=2da9e7a85c7ea593299\">\r\n<div class=\"_3ry4\" data-reactid=\".1m.$mid=11409868782070=2da9e7a85c7ea593299.2:1\">\r\n\r\n&nbsp;\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"After many conflicts and issues with Spirit Dance over the past few years, the Associated Student Body at Palo Alto High School voted this week to change the format of the dances significantly for this year's Spirit Week.","date":"2014-09-05 16:12:10","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A7153.jpg","categories":["News","Spotlight","Uncategorized"],"tags":[]},{"id":73458,"title":"Junior class decides Spirit Week theme","permalink":"http:\/\/palyvoice.com\/2014\/09\/05\/junior-class-decides-spirit-week-theme\/","content":"The Palo Alto High School Class of 2016 is saying \"Ahoy!\" to its new theme of pirates for Spirit Week this year.\r\n\r\nThe juniors have voted for the theme of pirates over choices such as \"El Dorado,\" \"Great Gatsby\" and \"money\" for Spirit Week 2014, according to junior Vice President Eli Friedlander. The online vote ended earlier this morning.\r\n\r\n\"I'm really excited about this theme, and our float should be amazing,\" Friedlander said.\r\n\r\nThe Class of 2017's theme, announced last week, will be \"red card,\" meaning sophomores will dress in soccer-related attire.\r\n\r\nThe senior theme is expected to be announced sometime next week, following a class vote. The freshmen are currently in the process of organizing their Spirit Week theme ideas.\r\n\r\nMore information to follow as themes become available.","excerpt":"The Palo Alto High School Associated Student Body announces the juniors' finalized Spirit Week theme.","date":"2014-09-05 15:48:22","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","9760":"juniors","27181":"spirit week 2014","27182":"themes"}},{"id":73107,"title":"Football season preview: New coach, new leadership, new goals","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/football-season-preview-new-coach-new-leadership-new-goals\/","content":"With the departure of long time head coach Earl Hansen and senior star quarterback Keller Chryst, the Palo Alto High School football team has its eyes set on lofty heights headed by a new core of leaders.\r\n\r\n[caption id=\"attachment_73375\" align=\"alignright\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_20140829_1845311.jpg\"><img class=\"wp-image-73375\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_20140829_1845311.jpg\" alt=\"Members of the Palo Alto High School football team take a knee in the middle of the field prior to their August 29 scrimmage against Aragon. Photo by Josh Yuen. \" width=\"393\" height=\"230\" \/><\/a> Members of the Palo Alto High School football team take a knee in the middle of the field prior to their August 29 scrimmage against Aragon. Photo by Josh Yuen.[\/caption]\r\n\r\nThe regular season kicks off at 7 p.m. tomorrow evening on the road against Sequoia High School.\r\n\r\nFirst-year head coach Jake Halas, a former assistant on Hansen's coaching staff, said that replacing Hansen has not been an issue of concern or as hard as people initially thought, citing his thrill for the start of the season as his No. 1 emotion.\r\n\r\n\"I'm more excited than anything,\" Halas said. \"I don't feel anxious or nervous to fill [the head coaching position]. That's not the pressure. The pressure is getting the team to all be on the same page.\"\r\n\r\nLast year's team, which finished 6-6 overall, had its season cut short when it fell to the Saint Francis Lancers during the second round of league playoffs.\r\n\r\nAlong with Chryst, other graduated seniors included Malcolm Davis, Keesean Johnson and Andrew Frick. Despite these departures, junior quarterback Oliver Svirsky is confident in his teammates, most notably on offense.\r\n\r\n\"Our current roster is solid,\" Svirsky said. \"We are very strong in our receiver and running back spots and overall I think we can do great things as a unit. Our coaching staff is very committed and very invested in making us a better team, setting us up to be successful.\"\r\n\r\nOne of Svirsky's top receivers this year, junior Eli Givens, echoed Svirsky's words, adding that he has a personal goal for the upcoming season. According to Halas, Givens is coming off a year where he was named All-League sophomore of the year.\r\n\r\n\"It's going to be a good season,\" Givens said. \"We've got great coaches and great teammates. My top goal is to get over 1,000 receiving yards this year.\"\r\n\r\nSvirsky and Givens, along with juniors Mikey Grandy, Tonga Latu and senior Jayshawn Puckett, are this year's team captains. With the current roster standing at 22 juniors compared to just nine seniors, Halas believes that the team is in need of some senior leadership, citing Puckett as a key veteran presence.\r\n\r\n\"We do have some seniors that we need to step up,\" Halas said. \"We need him to step up. There's a couple other seniors, but we are junior heavy. We need some senior leadership, we need somebody to step up from the senior class.\"\r\n\r\nOverall, Halas is eager to see if his team's success in practice will pay off during games.\r\n\r\n\"I'm looking forward to seeing these guys play,\" Halas said. \"We've got Sequoia, next week, so we'll see what we can do. I'm really curious to see our boys compete. They've been working hard, there's no doubt. We'll just see if we can put it all together.\"\r\n\r\nThe Vikings first home game is at 7 p.m. on Sept. 19 against the Archbishop Mitty Monarchs.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"With the departure of long time head coach Earl Hansen and senior star quarterback Keller Chryst at the conclusion of last season's Central Coast Section playoff loss, The Palo Alto High School football team has their eyes set on lofty heights headed by a new core of leaders. The regular season kicks off at 7 p.m. tomorrow evening  on the road against Sequoia High School.","date":"2014-09-04 22:14:48","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_20140829_1845311.jpg","categories":["Football","Sports"],"tags":{"8475":"andrew frick","8661":"earl hansen","9656":"eli givens","8714":"football","25424":"jake halas","25427":"jayshawn puckett","8827":"keller chryst","9801":"malcolm davis","25425":"mikey grandy","17730":"Mitty","12043":"new coach","9947":"oliver svirsky","25429":"saint francis","12045":"season preview","25428":"sequoia","9117":"spencer drazovich","25426":"tonga latu"}},{"id":73300,"title":"Boys&#8217; cross country returns after injury-filled season","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/boys-cross-country-returns-after-injury-filled-season\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_73405\" align=\"alignnone\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/boysxc-300x2002.jpg\"><img class=\"wp-image-73405\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/boysxc-300x2002.jpg\" alt=\"The boys cross-country team starts its SCVAL championship race last season at Crystal Springs. The track is 2.95 miles. \" width=\"500\" height=\"333\" \/><\/a> The boys cross-country team starts its SCVAL championship race last season at Crystal Springs. The track is 2.95 miles. Photo courtesy of Malcolm Slaney.[\/caption]\r\n\r\nComing off a disappointing ninth place finish in Central Coast Selection last year, the Palo Alto High School boys’ cross country team hopes to crown a champion this year, starting with its first meet at 3 p.m. today at Gunn High School.\r\n\r\nLast year the team was not at full health, with hip injuries to top runners senior Lucas Matison and sophomore Kent Slaney. This year, coach Kelsey Feeley says she expects the team will have a chance at competing for the state championship.\r\n\r\n“Lucas Matison won a league meet with a time that would’ve won CCS and had an accident, and therefore was not able to run at CCS,” Feeley said. “Our other breakout star Kent Slaney was also injured but still ran for CCS.”\r\n\r\nLast season the team had no seniors at CCS, two juniors, and the rest sophomores and freshmen. Because many top runners are returning, and not very many graduated or left, the team is optimistic that this year will be more successful according to senior captain Andrew Wilson.\r\n\r\n“For the team, states would be really cool because we have a lot of talent,” Wilson said.\r\n\r\nPaly squares off against Gunn for its first match tomorrow, and Feeley wants to use the opportunity to evaluate the runners.\r\n\r\n“I really want to get a sense of the fitness levels of the runners,” Feeley said. “I want to use it as a time trial and solidify the top seven runners.”\r\n\r\nBoys' cross Country will compete at 3 p.m. today at Gunn High School.","excerpt":"Coming off a disappointing ninth place finish in Central Coast Selection last year, the Palo Alto High School boys’ cross country team hopes to crown a champion this year, starting with its first meet at 3 p.m. today at Gunn High School.","date":"2014-09-04 15:39:58","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/boysxc-300x2002.jpg","categories":["Sports"],"tags":{"25414":"boys cross country","8620":"cross country","25415":"girls cross country","11393":"kelsey feeley","10041":"Lucas Matison","11241":"paul jones","12045":"season preview"}},{"id":73411,"title":"Girls&#8217; cross country returning with high hopes","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/girls-cross-country-returning-with-high-hopes\/","content":"[caption id=\"attachment_73416\" align=\"alignleft\" width=\"337\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo11.jpg\"><img class=\"wp-image-73416 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo11.jpg\" alt=\"Girls' cross country takes off at the Santa Clara meet last season. Photo courtesy of Ami Drez.\" width=\"337\" height=\"451\" \/><\/a> Girls' cross country takes off at the Santa Clara meet last season. Photo courtesy of Ami Drez.[\/caption]\r\n\r\nAfter finishing sixth in the Central Coast Section last year and third in the league last season, the Palo Alto High School girls’ cross country team is looking toward its first meet at 3 p.m. today at Gunn High School.\r\n\r\nHeading into CCS last season, injuries from over-training and sickness to top runners hindered Paly’s chances. Coach Paul Jones wants to move past last years' injuries, with new goals for the upcoming season.\r\n\r\n“This year I want everyone to contribute for a good team wide experience,” Jones said. “For varsity we’ve always wanted to go to states [California Interscholastic Federation State Championship].”\r\n\r\nSenior captain Katie Foug, while not making it to states last year, hopes that she will return to states this year, along with the rest of her team.\r\n\r\n“For varsity we’ve always wanted to go to states,” Foug said. “Which means qualifying for first or second at CCS.”\r\n\r\nAfter only graduating 2014 senior Audrey Debruine, the team believes they can still build on the success of last season, according to junior Portia Barrientos.\r\n\r\n“This year we only lost one senior so our team is mostly returning runners,” Barrientos said.  “I think the experience from last year will lead to improved performance.” <em> <\/em>\r\n\r\nGirls' cross country will compete at 3 p.m. today at Gunn High School.\r\n\r\n&nbsp;","excerpt":"After finishing sixth in the Central Coast Section last year and third in the league last season, the Palo Alto High School girls’ cross country team is looking toward its first meet at 3 p.m. today at Gunn High School.","date":"2014-09-04 15:39:12","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo11.jpg","categories":["Sports"],"tags":[]},{"id":72896,"title":"Here to school you: new English teachers","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/here-to-school-you-new-english-teachers\/","content":"[caption id=\"attachment_73024\" align=\"aligncenter\" width=\"536\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/picstitch.jpg\"><img class=\"wp-image-73024\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/picstitch.jpg\" alt=\"picstitch\" width=\"536\" height=\"536\" \/><\/a> The four new teachers of the English Department smile for the camera. From left to right: Bo Cheli, Trinity Klein, Richard Rodriguez and George Vuong. Photo by Maddy Jones.[\/caption]\r\n\r\nFour new teachers are starting their new positions in the English department at Palo Alto High School for the 2014-15 school year. The Paly Voice sat down with these new teachers to get to know them better.\r\n\r\n<strong>Bo Cheli<\/strong>\r\n\r\n[caption id=\"attachment_72988\" align=\"aligncenter\" width=\"391\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-11.jpg\"><img class=\"wp-image-72988\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-11.jpg\" alt=\"photo 1\" width=\"391\" height=\"271\" \/><\/a> New English teacher Bo Cheli smiles from his desk in his classroom. Cheli is teaching both freshmen and sophomores in the regular and accelerated lanes. Photo by Maddy Jones.[\/caption]\r\n\r\nBo Cheli is teaching freshmen and sophomores in both the accelerated and regular lanes of English. Previously, Cheli taught for eight years in San Jose and for four years at Homestead High School, where he regularly taught juniors and seniors.\r\n\r\nTo check out Cheli's interview, click <a href=\"http:\/\/palyvoice.com\/?p=73337&amp;preview=true\">here<\/a>.\r\n\r\n<strong>Trinity Klein<\/strong>\r\n\r\n[caption id=\"attachment_73028\" align=\"aligncenter\" width=\"296\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-3-1-2.jpg\"><img class=\"wp-image-73028\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-3-1-2.jpg\" alt=\"photo 3-1 (2)\" width=\"296\" height=\"395\" \/><\/a> English teacher Trinity Klein smiles in her classroom. Klein has returned to Paly after working at Gunn. Photo by Maddy Jones.[\/caption]\r\n\r\nTrinity Klein teaches in the 10th grade accelerated lane. For the past four years Klein worked in administration at Gunn. Klein also previously taught for 13 years at Paly (the last year she spent at Paly was as dean of students).\r\n\r\nTo check out Klein's interview, click<a href=\"http:\/\/palyvoice.com\/?p=73340&amp;preview=true\"> here<\/a>.\r\n\r\n<strong>Richard Rodriguez<\/strong>\r\n\r\n[caption id=\"attachment_73029\" align=\"aligncenter\" width=\"283\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-4-2.jpg\"><img class=\"wp-image-73029 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-4-2.jpg\" alt=\"photo 4 (2)\" width=\"283\" height=\"378\" \/><\/a> New English teacher Richard Rodriguez smiles  inside his classroom. Rodriguez was previously teaching Southern California in Los Angeles, but moved to Northern California in Palo Alto to teach at Paly. Photo by Maddy Jones.[\/caption]\r\n\r\nRichard Rodriguez is teaching both the accelerated lane for freshmen and World Literature for seniors. Rodriguez taught for 16 years in Los Angeles, where he spent most of his time at Venice High School. At Venice High School Rodriguez taught everything from seventh grade in the gifted lane all the way to 12th grade, according to Rodriguez.\r\n\r\nTo check out Rodriguez's interview, click <a href=\"http:\/\/palyvoice.com\/?p=73343&amp;preview=true\">here<\/a>.\r\n\r\n<strong>George Vuong<\/strong>\r\n\r\n[caption id=\"attachment_73027\" align=\"aligncenter\" width=\"276\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-2-teacher-pink-2.jpg\"><img class=\"wp-image-73027\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-2-teacher-pink-2.jpg\" alt=\"photo 2 teacher pink (2)\" width=\"276\" height=\"367\" \/><\/a> New English teacher George Vuong poses smiles outside his classroom in the Media Arts Center. Vuong teaches the accelerated lanes of both ninth and tenth graders. Photo by Maddy Jones.[\/caption]\r\n\r\nGeorge Vuong teaches both freshmen and sophomores in the accelerated lanes. Vuong originally worked as an assistant systems manager at a health and beauty company that focused on organic skincare, but switched to teaching for the greater social interaction. Vuong worked as a student teacher at Santa Barbara High School and then came to Paly, where he says he has enjoyed the mentorship and support that has been offered to new teachers.\r\n\r\nTo check out Vuong's interview, click <a href=\"http:\/\/palyvoice.com\/?p=73344&amp;preview=true\">here<\/a>.","excerpt":"Four new teachers dive into the English department at Palo Alto High School for the 2014-15 school year. The Paly Voice sat down with these new teachers to get to know them better.","date":"2014-09-04 13:44:35","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/picstitch.jpeg","categories":["Editor's Pick","Features"],"tags":{"25048":"Bo Cheli","25044":"Cheli","8674":"english","25051":"George Vuong","25045":"Klein","8915":"new teachers","25042":"new teachers 2014","25050":"Richard Rodriguez","25046":"Rodriguez","9150":"Teacher","25043":"teachers 2014","25049":"Trinity Klein","25047":"Vuong"}},{"id":73165,"title":"Review: Meet Belcampo — the new butchers on the block","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/review-meet-belcampo-the-new-butchers-on-the-block\/","content":"At first glance, you would probably not guess that Belcampo Meat Co. in the Town and Country Shopping Center offered more than most butcher shops.  From the outside, the building looks long and narrow, and from the entrance, you can only see the arrays of meat displayed in cases to greet customers.\r\n\r\nDuring lunch, however, a long line of students trails out the front door.  A chalkboard sits at the back end of the store just above the cashier so that once in the shop, you can easily see a short, two-column list of sandwiches, salads and other meat-containing food items for sale written in chalk.\r\n\r\nAccording to Kiley Boettcher, the general manager of the store, Belcampo identifies as both a butcher shop and restaurant.  Besides this duality, however, something even more noteworthy distinguishes Belcampo from other Town and Country shops.\r\n\r\n“We have a 10,000-acre parcel of land up in Siskiyou County near Mount Shasta,\" Boettcher said.  \"We raise all of our own animals there. We’re pasture raised, USDA [United States Department of Agriculture] certified organic, grass-fed [and] grass-finished.”\r\n\r\nBut that's not all: the company's do-it-yourself attitude extends past just the ownership of the farm and livestock.\r\n\r\n[caption id=\"attachment_73167\" align=\"alignright\" width=\"360\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_2854.jpg\"><img class=\"wp-image-73167\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_2854.jpg\" alt=\"_MG_2854\" width=\"360\" height=\"240\" \/><\/a> A Philadelphia Cheesesteak ($12) from Belcampo Meat Co.  Belcampo opened this past summer in Town and Country. Photo by George Lu[\/caption]\r\n\r\n“We also own our processing facility, which we built from the ground up.  So we own the farm, the processing facility, and the locations — that sets us apart from most restaurants. Most restaurants are going to be getting [produce] from some other source ... so that definitely sets us apart from everyone else.”\r\n\r\nThis is neither the first nor only Belcampo.  Other Belcampo locations can be found scattered throughout the Bay Area and Southern California, some of which offer sit-down dining.\r\n\r\nIncluded on the Belcampo menu are the pulled pork bun, braised lamb belly bun, chili, steak salad, meatball sandwich and smoked jalapeno and cheddar sausage, all of which fall somewhere between $5 and $13.\r\n\r\nI ordered the Philadelphia Cheesesteak, BBQ Chicken Bun, and Belcampo Hot Dog student special. The cheese steak, one of the most expensive item on the take-out menu at $12, was phenomenal.  The meat was juicy and tender and the cheese perfectly melted, while the hoagie bun was lightly toasted with a softer center.  I especially loved the generous helping of meat in the sandwich, as well as the noticeable freshness of the vegetables.\r\n\r\nThe chicken bun and the hot dog, both parts of Belcampo’s student special, were equally impressive.  The meat tasted fresh and the bun in particular had a good ratio of meat to barbeque sauce, which had a perfect sweet richness to it.  The only drawback was the portion size — for $5, I had expected to get something a bit bigger than the hockey puck-sized sandwich.  Even as part of the student special, the chicken bun is comparable to Lulu’s student special in terms of price, but only offers a fraction of the serving size, even though it also comes with a side of fries.\r\n\r\nThe hot dog deal seemed a better deal in terms of amount of food, and was only $6, but the food was a bit more plain — it really was just a hot dog, bun, and side of fries, which I found to be extremely average in crunchiness and general taste.  The lack of condiments available at the store was also a turn-off as I felt that they could have added some needed flavor to the fries.\r\n\r\nOverall, while Belcampo certainly offers high quality food, hungry high school students might avoid it for the small serving sizes.  However, Belcampo still remains an excellent alternative to the other restaurants of Town and Country and should not be judged too quickly.  Perhaps the most exciting prospect for the majority of high schools students is a plan to rotate items on the student special in order to let students experience the entire menu.\r\n\r\nIn the future, Boettcher also says to look out for additions to the menu unique to Palo Alto.\r\n\r\n“Eventually we’re going to put out some specials and some things that are a little bit off to the side, like kind of secret menu items,” he said.\r\n\r\n[caption id=\"attachment_73170\" align=\"alignright\" width=\"395\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_28301.jpg\"><img class=\"wp-image-73170\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_28301.jpg\" alt=\"IMG_2830\" width=\"395\" height=\"263\" \/><\/a> Belcampo Meat Co. offers not only quality takeout food, but also fresh cuts of meat. Photo by George Lu[\/caption]\r\n\r\nBoettcher also expressed the possibility of expanding the site to include catering.\r\n\r\n“We have a great opportunity here in Silicon Valley to provide our food to different companies in the area for luncheons or for conferences and meetings, so we’re definitely trying to reach out to them at some point once we get the catering side of Belcampo up and running.”\r\n\r\nAt the moment, however, he said that Belcampo Palo Alto is focused on simply getting more exposure.\r\n\r\n“We definitely want to get our name out there and let people know that we’re here, that we’re providing a great service [and] a great quality product,” Boettcher said.\r\n\r\n&nbsp;","excerpt":"At first glance, you would probably not guess that Belcampo Meat Co. in the Town and Country Shopping Center offered more than most butcher shops. ","date":"2014-09-04 13:43:43","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_2827.jpg","categories":["Reviews"],"tags":{"25269":"Belcampo","25270":"Belcampo Meat Co.","8713":"Food","9045":"review","9179":"Town and Country"}},{"id":73380,"title":"Verbatim: Should college athletes receive pay for their participation?","permalink":"http:\/\/palyvoice.com\/2014\/09\/04\/verbatim-should-college-athletes-receive-pay-for-their-participation\/","content":"With fall sports underway at Palo Alto High School, the Paly Voice asked a variety of students, coaches and staff members whether they felt college student-athletes should get paid.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/ib3zmFghHJM\" width=\"420\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"With fall sports underway at Palo Alto High School, the Paly Voice asked a variety of students, coaches and staff members whether they felt college student-athletes should get paid.","date":"2014-09-04 13:38:43","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-04-at-1.35.49-PM.png","categories":["Verbatims"],"tags":{"26814":"college athletes","9120":"sports","9201":"verbatim"}}]