[{"id":77209,"title":"Juniors win Lincoln-Douglas debate and Original Prose and Poetry speech competitions","permalink":"http:\/\/palyvoice.com\/2014\/10\/26\/juniors-win-lincoln-douglas-debate-and-original-prose-and-poetry-speech-competitions\/","content":"","excerpt":"","date":"2014-10-26 19:35:14","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8638":"debate","30940":"ld","8851":"lincoln douglas","30941":"opp","30942":"original prose and poetry","10196":"speech"}},{"id":76947,"title":"Preview: Spirit Week kicks off with Theme Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/25\/preview-spirit-week-kicks-off-with-theme-day\/","content":"The most anticipated week of the year for some, Spirit Week, is kicking off with Theme Day on Monday at Palo Alto High School.\r\n\r\n[caption id=\"attachment_77052\" align=\"alignright\" width=\"306\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\"><img class=\"wp-image-77052\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\" alt=\"The juniors cheer during Spirit Week 2013.  Juniors dressed as hippies to follow along with their theme of &quot;Yellow Submarine.&quot; Photo by Molly Fogarty and Cathy Rong.\" width=\"306\" height=\"204\" \/><\/a> The juniors cheer during Spirit Week 2013. Juniors dressed as hippies to follow along with their theme of \"Yellow Submarine.\" Photo by Molly Fogarty and Cathy Rong.[\/caption]\r\n\r\nTheme day is when each grade dresses according to its theme, which was selected by each individual class. If you need some inspiration for outfits, check out these suggestions <a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/must-have-spirit-week-outfits\/\">here<\/a>. The senior theme is \"Great Gatsby,\" but seniors will be donning their customary '90s attire. Juniors will be dressing as \"Pirates\" based off of their class color yellow. The sophomores will sport athletic attire based off their theme \"Red Card.\" The freshman theme is \"The Lion King,\" but their outfits may also include any other Disney character.\r\n\r\nMonday's rally will be held on the football field at lunch. According to Student Activities Director Matt Hall, there will be three Minute to Win It games, where contestants have one minute to complete the given task. The two new games are \"Shake it\" and \"Nose Dive,\" and the one returning game from last year's Spirit Week is \"Banana Bump.\"\r\n\r\n\"After a wild and crazy introduction last year, we decided to keep it ['Banana Bump'],\" Hall said. \"It got approved, so we're going to do it, and that will be fun.\"\r\n\r\nTo play \"Shake it,\" one representative from each class will have one pedometer strapped to a leg and arm each. Participants then will move around for one minute, and those with the highest number of \"steps\" at the end wins. \"Nose Dive\" also requires one participant from each grade. The task for \"Nose Dive\" is to transfer the greatest number of cotton balls from one bowl to another using just petroleum jelly on the contestant's noses. The returning game from last year, \"Banana Bump,\" requires one participant from each class to attach a banana to their waist by string and push an orange on the ground to the finish line.\r\n\r\n[caption id=\"attachment_77053\" align=\"alignleft\" width=\"275\"]<img class=\"wp-image-77053\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6292.jpg\" alt=\"Freshmen dress according to their theme &quot;Warning\/Under Construction&quot; during Spirit Week 2013. Photo by Molly Fogarty and Cathy Rong.\" width=\"275\" height=\"183\" \/> Freshmen dress according to their theme \"Warning\/Under Construction\" during Spirit Week 2013. Photo by Molly Fogarty and Cathy Rong.[\/caption]\r\n\r\nAssociated Student Body Spirit Commissioners junior Ariya Momeny and junior Emma Cole are leading this year's Spirit Week activities.\r\n\r\n\"I like the fact that our Spirit Commissioners Ariya and Emma are building on last year,\" Hall said.\" Not totally [making it] different, but making some flavor. I think they're going to do a great job with that.\"\r\n\r\nASB's <a href=\"https:\/\/docs.google.com\/document\/d\/1bPEzIA7J8f9gzzhj8F6MBPIL22QhTcWecieUYFyMTGM\/edit?pli=1\">master doc<\/a> is available for info on the week's schedule and detailed rules for each of the activities. Be sure to check back to The Paly Voice for all things Spirit Week 2014.","excerpt":"The most anticipated week of the year for some, Spirit Week, is kicking off with Theme Day on Monday. Freshmen dressed according to \"Lion King,\" sophomores to \"Red Card,\" juniors to \"Pirates\" and seniors to '90s.","date":"2014-10-25 17:46:50","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6286.jpg","categories":["Spirit Week 2014"],"tags":{"30854":"90s","30873":"lion king","30851":"pirates","30872":"preview spirit week","30844":"red card","9119":"Spirit Week","27181":"spirit week 2014","9695":"theme day"}},{"id":76942,"title":"Float building to begin Saturday","permalink":"http:\/\/palyvoice.com\/2014\/10\/24\/float-building-to-begin-saturday\/","content":"[caption id=\"attachment_63814\" align=\"alignright\" width=\"337\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg\"><img class=\"wp-image-63814 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg\" alt=\"Juniors dance around their float, themed after 'Yellow Submarine.&quot; Photo by Cathy Rong. \" width=\"337\" height=\"232\" \/><\/a> Juniors dance around their float, themed after \"Yellow Submarine\" at the last rally of Spirit Week 2013. Photo by Cathy Rong.[\/caption]\r\n\r\nPalo Alto High School students will kick off Spirit Week festivities with float building starting on Saturday at 9 a.m. in the auto shop on campus.\r\n<p style=\"text-align: left;\">The auto shop will be open for building floats on Saturday and Sunday from 9 a.m. to 4 p.m. and Monday through Thursday from 4 p.m. to 9 p.m. All Paly students are welcome to help build the float for their respective grades, which includes structuring wire, painting, making paper mache and more.<\/p>\r\n<p style=\"text-align: left;\">Every grade designs a float to represent its overall class Spirit Week theme. For Spirit Week 2014, the freshman theme is \"The Lion King,\" the sophomore theme is \"Red Card,\" the junior theme is \"Pirates\" and the senior theme is \"Green Light.\"<\/p>\r\n<p style=\"text-align: left;\">ASB senior class president Maya Ben-Efraim encourages all students to get involved.<\/p>\r\n<p style=\"text-align: left;\">\"It's really fun and no previous experience is necessary,\" Ben-Efraim said. \"There are always a ton of nice people, food and music.\"<\/p>\r\n<p style=\"text-align: left;\">Each grade's float will be judged at the Oct. 31 afternoon rally, the last rally of Spirit Week. The judges will score the float based on the following rubric, according to the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">Paly ASB site<\/a>.<\/p>\r\n\r\n\r\n[caption id=\"attachment_77039\" align=\"alignnone\" width=\"578\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-2.29.46-PM.png\"><img class=\"size-full wp-image-77039\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-2.29.46-PM.png\" alt=\"Spirit Week floats will be judged based on this rubric at the Friday afternoon rally. 16 points would be a perfect score, and classes that tie will be award the full points of the place for which they tied. Screenshot from Paly ASB site. \" width=\"578\" height=\"288\" \/><\/a> Spirit Week floats will be judged based on this rubric at the Friday afternoon rally. 16 points would be a perfect score, and classes that tie will be awarded the full points of the place for which they tied. Screenshot from Paly ASB site.[\/caption]\r\n<p style=\"text-align: left;\"><\/p>","excerpt":"Paly students will kick off Spirit Week festivities with float-building, starting on Saturday at 9 a.m. in the auto shop on campus.","date":"2014-10-24 19:35:43","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg","categories":["News","Spirit Week 2014","Uncategorized"],"tags":{"15099":"float","30857":"float building","30858":"maya ben-efraim","9119":"Spirit Week"}},{"id":77088,"title":"Verbatim: Spirit Week 2014","permalink":"http:\/\/palyvoice.com\/2014\/10\/24\/verbatim-spirit-week\/","content":"The Paly Voice asked students, teachers and admin about their opinions for this year's upcoming Spirit Week.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/SzKLtA-hz9U\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asked students, teachers and admin about their opinions for this year's upcoming Spirit Week.","date":"2014-10-24 16:47:44","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-24-at-2.03.01-PM.png","categories":["Multimedia","Spirit Week 2014","Spotlight","Video"],"tags":{"30886":"aiva petriceks","30882":"Alex","30887":"alex sun","30884":"Alisha Kumar","30883":"Andrea","30881":"casey glassford","11372":"daryl dillahunty","8834":"Kim Diorio","30885":"mimi park","9119":"Spirit Week","9201":"verbatim"}},{"id":76834,"title":"WASC releases goals for new accreditation cycle","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/wasc-releases-goals-for-new-accreditation-cycle\/","content":"Paly is creating an action plan for the next six years following the <a href=\"http:\/\/palyvoice.com\/2014\/09\/21\/what-is-wasc\/\">Western Association of Schools and Colleges<\/a> Coordinator Emily Garrison's release of the three goals for the next accreditation cycle on Tuesday in the Media Arts Center atrium.\r\n\r\nThe goals for Paly's next accreditation cycle, which begins fall 2015, are:\r\n\r\n1) Systems alignment for greater consistency around learning outcomes to reduce undue stress.\r\n\r\n2) Research-based instructional practices that increase student engagement for all students.\r\n\r\n3) Innovative school culture promoting global competencies, creativity, and empathy.\r\n\r\nGarrison presented the goals in a student press conference held in the Media Arts Center atrium during tutorial on Tuesday.\r\n\r\nGarrison has involved students, parents, administration and teachers in the goal-drafting process. After over a year of collaboration, teachers had a final opportunity to provide their opinion on the goals during the Staff Development Day on October 10th, according to Garrison.\r\n\r\n“The more people you have involved in the process the better,” Garrison said. \"You can network, you can come together, especially in a unified district.”\r\n\r\nPaly senior and WASC Student Leader Arin Tai-Seale thinks student involvement in WASC is an advantage.\r\n\r\n\"Any time during the WASC process comments and questions are welcome from anyone. So students can have a large impact on the process if we choose to,\" Tai-Seale said.\r\n\r\nAt the end of a retreat for student leaders and other members of WASC held in the English Resource Center, WASC members voted to select the three goals, according to Tai-Seale.\r\n\r\n[caption id=\"attachment_76852\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-21.jpg\"><img class=\"size-full wp-image-76852\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-21.jpg\" alt=\"Posters like this &quot;Stress Tree&quot; were used to break down the problems students face at Paly and isolate weaknesses.\" width=\"600\" height=\"800\" \/><\/a> Posters like this \"Stress Tree\" were used to break down the problems students face  and determine weaknesses at Paly.[\/caption]\r\n\r\n\"It was a very open process, however there were not very many students involved in the retreat ... about five students were present during the retreat at different time intervals,\" Tai-Seale said. In addition to the retreat, WASC members have surveyed 1,800 Paly students in their English classes and talked individually with a few hundred, according to Garrison.\r\n\r\nIt took Garrison 18 months to craft WASC’s goals. “They’re extraordinarily powerful, but they’re very lofty, so it's going to take a lot of work for us [to meet them],” Garrison said.\r\n\r\n\"I specifically pushed for targeting student stress and reevaluating the phrase 'fear of failure'. Both of these ended up in the three goals,\" Tai-Seale said.\r\n\r\nWASC analyzed data from the California Department of Education’s website to find Paly’s areas of improvement.\r\n\r\n“There are a lot of things we look at, everything from basic demographics – student demographics, teacher demographics, so that’s ethnicity, gender, socioeconomic status, students with IEP [Individualized Education Program] plans,” Garrison said, “to the big standardized tests like STAR [Standardized Testing and Reporting]\".\r\n\r\n\"We look at the number of students taking APs and the average scores they get and ... compare [Paly] to other schools in our county and in California,” Garrison said.\r\n\r\nWithout accreditation, students’ transcripts are not accepted by most colleges. A school is accredited for a period of six years at the end of which a new cycle starts and the school must be evaluated again. As part of the WASC evaluation, a high school must not only pinpoint the school’s weaknesses, but create a strategy to strengthen them, which Garrison and WASC leaders plan to achieve now that Paly's goals have been released.\r\n\r\n&nbsp;","excerpt":"Paly is creating an action plan for the next six years following the Western Association of Schools and Colleges Coordinator Emily Garrison's release of the three goals for the next accreditation cycle on Tuesday in the Media Arts Center atrium.","date":"2014-10-23 22:52:24","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_4408.jpg","categories":["News"],"tags":{"30880":"accreditation cycle","30877":"Arin Tai-Seale","30878":"Garrison","30879":"Paly goals","27774":"WASC"}},{"id":76893,"title":"&#8220;Must have&#8221; Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/must-have-spirit-week-outfits\/","content":"[caption id=\"attachment_76987\" align=\"alignnone\" width=\"585\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.16.51-PM.png\"><img class=\"wp-image-76987\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.16.51-PM.png\" alt=\"Screen Shot 2014-10-23 at 1.16.51 PM\" width=\"585\" height=\"321\" \/><\/a> During Spirit Week's color day last year, the freshmen wore orange, sophomores wore red, juniors wore yellow and seniors wore green. Photo by Cathy Rong.[\/caption]\r\n\r\nWith Spirit Week right around the corner, it's time to get started on outfit planning. The five-day event can be slightly daunting, but if you plan ahead and take it a day at a time, you'll be ready to go with minimal stress. If you're creative and resourceful, there are easy ways to make cheap outfits that have potential to win \"Best Dressed.\" This is one of the best weeks of high school, so start planning now and get pumped.\r\n\r\nHere's our take on how every grade should prepare for each day. Click on the designated grades to read our half-serious, half-joking take on the \"must have\" Spirit Week outfits.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/freshman-spirit-week-outfits\/\">Freshman<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/sophomore-spirit-week-outfits\/\">Sophomore<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/junior-spirit-week-outfits\/\">Junior<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/senior-spirit-week-outfits\/\">Senior<\/a>","excerpt":"Read a half-serious, half-joking take on the \"must have\" Spirit Week outfits for each grade this year.","date":"2014-10-23 14:15:41","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg","categories":["Opinion","Spirit Week 2014","Spotlight"],"tags":{"30849":"Best dressed","8596":"clothes","9795":"freshman","8816":"junior","30835":"outfits","8953":"paly","9085":"senior","29301":"sophomore","9119":"Spirit Week","30842":"suggestions"}},{"id":76895,"title":"Freshman Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/freshman-spirit-week-outfits\/","content":"<em>Freshmen, welcome to Paly Spirit Week, where we go all-out and dress like crazy. You are no longer in middle school, so you should never have the feeling that you are too dressed up or that people will stare – the more original and crazy, the better. Here are a few \"tips\" to prepare yourself for the upcoming week.<\/em>\r\n\r\n<dl id=\"attachment_76999\" class=\"wp-caption alignleft\"><dt class=\"wp-caption-dt\">[caption id=\"attachment_76999\" align=\"alignleft\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5931.jpg\"><img class=\"wp-image-76999\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5931.jpg\" alt=\"IMG_5931\" width=\"237\" height=\"356\" \/><\/a> Staff writers Claire Krugler [left] and Adele Bloch [right] dress as babies for freshmen generation day on Spirit Week's Thursday. Photo by Molly Fogarty.[\/caption]<\/dt><\/dl><strong>[Monday] Theme day - \"The Lion King:\" <\/strong>As Katy Perry once said, “And you’re gonna hear me roar. Louder, louder than a lion.” Don’t be afraid to unleash your inner animal for this day. For a little inspiration, feel free to reenact the beginning scene of \"The Lion King\" by raising the smallest person you can find to the sun and yelling, “It’s the circle of life.” Although you may get weird looks from your friends, be sure to have confidence like the lion that you’ll be dressed as. If you are struggling with dressing up as a character from \"The Lion King,\" you can extend the theme to all Disney characters. However, it's recommended that freshmen dress up as Lion King-specific characters. You can wear all pink to represent a flamingo, or black and white to represent a zebra. If you’re freaking out about not knowing what to wear, just remember “Hakuna Matata.”\r\n\r\n<strong>[Tuesday] Dressing day <\/strong>-<strong> Healthy Choice: <\/strong>Healthy choice day is a day to dress up like the athlete you were never successful in becoming. Biking, running, lacrosse, golf or football – it's time to pick whichever sport you please. Try to stick with one sport throughout the whole outfit, because we really don’t want to see a biker’s helmet with a jersey and a swimsuit bottom. If you’re going for the runner’s look, please keep in mind that if you wouldn’t wear it on your run, don’t wear it. People don’t want to see your pasty thighs in the athletic shorts you'd never wear. And would you really exercise with your hair down? We think not. To complete the look, bring a water bottle of choice – even better, have it be orange, your class color.\r\n\r\n<strong>[Wednesday] Color day - Orange:<\/strong> Orange you glad you’re a freshman? Head on over to Target or Spirit and buy a variety of orange items: tights, shorts, shirts (or wear your class shirt if you bought one), tutus, boas, sunglasses and socks. You can even buy one of those 69-cent mini pumpkins from Trader Joe's to place on your orange spray-painted head. Just remember to go all-out and find everything you can that’s orange. Color day’s an easy day, no matter the color.\r\n\r\n<strong>[Thursday] Generation day - Babies: <\/strong>Cherish this day, because it is by far one of the comfiest days you will experience all year. If you’re feeling stumped on outfit choices, we recommend looking back on all your #tbt pics on Instagram for some inspiration. Our tips: wear a onesie. Don’t limit yourself to the typical, patternless onesies; look around and find unique, flashy or character-oriented onesies. To accompany your outfit, you can wear a saggy diaper with a bonnet. A binky, pacifier or bottle of milk is a nice addition to all baby days as well. Feel free to bring your favorite stuffed animal to school, and please don’t act like you don’t have any more stuffed animals, because we all secretly snuggle with one at night.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"The freshman's first Spirit Week calls for an in-depth look on what to wear for each day. Check it out here.","date":"2014-10-23 14:10:26","author":"Adele Bloch","categories":["Opinion"],"tags":{"30839":"babies","30837":"dressing day","9795":"freshman","30840":"generation day","30841":"green and white","30838":"healthy choice","8928":"Orange","30835":"outfits","8953":"paly","9119":"Spirit Week","30834":"Spirit Week outfits","30836":"The lion king"}},{"id":76897,"title":"Sophomore Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/sophomore-spirit-week-outfits\/","content":"<em>Another round of Spirit Week calls for another round of loving competition. Try to get the best outfits planned now.<\/em>\r\n\r\n<strong>[Monday] Theme day - Red Card: <\/strong>Feel free to take the literal approach for this day and dress up like an actual red card. Let UNO be your inspiration. If you are planning on wearing a jersey, don’t limit yourself to the most famous and typical soccer players such as Lionel Messi, Cristiano Ronaldo and Wayne Rooney. Contrary to popular belief, they really weren't the only players who participated in the World Cup. If you don’t have a jersey, don’t fret. Let’s be honest, jerseys are expensive and aren’t worth it if you’ll only wear them for one day.\r\n\r\n[caption id=\"attachment_77002\" align=\"alignleft\" width=\"206\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.08.45-PM.png\"><img class=\"wp-image-77002\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.08.45-PM.png\" alt=\"Screen Shot 2014-10-23 at 1.08.45 PM\" width=\"206\" height=\"340\" \/><\/a> Staff writers Claire Krugler [left] and junior Adele Bloch [right] dress as cowboys for sophomores second day of Spirit Week, ranch dressing day. Photo by Molly Fogarty.[\/caption]<strong>[Tuesday] Dressing day - Ranch Dressing:<\/strong> It’s country concert time! Slip on the boots, flannels, hats and jeans, and you are ready to go. Try to grow a beard within the next few days since most working cowboys don’t have time to shave on the ranch. Overalls are a great addition to any ranch outfit as well, and don't forget your bandana. Remember, if you're ever feeling down, just saddle up.\r\n\r\n<strong>[Wednesday] Color day - Red:<\/strong> This is a super easy color to dress up for. All you have to do is find any red items you can scavenge around the house. If that’s not enough, head on over to Target or Spirit. You can wear red shirts, tights, tutus, boas, sunglasses, socks and more. To top off the look, take your brightest red nail polish and lipstick and apply. Guys, too.\r\n\r\n<strong>[Thursday] Generation day - Teenyboppers: <\/strong>We personally didn’t know much about Teenyboppers last year, so here are a few definitions to help clear up the confusing term. “The term was introduced in the 1950s to refer to teenagers who mainly listened to pop music and\/or rock and roll and not much else,” according to <a href=\"http:\/\/en.wikipedia.org\/wiki\/Teenybopper\">Wikipedia<\/a>. Teenyboppers are also synonymous to Greasers, a youth subculture that originated in the '50s among teenagers. Take your inspiration from outfits in the popular movie “Grease” or by searching images for “Fashion for teenage boys\/girls in the 1950s.” For guys: it is time to apply lots and lots of gel. We recommend buying two bottles just in case you happen to run out. Make sure to reapply during break, lunch, passing periods and class itself - remember, you can never have too much gel. The gel will give you a sleek-haired look that’ll take you straight back to the '50s. For girls: Wear poodle skirts (a few that can be borrowed from Paly’s Theatre Department), red lip stick, “pink lady” jackets and your mother’s pearls that you’ve always been looking for an excuse to wear. Don’t forget your leather jacket with boots or Chuck Taylors, which can be bought for $10 at certain thrift stores.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"Another round of Spirit Week for sophomores calls for another round of loving competition; get your outfit inspirations here.\r\n","date":"2014-10-23 14:10:18","author":"Adele Bloch","categories":["Opinion"],"tags":{"30837":"dressing day","30847":"greasers","30835":"outfits","8953":"paly","30848":"paly spirit week","30845":"ranch dressing","9033":"Red","30844":"red card","29301":"sophomore","9114":"Sophomores","9119":"Spirit Week","30834":"Spirit Week outfits","30846":"teenyboppers","9695":"theme day"}},{"id":76924,"title":"Junior Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/junior-spirit-week-outfits\/","content":"<em>\"I believe that, I believe that we, I believe that we will, I believe that we will win!\"<\/em>\r\n\r\n<strong>[Monday] Theme day - Pirates: <\/strong>We hope you practiced on “<a href=\"http:\/\/www.playcrossbones.com\/Pirate_Talk.php#sthash.pf55N41y.dpbs\">International Talk Like a Pirate Day<\/a>\" on Sept. 19 because those skills will come in handy right about now. The pirate theme, at least for us, seems to be a relatively hard day to dress up for. If you put yourself in a situation where you've been at sea for many months and you potentially have scurvy, it's alright to assume that you won’t have the most glamorous outfit. Grab a large, flowy, white t-shirt and cut off the ends of the sleeves and the bottom of the shirt in a jagged manner. Paint blue stripes across the front and back of the shirt. For accessories, you can wear a bandana around your neck, a pirate belt, eye patch, one large hoop earring and a plastic sword. Don’t forget to say “Ahoy, matey” to everyone you pass by on your way to class.\r\n\r\n[caption id=\"attachment_77006\" align=\"alignleft\" width=\"254\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5912.jpg\"><img class=\"wp-image-77006\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5912.jpg\" alt=\"IMG_5912\" width=\"254\" height=\"381\" \/><\/a> Staff writer Claire Krugler poses in a chicken suit for the junior's yellow color day that falls on the third day of Spirit Week. Photo by Adele Bloch.[\/caption]\r\n\r\n<strong>[Tuesday] Dressing day - Thousand Island: <\/strong>Although many of you would like to wear your average swimsuit, try to spice it up with a coconut bra, which is most definitely not restricted to girls. If you want to think outside the box, dress up as a scuba diver with flippers; but make sure that you take the walking backwards approach or we might see a few scratched up faces at the rally. Boys, start working on those abs ASAP (we recommend the local gym). Have no fear of the bright tropical colors and floral patterns that you'll be wearing on this day. For all juniors, grab your dad’s oversized Hawaiian shirt, shorts, hula skirts, coconut bras, leis and flip-flops, and you’re good to go.\r\n\r\n<strong>[Wednesday] Color day - Yellow: <\/strong>If you’re going for the <i>“<\/i>wear whatever I can find that is yellow\" look, we recommend patrolling through your house, finding all yellow items and placing them on your body with yellow tape. See that banana? Ring, ring, bringing the banana phone back. See that highlighter? That's your writing utensil for the day. On the other hand, there are also character-specific outfits such as banana costumes, minion suits and Spongebob outfits. If you combine the “wear whatever I can find that is yellow\" look with the costume specific outfit, you may find yourself in the running for Best Dressed.\r\n\r\n<strong>[Thursday] Generation day - Sophisticates:<\/strong> Dress for success. Ladies and gentleman, this is the day to impress all your fellow peers by looking like a successful and accomplished lady and gentleman that you will soon become. Pick your favorite role model and be them for the day. Ladies tend to either wear dresses, skirts with fancy blouses or pant suits. Each of these items can be paired with flats or heels, but keep in mind that you may want some practice with running in heels if you plan to get a good spot on the bleachers during the rallies. Gentlemen can bring on the tux and ties, with a briefcase in hand. Don’t forget your cup of coffee in the morning and your handy pocket book dictionary and thesaurus, which we hope you read the night before so that you’ll look astute for Sophisticates day.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house, which we'll imagine shouldn't be too hard as this is your third Spirit Week. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"The upcoming third week of Spirit Week calls for another round of outfit planning; get your inspiration here.","date":"2014-10-23 14:10:12","author":"Adele Bloch","categories":["Opinion"],"tags":{"8596":"clothes","9717":"color day","30837":"dressing day","30840":"generation day","8816":"junior","30850":"outfit","8953":"paly","30851":"pirates","30853":"sophisticates","9119":"Spirit Week","30834":"Spirit Week outfits","9695":"theme day","30852":"thousand island","9244":"Yellow"}},{"id":76937,"title":"Senior Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/senior-spirit-week-outfits\/","content":"<em>With your last Spirit Week coming up, you've probably already thought about your various outfits. But for a little bit more inspiration, see below. It's your last year – give it your all.<\/em>\r\n\r\n[caption id=\"attachment_77011\" align=\"alignnone\" width=\"480\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg\"><img class=\"wp-image-77011\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg\" alt=\"IMG_5983\" width=\"480\" height=\"320\" \/><\/a> Staff writers Adele Bloch and Claire Krugler pose for the senior's green color day, which falls on the third day of Spirit Week. Photo by Molly Fogarty.[\/caption]\r\n\r\n<b>[Monday] Theme day - '90s: <\/b>Most seniors tend to take one of two popular routes: either rollerblading around the Quad or carrying a boombox around school. Why not try both? Seniors, it is time to start paying for those rollerblading lessons ASAP. Although we would enjoy seeing a few of you face-plant on the Quad, we will also pity you, so here are our words of advice. And since boomboxes typically weigh around 30 pounds, it’s time to hit the gym. We expect to be seeing at least half of the seniors at our next YMCA visit. Better start on your lifelong dream to become a rollerblader with the most fly tunes.\r\n<p style=\"text-align: left;\"><strong>[Tuesday] Dressing day - Caesar: <\/strong>For toga tips, see <a href=\"http:\/\/www.wikihow.com\/Make-a-Toga-out-of-a-Bedsheet\">here<\/a>. Use extra safety pins for your toga because we really don’t want to see any slips. Ride in eating grapes on your chariot with a little bit of “wine,” aka grape juice. Fight in the colosseum wearing your gladiator sandals, and take a break by playing a soothing harp song.<\/p>\r\n\r\n\r\n[caption id=\"attachment_77015\" align=\"alignnone\" width=\"204\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5990.jpg\"><img class=\"wp-image-77015\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5990.jpg\" alt=\"IMG_5990\" width=\"204\" height=\"306\" \/><\/a> Staff writers Adele Bloch and Claire Krugler pose for senior's green color day and camp day, which respectively fall on the third and last day of Spirit Week. Photo by Molly Fogarty.[\/caption]\r\n<p style=\"text-align: left;\"><b>[Wednesday] Color day - Green:<\/b> Go all out and get your green from Target, Goodwill or Spirit. You've done this before so we expect only the best.<\/p>\r\n<p style=\"text-align: left;\"><b>[Thursday] Generation day - Senior Citizens: <\/b>You’re officially over 70 and you're old enough to get the Happy Meal for less than $5. Congratulations! Grab your cane, wheelchair or scooter and take your time getting to class. Being an old senior citizen is a wonderful excuse to be late. We want to see every senior have at least five pillows attached to their stomach and rear end, and when seniors smile, there better be excess lipstick on their teeth. We don’t want to see any brunettes, blondes or redheads on this day - there'd better be gray hair everywhere. You're most officially the oldest in the school, so don’t forget to yell at those “dirty rotten kids” to “get off my lawn.”<\/p>\r\n<p style=\"text-align: left;\"><strong>[Friday] Camo: <\/strong>You know what to do. Last day, make it count.<\/p>","excerpt":"The upcoming last week of Spirit Week calls for another round of outfit planning; get your inspiration here.","date":"2014-10-23 14:03:51","author":"Adele Bloch","categories":["Opinion"],"tags":{"30854":"90s","30855":"caesar","9796":"camo","9717":"color day","30837":"dressing day","30840":"generation day","8745":"Green","30835":"outfits","8953":"paly","30856":"senior citizens","9090":"seniors","9119":"Spirit Week","30834":"Spirit Week outfits","9695":"theme day"}}]