[{"id":71348,"title":"Review: &#8220;Amazing Spider-Man 2&#8243; catches audiences in its web","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/review-amazing-spider-man-2-catches-audiences-in-its-web\/","content":"[caption id=\"attachment_71373\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg\"><img class=\"wp-image-71373\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg\" alt=\"&quot;The Amazing Spider-Man 2&quot; is fun for all ages. It has exciting fighting scenes, fun characters and a cute love story. Photo by Columbia Pictures.\" width=\"350\" height=\"361\" \/><\/a> \"The Amazing Spider-Man 2\" is fun for all ages. It has exciting fighting scenes, fun characters and a cute love story. Photo by Columbia Pictures.[\/caption]\r\n\r\nBad guys, fighting scenes, a cute superhero and young love are just some of the things that makes \"The Amazing Spider-Man 2\" great for a movie night with friends. It is a fun movie that is definitely worth seeing as it is fun to watch and the ending will take you by surprise with its unexpected twist.\r\n\r\nAs a fan of the Spider Man series, starring Tobey Maguire, I had some concerns when I heard about a new adaptation of the movies in 2012. Tobey Maguire was a great choice for that role, so imagining someone else play Spider Man was sad. However, once I saw \"The Amazing Spider-Man,\" I instantly loved the new Peter Parker (Andrew Garfield) as well as Gwen Stacey (Emma Stone). Garfield was a perfect fit for the role with his initial shyness and later more extroverted personality that emerged as he put on the spider suit. Since I was so happy with the first movie, when I heard about \"The Amazing Spider-Man 2,\" I knew I had to see it.\r\n\r\nIn theaters now, \"The Amazing Spider-Man 2\" portrays Parker's struggle with pursuing his love interest, Stacey, figuring out the back story of his parent's leaving him as a child and, of course, stopping the criminals of New York. Parker and Stacey fell in love in the first movie, but in the new movie, his protectiveness of her leads to a tense relationship. Since Parker is Spider Man, Stacey would be a target for his enemies, and he does not want to be responsible for anything that could happen to her.\r\n\r\nIn the new movie, Spider Man is soaring through New York City, trying to catch yet another criminal when he saves the life of Max Dillon (Jamie Foxx) by pulling him out of the way of a moving vehicle. Dillon is very excited that someone notices him, later becoming obsessed with Spider Man. When Dillon is trying to fix a leak for his company, Oscorp, he falls into a tub of electric eels, transforming him into Electro, a man who gains the ability to control electricity. As Electro tries to become accustomed to his new powers, he develops a dislike for Spider Man, who he thinks is trying to hurt him.\r\n\r\nAnother enemy of Spider Man arises from Harry Osborn (Dane DeHaan). Osborn and Parker were friends when they were younger, but Osborn was sent to boarding school before Parker became Spider Man. When Osborn comes back to take over his father's multibillion-dollar company, Oscorp after his death, they rekindle their friendship. Upon realizing that he has a deadly genetic disease, Osborn decides he must figure out how to survive. When Spider Man refuses to help Osborn live, Osborn becomes angry with him and decides to take revenge. Through dangerously inserting spider venom into his blood, Osborn is able to live as he becomes the Green Goblin and tries to destroy Spider Man.\r\n\r\nWhile the plot is entertaining, Osborn's part seems unimportant toward the story. It is interesting that the writers brought in a friend from Parker's past, but once Osborn becomes evil, his role just seems like an unnecessary twist to the plot. The Green Goblin (Willem Dafoe) from the original Maguire series, had a better back story that set him up for the plot. Osborn's transformation into an evil villain seems thrown together with not much thought behind it.\r\n\r\nThe cinematography, by Daniel Mindel, is one of the most enjoyable parts of the movie. In the beginning of the film, Spider Man is going around over the city, flying back and forth. The way it was filmed makes it feel like the audience is flying through the city with him. Not only is it fun to watch, but it also lets the audience be a part of the action.\r\n\r\nDespite the problem I had with Osborn's character, I thoroughly enjoyed it and would suggest that people see \"The Amazing Spider-Man 2\". The great battle scenes and Spider Man flying around keep audiences stuck to their seats, while the adorable love story between Stacey and Parker pull at the audience's hearts, especially at the end.\r\n<p dir=\"ltr\"><b>The Amazing Spider-Man 2\r\n<\/b><\/p>\r\n<p dir=\"ltr\"><strong>2 hours 22 minutes<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Rated PG-13 for sequences of sci-fi action\/violence<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Directed by Marc Webb<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>With Andrew Garfield, Emma Stone, Jamie Foxx<\/strong><\/p>","excerpt":"Bad guys, fighting scenes, a cute superhero and young love are just some of the things that makes \"The Amazing Spider-Man 2\" great for a movie night with friends. It is a fun movie that is definitely worth seeing as it is fun to watch and the ending will take you by surprise with its unexpected twist.","date":"2014-05-15 13:45:12","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg","categories":["Reviews"],"tags":{"17513":"amazing spider-man 2","17515":"andrew garfield","11885":"emma stone","17797":"jamie foxx","17517":"sally fields","17514":"spider-man","17798":"spiderman"}},{"id":71977,"title":"Girls&#8217; lacrosse to play Saratoga in finals","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/girls-lacrosse-to-play-saratoga-in-finals\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_72021\" align=\"aligncenter\" width=\"512\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg\"><img class=\"wp-image-72021\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg\" alt=\"The Palo Alto girls' lacrosse team huddles after their win against St. Francis. Photo by Molly Fogarty.\" width=\"512\" height=\"384\" \/><\/a> The Palo Alto girls' lacrosse team huddles after their win against St. Francis. Photo by Molly Fogarty.[\/caption]\r\n\r\nThe Palo Alto High School girls' lacrosse team (14-4) will take on Saratoga High School (14-5-1) in the Santa Clara Valley Athletic League final at 10 a.m. Saturday at Paly.\r\n\r\nThe Vikings are coming off a dramatic 10-9 win against the St. Francis Lancers (12-6) on Wednesday at St. Francis.\r\n\r\nThe Vikings have beat Saratoga twice in the regular season. The Falcons defeated Gunn High School (15-3) by a score of 9-8 in the semifinals on Wednesday to advance to the finals.\r\n\r\nJunior midfielder Paige Bara says she is proud of how the team's season has turned out.\r\n\r\n\"We are so incredibly excited to be going to the championships,\" Bara said. \"In the past we have struggled with beating Saint Francis in the playoffs so it feels pretty great to have finally accomplished that. I think we've really proven ourselves as a program and a team. Going into the season everyone thought we were the underdogs because we lost so many amazing seniors. But the fact that we've made it this far just proves how great of a team we have.\"\r\n\r\nComing into the playoffs, the Vikings were seeded third, even though they had more wins than St. Francis, the No. 2 seed. Saratoga, seeded fourth, beat the No. 1 seed Gunn, which was a big upset as Gunn had beaten Saratoga twice in the regular season.\r\n\r\nThe Vikings are going to the finals for the second year in a row, but last year they lost to St. Francis in triple overtime.\r\n\r\n\"I think we're all just so proud to have made it this far and Saturday is just going to be a test of how badly we really want it,\" Bara said. \"We know Saratoga is going to come out really hard and we have to really keep our focus if we want to become the SCVAL champions.\"\r\n\r\nThe Vikings will face Saratoga at 10 a.m. on Saturday at the El Camino Field.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' varsity lacrosse team (14-4) is preparing to take on Saratoga High School (14-5-1) in the Santa Clara Valley Athletic League final, which takes place at 10 a.m. Saturday at Paly.","date":"2014-05-15 13:41:45","author":"Callie Walker","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg","categories":["Sports"],"tags":{"8736":"girls' lacrosse","8751":"gunn","8836":"Lacrosse","18836":"palo alto high school lacrosse","9063":"saratoga","18834":"scvals","18835":"semifinals","10253":"st. francis"}},{"id":71987,"title":"Boys and Girls Club to host Battle of the Bands","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/boys-and-girls-club-to-host-battle-of-the-bands\/","content":"[caption id=\"attachment_71989\" align=\"alignnone\" width=\"616\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png\"><img class=\"size-full wp-image-71989\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png\" alt=\"The Boys and Girls Clubs of the Peninsula are hosting their event on May 18 in the Fox Theatre. Flyer courtesy of Kathleen Xue.\" width=\"616\" height=\"389\" \/><\/a> The Boys and Girls Clubs of the Peninsula are hosting an event on May 18 in the Fox Theatre. Flyer courtesy of Kathleen Xue.[\/caption]\r\n\r\nThe Battle of the Bands event is being held to fundraise for the club’s art, music and enrichment programs.\r\n\r\nThe event will feature four bands from different high schools around the Bay Area, including PALP and Remi and Chloe from Palo Alto High School.\r\n\r\n“We are really excited about the event,” said Remi Wolfe, of Remi and Chloe. “It is going to be awesome to listen to and compete against the other bands.”\r\n\r\nIn addition to the high school bands, Ryan McDermott, a Paly grad and professional musician signed to G.O.O.D. Music, will be performing at the end of the night.\r\n\r\nThe event is organized by the Boys and Girls Club High School champions, a group of high school volunteers from around the peninsula.\r\n\r\nAlex Matthys, a junior at Gunn High School and volunteer drums instructor at the Boys and Girls Club of Redwood city, said he wants to help the kids have more opportunities to learn how to play music.\r\n\r\n“I've been working to expand the amount of access BGCP kids have to musical instruments, so I decided to fundraise for music with music,” Matthys said.\r\n\r\nTickets can be bought in advance on the Fox Theatre’s <a href=\"http:\/\/foxrwc.showare.com\/eventperformances.asp?evt=17\">website<\/a> for $20 or at the door for $25. For more information, please visit the Fox Theatre’s website or the event’s <a href=\"https:\/\/www.facebook.com\/events\/239421926249471\/?notif_t=plan_user_invited\">Facebook page<\/a>.","excerpt":"The Boys and Girls Clubs of the Peninsula will hold its Battle of the Bands event at 6 p.m. on Sunday, May 18 in the Fox Theater in Redwood City.","date":"2014-05-15 13:39:20","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png","categories":["News"],"tags":[]},{"id":71984,"title":"Paly girls&#8217; lacrosse ousts Saint Francis in semi-finals","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/paly-girls-lacrosse-ousts-saint-francis-in-semi-finals\/","content":"[caption id=\"attachment_71990\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\"><img class=\"size-full wp-image-71990\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\" alt=\"The Palo Alto High School girls' lacrosse team poses for a post-victory picture. The Vikings triumphed over the Lancers, 10-9, and will face Saratoga in the finals on Saturday. Photo by Molly Fogarty.\" width=\"600\" height=\"450\" \/><\/a> The Palo Alto High School girls' lacrosse team poses for a post-victory picture. The Vikings triumphed over the Lancers, 10-9, and will face Saratoga in the finals on Saturday. Photo by Molly Fogarty.[\/caption]\r\n\r\nAfter a slow start, the Palo Alto High School girls’ lacrosse team (14-4) finished strong for a 10-9 victory at Saint Francis (12-7) to advance to the Santa Clara Valley Athletic League championship.\r\n\r\n“At first we were a little slow,” senior midfielder Kristen DeStefano said.  “We had to get things together, probably because of the heat.”\r\n\r\nHowever, after falling behind at halftime, Paly took over in the second half.\r\n\r\n“That second half was the best we have ever played,” DeStefano said.  “We really came together and we had so much momentum.”\r\n\r\nCoach Jamie Nesbitt appreciates her team’s ability to stay with it to the end.\r\n\r\n“We played really hard, and we didn’t let the amount of time we spent on defense dictate the pace of the game,” Nesbitt said.  “We kept up the energy through the end.”\r\n\r\nDeStefano believes the ability to win draws played a role in the Vikings’ late success.\r\n\r\n“When we had the momentum, we had several 10 second draws in a row that just kept us going,” DeStefano said.  “Next game, we want to do that right from the beginning.”\r\n\r\nSophomore midfielder Maya Benatar thinks the team underperformed.\r\n\r\n“We have played better,” Benatar said. “I think we are the better team and we didn’t completely show it today. We brought it when we needed to bring it and we took advantage when the momentum switched and that was enough to win.”\r\n\r\nNesbitt thinks the team will perform well on Saturday, when Paly takes on Saratoga in the SCVAL Championship.\r\n\r\n“I think there was a lot of emotion associated with this game,” Nesbitt said.  “Now we are in this confident space where we know we can take care of it [the game against Saratoga].  We have the advantage going into this next game of having depth on our bench, and the ability to move people around into different positions.”\r\n\r\nBenatar also expressed her confidence going into the championship.\r\n\r\n“We will bring what we really have to the finals on Saturday and it will be a more controlled win,” Benatar said.\r\n\r\nThe Vikings will take on Saratoga at 10 a.m. on Saturday at the Paly lacrosse field.","excerpt":"After a slow start, the Palo Alto High School girls’ lacrosse team (14-4) finished strong for a 10-9 victory at Saint Francis (12-7) to advance <a href=\"http:\/\/palyvoice.com\/2014\/05\/15\/paly-girls-lacrosse-ousts-saint-francis-in-semi-finals\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-15 13:38:31","author":"Jared Schwartz","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg","categories":["Sports Recap","Spotlight"],"tags":{"8736":"girls' lacrosse","8836":"Lacrosse","12016":"lax","10981":"win"}},{"id":71998,"title":"Voice Verbatim: Seniors&#8217; advice to Paly","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/voice-verbatim-seniors-advice-to-paly-2\/","content":"<div id=\"watch-description-text\">\r\n<p id=\"eow-description\">With graduation a mere 15 days away, The Paly Voice asked students of the Senior class of 2014 for any advice they could impart upon the Palo Alto High School community.<\/p>\r\n<iframe src=\"\/\/www.youtube.com\/embed\/WJB_J6pRJc0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n","excerpt":"With graduation a mere 15 days away, The Paly Voice asked students of the Senior class of 2014 for any advice they could impart upon the Palo Alto High School community.","date":"2014-05-15 13:29:13","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-13-at-10.30.31-PM.png","categories":["Multimedia","Spotlight","Video"],"tags":[]},{"id":71980,"title":"Voice Verbatim: What are your summer plans?","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/voice-verbatim-what-are-your-summer-plans\/","content":"<iframe src=\"\/\/www.youtube.com\/embed\/e_ZztnMS9ok\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asks: \"What are you doing over the summer?\"","date":"2014-05-15 13:12:26","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.06.49-PM.png","categories":["Spotlight","Verbatims"],"tags":{"9137":"summer","18408":"summer plans","9201":"verbatim"}},{"id":71907,"title":"Speaker forum to honor retiring teacher Mike McNulty","permalink":"http:\/\/palyvoice.com\/2014\/05\/14\/speaker-forum-to-honor-retiring-teacher-mike-mcnulty\/","content":"In honor of teacher Mike McNulty's retirement, Palo Alto High School will host its first annual Sports in American Life speakers forum from 1:50 p.m. to 2:30 p.m. tomorrow in the new Media Arts Center.\r\n\r\n[caption id=\"attachment_71910\" align=\"alignright\" width=\"275\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0679-2-copy.jpg\"><img class=\"wp-image-71910\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0679-2-copy.jpg\" alt=\"mike mcnulty (mac)\" width=\"275\" height=\"430\" \/><\/a> Palo Alto High School teacher Mike McNulty leads a tour of the new Media Arts Center. McNulty, who founded the Sports Literature elective class and is the adviser of both broadcast journalism class INfocus and sports magazine The Viking, will retire at the end of this school year after a 22 year-long career at Paly. A Sports in American Life speaker forum will be held in honor of his retirement. Photo by Lizzie Chun.[\/caption]\r\n\r\nDave Flemming, an announcer for the San Francisco Giants and ESPN Radio, will be the forum's keynote speaker. According to librarian Rachel Kellerman, forum participants will also include Class of 2011 alumnus Wes Rapaport, who is pursuing a degree in broadcast journalism from Chapman University; junior Olivia Musil, athlete and McNulty's teacher practicum student; and senior student-athlete Keller Chryst, who is committed to play at Stanford University as a quarterback this fall.\r\n\r\nAfter 22 years of teaching, McNulty plans on retiring at the end of the 2013-14 school year. McNulty founded the Sports Literature English elective in 2000 and is currently the adviser of both Paly's sports magazine The Viking and daily broadcast journalism class INfocus.\r\n\r\nKellerman, along with teachers from the English Department, came up with the idea to host a Sports in American Life speaker forum dedicated to McNulty.\r\n\r\n\"We wanted to do something to honor him [McNulty] in an intellectual, academic way since he started the Sports Literature class and it has been so popular at Paly,\" Kellerman said. \"He's also been involved in the sporting community. ... I was thinking that an interesting way to acknowledge Mr. McNulty, not just this year but [also] in years forward, would be to start a lecture talk about sports.\"\r\n\r\nSign-ups for the speaker forum can be found <a href=\"https:\/\/docs.google.com\/forms\/d\/1tua-9k6U7A0mu312m-eHKEfSXXIvFj-gkjio4DKwT8w\/viewform?edit_requested=true\" target=\"_blank\">here<\/a>.\r\n\r\nAccording to Kellerman, the purpose of the forum is to highlight the function of sports in society.\r\n\r\n\"One of the questions the speaker series will really try to answer is, 'Why do we talk about sports?'\" Kellerman said. \"It [the forum] has nothing to do with sports themselves, but with society and the role sports play in society.\"\r\n\r\nAs a farewell gift, McNulty said he will be donating a collection of roughly 600 to 700 books to the library. He began collecting when creating the Sports Literature class so that \"students would have access to outside reading material.\"\r\n\r\nAccording to McNulty, his only definite plans for retirement are to travel and to remodel his home. However, he hopes to still be involved in the Paly community after retiring.\r\n\r\n\"I will still be the P.A. announcer for the football games in the fall, and I may have something to do with the Sports Pathway class [and] curriculum,\" McNulty said. \"I can't work for the [Palo Alto Unified School] District for the first 180 days following retirement. ... I may do some subbing as well. I'm also going to sleep a bit more.\"\r\n\r\nJunior Rowan McEvoy, an Editor in Chief of The Viking, appreciates McNulty's role as a teacher and adviser to The Viking.\r\n\r\n<span style=\"color: #000000;\">\"Everyone is bummed out that Mac [McNulty] is retiring I think, especially the ones who have had him as a teacher,\" McEvoy said. \"He has done an amazing job as an adviser to The Viking, especially this past year. He usually just lets the students run the show, but also adds in commentary when necessary. Even though he was only our adviser for one year, we will definitely miss him. Personally, I like him because he always says 'hi' to everyone and makes them feel like a special part of his classes.\"<\/span>\r\n\r\nJunior Katie Gonzalez noted that McNulty's presence on campus will be missed.\r\n\r\n\"I was really sad when I finally heard that this was going to be Mac's last year of teaching at Paly,\" Gonzalez said. \"I had him for sophomore English and this semester for Sports Lit, and it's going to be weird not having him next year as a teacher or even seeing him on campus.\"\r\n\r\nAccording to Kellerman, the format of the speaker forum may change in the upcoming years.\r\n\r\n\"He [McNulty] told me he always envisioned having a panel discussion,\" Kellerman said. \"So I think next year, we'll try and do something having more of a panel discussion and have it be during Tutorial.\"","excerpt":"In honor of teacher Mike McNulty's retirement, Palo Alto High School will host its first annual Sports in American Life speakers forum from 1:50 p.m. to 2:30 p.m. tomorrow in the new Media Arts Center.","date":"2014-05-14 23:27:01","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0679.jpg","categories":["News"],"tags":{"18369":"dave flemming","18368":"forum","9427":"infocus","18380":"katie gonzalez","8827":"keller chryst","18387":"livi musil","18366":"mac","18365":"mike mcnulty","18370":"retirement","18371":"retiring","18379":"rowan mcevoy","9115":"speaker","18367":"sports in american life","18381":"sports literature","9792":"viking","14173":"wes rapaport"}},{"id":71861,"title":"Slideshow: Softball trounces Fremont on Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/05\/14\/slideshow-softball-trounces-fremont-on-senior-night\/","content":"The Palo Alto Girls’ softball team (14-12, 4-7) defeated Fremont High School (3-22, 2-11) 8-3 after school Tuesday at home. The Lady Vikings celebrated Senior Night before the game started, which involved introducing the graduating seniors and their parents and bequeathing them with flowers and candy. The graduating seniors are Hannah Bundy, Tori DeStefano, Shannon Fee, Kate Marinkovich, Emma Noroian and Julia Saul. This was the last home game of the season for the Lady Vikes, who will next hit the road to take on Gunn High School this Thursday.\r\n\r\nPhotos by Becca Raffel and Callie Walker.\r\n\r\n[slideshow post_id=71861]","excerpt":"The Palo Alto Girls’ softball team (14-12, 4-7) defeated Fremont High School (3-22, 2-11) 8-3 after school Tuesday at home.","date":"2014-05-14 20:32:45","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_pitching.jpg","categories":["Slideshow","Sports"],"tags":{"18375":"emma noroian","18378":"fremont","18374":"hannah bundy","18373":"julia saul","8822":"kate marinkovich","9087":"Senior Night","18376":"shannon fee","18372":"softball","18377":"tori destefano"}},{"id":71898,"title":"Pitchers fail to hold early lead, Vikings fall to Saratoga","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/pitchers-fail-to-hold-early-lead-vikings-fall-to-saratoga\/","content":"The Palo Alto High School baseball team (15-13, 9-5) failed to hold a three-run lead and consequently fell to the Saratoga Falcons (20-8, 8-6) at home Tuesday by a final score of 8-4 in the first game of a three-game league championship series.\r\n\r\nThe Vikings rode a solid start from senior Danny Erlich to a 3-0 lead going into the fourth inning. Erlich recorded an out on a ground ball and  then walked a batter before being replaced by junior Isaac Kasevich, who gave up six runs in 1.2 innings of relief work.\r\n\r\n“We were being pretty cautious [with Erlich] just because he’s coming off of an injury, and we didn’t want to push it too much,” head coach Erik Raich said.\r\n\r\nSaratoga pitcher Tyler Plesse went the distance, pitching the whole game while allowing only three runs.\r\n\r\nThe biggest blow for the Vikings came in the fourth inning when Saratoga had runners on second and third, and Kasevich gave up a two-run single.\r\n\r\n“They did a pretty good job offensively,” Raich said. “They hit well against us.”\r\n\r\nThe Vikings failed to capitalize with runners on base in the following innings, but Saratoga’s defense played an error-free game including a stellar double play in the fifth inning.\r\n\r\nSenior Jack Cleasby finished the game 2-4 with two runs batted in on two singles.\r\n\r\nSophomore reliever Justin Hull closed out the game, throwing two innings and giving up two runs.\r\n\r\nAccording to Raich, Paly performed well but just came up short.\r\n\r\n“[Our players] did everything we could have asked of them,” Raich said. “We just got beat.”\r\n\r\nThe Vikings will look to avenge their loss when they travel to face Saratoga at 4 p.m. Thursday.  If the Vikings win, they will force a 4 p.m. game at home Friday.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School baseball team (15-13, 9-5) failed to hold a three-run lead and consequently fell to the Saratoga Falcons (20-8, 8-6) at home Tuesday by a final score of 8-4.","date":"2014-05-13 22:51:50","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0892.jpg","categories":["Baseball","Sports"],"tags":{"8410":"Baseball","8537":"Boys","8574":"Championships","18383":"injury","11716":"kasevich","18385":"lead","9884":"league","18382":"loss","18386":"lost","18384":"pless","9063":"saratoga"}},{"id":71725,"title":"Girls&#8217; lacrosse to square off against rival St. Francis in second round of playoffs","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/girls-lacrosse-to-square-off-against-rival-st-francis-in-second-round-of-playoffs\/","content":"The Palo Alto High School girls’ lacrosse team (13-4, 12-1) is set to take on St. Francis High School (12-6, 10-2) in the second round of the Santa Clara Valley Athletic League playoffs at 7:30 p.m. Wednesday at St. Francis High School.\r\n\r\nThe Vikings are coming off a first round victory against Leland High School (19-4), while the Lancers are coming off of a first round bye. Paly bested St. Francis in the two teams' previous meeting in a thrilling 14-11 comeback victory at Paly. The team is excited for another chance to top St. Francis, according to senior midfielder Kristin DeStefano.\r\n\r\n\"We are very excited even though we already beat them once,\" DeStefano said.\r\n\r\nThe Vikings embrace taking on tough competition like the Lancers in their rigorous league schedule.\r\n\r\n\"We are third in our league because of all of the different sections,\" DeStefano said. \"We have to play harder competition from week to week so it gives us motivation to win the tough games.\"\r\n\r\nDestefano says that while the team knows what it did well last game, a new game brings a new challenge.\r\n\r\n\"Going into this game we need to take control of the draws and completely block everyone off the circle,\" Detefano said. \"Last game, our transition was very good and our spacing and ball handling were amazing.\"\r\n\r\nThe game will start at 7:30 p.m. on Wednesday at the St. Francis football field.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ lacrosse team (13-4, 12-1) is set to take on St. Francis High School (12-6, 10-2) in the second round of the Santa Clara Valley Athletic League playoffs at 7:30 p.m. Wednesday at St. Francis High School.","date":"2014-05-13 17:43:06","author":"Malcolm Davis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/216.jpg","categories":["Sports"],"tags":{"8736":"girls' lacrosse","17811":"kristen destefano","8836":"Lacrosse","10253":"st. francis"}}]