[{"id":75113,"title":"ASB announces Homecoming details","permalink":"http:\/\/palyvoice.com\/2014\/09\/30\/asb-announces-homecoming-details\/","content":"[caption id=\"attachment_75189\" align=\"alignnone\" width=\"573\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0006.jpg\"><img class=\" wp-image-75189\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0006.jpg\" alt=\"Sophomore Social Commissioner Cezanne Lane describes the formal Homecoming for this year. Lane and senior Social Commissioner Alex Pelayo have been planning the dance since the beginning of the school year, recruiting DJ something for music and Jenny's Churros for food.\" width=\"573\" height=\"383\" \/><\/a> Sophomore Social Commissioner Cezanne Lane describes this year's formal Homecoming. Lane and senior Social Commissioner Alex Pelayo have been planning the dance since the beginning of the school year, hiring DJ Tasi for music and Jenny's Churros for food. Photo by Adele Bloch.[\/caption]\r\n\r\nThe Associated Student Body announced the “Black and White Ball” as the theme for Palo Alto High School’s formal Homecoming Dance, which will take place on Saturday, Nov. 1, in the Small Gym.\r\n\r\n<a href=\"http:\/\/www.djtasi.com\/\">DJ Tasi<\/a> will provide the music and <a href=\"http:\/\/www.jennyschurros.com\/\">Jenny’s Churros<\/a> will cater the food. Unlike last year’s Homecoming, which had a closed photo booth, there will be an open photo booth with props and a screen, according to sophomore Social Commissioner Cezanne Lane.\r\n\r\n“I’m really excited about him [DJ Tasi],\" Lane said. \"I’ve heard really good things about his work.”\r\n\r\nAccording to Lane, ASB is holding an asking competition in which the top two winners with the best Homecoming asking video will receive a $40 gift card and $20 gift card, respectively, to the Stanford Mall. To win, the video must be posted in the “<a href=\"https:\/\/www.facebook.com\/events\/1601730060054694\/\">PALY Homecoming Dance 2014 and Asking Competition<\/a>” group or emailed to Student Activities Director Matt Hall (<a href=\"mailto:mhall@pausd.org\">mhall@pausd.org<\/a>) by 11:59 p.m. on Oct. 27. A poll will proceed to hold the videos with the most likes, which students can vote on from Oct. 28 to Oct. 30 at 11:59 p.m, according to the official Facebook event.\r\n\r\n“I think it’s exciting and super interactive, so we’re doing that again this year,\" Lane said. “Last year the asking competition got everyone super pumped about it [Homecoming].\"\r\n\r\nStudents are told to wear black, white, silver or gold, but the theme is really up for interpretation, according to Lane.\r\n\r\n“It [the theme] is classy, but it’s a little bit different,\" Lane said. \"We thought this was … fun, but still easy to adapt to.”\r\n\r\nTickets are $12 without an ASB card and $8 with one. They will be sold at the door, online at <a href=\"https:\/\/palywebstore.myschoolcentral.com\/asbworks\/(S(pxf5doyi5ve5qu45kk4k1eul))\/Webstore.aspx?org=6028\">Paly’s Web Store<\/a>, on the Quad and at the Homecoming football game. Homecoming will be held from 7:30 p.m. to 10:30 p.m. on Saturday, Nov. 1, in the Small Gym. For more information, click <a href=\"https:\/\/www.facebook.com\/events\/1601730060054694\/\">here<\/a>.","excerpt":"The Associated Student Body announces the “Black and White Ball” as the theme for Palo Alto High School’s formal Homecoming Dance, which will take place from 7:30 p.m. to 10:30 p.m. on Saturday, Nov. 1 in the Small Gym.\r\n","date":"2014-09-30 17:11:12","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-29-at-7.19.55-PM.png","categories":["News","Uncategorized"],"tags":{"8496":"ASB","29483":"Asking competition","8499":"Associated Student Body","29480":"black and white ball","29481":"Cezanne lane","8626":"dance","9781":"homecoming","29482":"Homecoming ask","8944":"palo alto high school","8953":"paly","9764":"spirit"}},{"id":74760,"title":"Robotics looks ahead to new tournament, members","permalink":"http:\/\/palyvoice.com\/2014\/09\/30\/robotics-looks-ahead-to-new-tournament-members\/","content":"Palo Alto High School’s robotics team will look to improve on its previous performances as it prepares for the second tournament of the school year this weekend.\r\n\r\nThe upcoming CalGames tournament will be at Woodside High School this Friday and Saturday.  Junior Build Captain Claire Kokontis, in charge of designing the physical components of the robot, said that the format of the tournament will follow that of the last tournament.\r\n\r\n“The [goal of the] competition is to shoot this big yoga ball into a goal that’s six or seven feet high,\" Kokontis said. \"You’re paired up with two or three other robotics teams that form an alliance.  Alliances will compete against each other, and you can get points not only for scoring goals but also passing to other robots.  [After] the main matches, if you’re in a high enough ranking, you go onto elimination matches and you can win the whole competition.”\r\n\r\nAccording to Kokontis, the team did not have a lot of success at the previous tournament, Chezy Champs at Bellarmine College Prepatory. The team finished last, which drove it to change a lot of aspects of its robot.\r\n\r\n\"We're hoping to make our shooter wheels more accurate,\" Kokontis said.  \"In past competitions, it's been kind of spotty, but ... we have two weeks to refine it and to refine some other functions in our robot to make it as smooth as possible.\"\r\n\r\n[caption id=\"attachment_74764\" align=\"alignright\" width=\"431\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/robotics.jpeg\"><img class=\"wp-image-74764\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/robotics.jpeg\" alt=\"robotics\" width=\"431\" height=\"323\" \/><\/a> Junior Build Captain Claire Kokontis (center) makes adjustments to the robotics team's robot. The team will look to improve on its previous performance as it prepares for the CalGames tournament this weekend. Photo by Wesley Woo.[\/caption]\r\n\r\nProgramming Captain sophomore James Ngo added that some of the programming components of the robot required alterations as well.\r\n\r\n\"Basically, we made it easier for the robot to be controlled for the operator and the driver,\" Ngo said. \"We also implemented a new autonomous [code] and we tried to do some speed [adjustments], but that didn't work out too well.  Autonomous is a period of time where no human can control the robot, so we have to pre-program the robot to do everything.\"\r\n\r\nIn addition to the tournament, the team is also looking forward to the arrival of new members following the application process. Because robotics is a year-long extracurricular, some tournaments early in the school year, like the upcoming one, occur without any added new members.\r\n\r\n“Every year we give out applications just for some contact information and reaching out to people and asking them why they’re interested in joining the team,” Kokontis said.\r\n\r\nSophomore Kenny Cheng, the team's official offseason competition manager, reiterated that applicants are not required to have any previous experience with robotics.\r\n\r\n\"We want people who are dedicated,\" Cheng said.  \"We don't care if they don't know anything [about robotics]: as long as they show up every time, they'll learn stuff and they'll become a part of the team.\"\r\n\r\nThe deadline for turning in applications for the team this year is Oct. 2.  Applicants can turn in their information to the Robotics Lab or CL-2.\r\n\r\nThe CalGames will be from 3:15 p.m. to 8:45 p.m. on Friday and 7 a.m. to 7:30 p.m. on Saturday.","excerpt":"Palo Alto High School’s robotics team will look to improve on its previous performances as it prepares for the second tournament of the school year this weekend.","date":"2014-09-30 13:57:53","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/robotics.jpeg","categories":["News","Spotlight"],"tags":{"29487":"CalGames","29488":"new members","29484":"palo alto high school robotics","29485":"paly robotics","29486":"paly robotics team","9049":"robotics","29489":"robotics applications","25084":"robotics team","9175":"tournament"}},{"id":75102,"title":"APPetite blog: Duolingo","permalink":"http:\/\/palyvoice.com\/2014\/09\/30\/appetite-blog-duolingo\/","content":"<em>Here is the first installment of APPetite featuring Duolingo. Read our blog to discover great games and other apps available in Apple’s App Store. We will cover apps ranging from retrofitted classic games to useful productivity apps. Check in each week to fulfill your hunger for a new addictive app fix!<\/em>\r\n\r\n<strong>Duolingo<\/strong>\r\n<strong>Price: FREE<\/strong>\r\n<strong>Available: App Store, Google Play, Online<\/strong>\r\n<strong>Rank: 4.5\/5<\/strong>\r\n<strong>Why you should download: <del><\/del>Duolingo is a convenient and fun app for anyone wanting to learn or strengthen their language skills.\r\n<\/strong>\r\n\r\nMouse over the stars on the infographic below to learn more about Duolingo.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/573300148080214018\" width=\"577\" height=\"520\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nDuolingo is a mobile application and website for learning languages through mini-lessons, each with various activities. I originally downloaded to see how much Spanish I remembered since I'm not taking the class this year. Foreign language has never been my forté, but Duolingo made it surprisingly fun. The cute green owl that guides you through all the lessons is an extra bonus.\r\n\r\nThe test-out option is also nice because it allowed me to skip the beginning lessons that I already knew. However, as I progressed through the levels, I found myself getting so absorbed in the game aspect of Duolingo that I ended up using Google Translate so I could test out of as many sections as possible. Not quite the point of the app, but you get the idea.\r\n\r\nMy only complaint is that Duolingo does not teach grammar rules. It will teach you specific verbs, but it doesn't show you a general conjugation chart. Duolingo definitely seems most effective if you use it in conjunction with a class or for a language you have a little background in.\r\n\r\nOverall, Duolingo is great. And, even better, it's free! <span id=\"result_box\" class=\"short_text\" lang=\"es\"><span class=\"hps\">Tener una diversión<\/span>.<\/span> <span id=\"result_box\" class=\"short_text\" lang=\"fr\"><\/span> Profitez-en. Lernen Sie alle sechs Sprachen.\r\n\r\nI guess you will have to try Duolingo (or Google Translate) to find out what I said.\r\n\r\nHint: Spanish, French, German.\r\n\r\n&nbsp;","excerpt":"Here is the first installment of APPetite featuring Duolingo. Read our blog to discover great games and other apps available in Apple’s App Store. We will cover apps ranging from retrofitted classic games to useful productivity apps. Check in each week to fulfill your hunger for a new addictive app fix!","date":"2014-09-30 13:52:05","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/11.jpg","categories":["APPetite","Entertainment"],"tags":{"29479":"App Store","29416":"APPetite","15394":"apps","29478":"blog","29477":"duolingo"}},{"id":72591,"title":"New furniture compensates for postponement of library remodel","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/new-furniture-compensates-for-postponement-of-library-remodel\/","content":"[caption id=\"attachment_75048\" align=\"aligncenter\" width=\"525\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg\"><img class=\" wp-image-75048\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg\" alt=\"Paly students Olivia Musil, Pasha Kamarei, Lydia Barry and Hans Usman use the café-style high tables in the library. Photo by George Lu. \" width=\"525\" height=\"437\" \/><\/a> Paly students Olivia Musil, Pasha Kamarei, Lydia Barry and Hans Usman use the café-style high tables in the library. Photo by George Lu.[\/caption]\r\n\r\nAfter delaying the remodeling of the Palo Alto High School Library, the Paly administration is encouraging students to use the new furniture put in place as compensation.\r\n\r\nThe new furniture includes brand new chairs and tables, which replace the old furniture that had been around for 43 years.\r\n\r\n“I really wanted to push for new furniture for the library,” Paly librarian Rachel Kellerman said. “I thought that we would be able to have this facility remodeled starting now, so we were going to wait for new furniture until the remodeling. But when the job was put off for the next two to three years, I asked Principal Kim Diorio if we could find a donor, and she did.”\r\n\r\nPaly administration members, including Diorio, became aware of issues with the old furniture after using it themselves last year.\r\n\r\n“There were a number of teachers who became students for a day,” Kellerman said. “Diorio said she sat for an hour in our comfortable chairs pretending to be a student and she realized it was just a really tough place to be. The furniture didn’t work, so she understood the need before any other administrator.”\r\n\r\nStudents have mostly enjoyed the new look and feel of the library.\r\n\r\n“I really like some of the new seats,” senior Ken Shin said. “They’re very comfortable, and they’re much nicer than what we had last year.”\r\n\r\nPaly chose the furniture through a selection process in order to create an ideal library environment for students, according to Kellerman.\r\n\r\n“We talked to Shelly Young from Workplace Connections who [designed] the Media Arts Center furniture,” Kellerman said. “I also talked to another company that specializes in library furniture called Demco. We got samples in from both vendors, and kids sat in the chairs and did polls. ... We ended up going with Shelly Young’s design because we were able to get [more of a] variety of colors, and the tables were more flexible.”\r\n\r\nThe library features some new types of furnitures, including café high tables, designed to encourage collaboration, as well as single desks with dividers.\r\n\r\n\"I like the dividers,\" junior Ophir Sneh said. \"The library can be pretty distracting sometimes, so they help keep me focused.\"\r\n\r\nAnother benefit of the new furniture  is its compatibility.\r\n\r\n“All the furniture in the Media Arts Center is the same, so it’s all interchangeable.” Kellerman said.","excerpt":"After delaying the remodeling of the Palo Alto High School Library, Paly administration is encouraging students to use the new furniture put in place as compensation.","date":"2014-09-29 17:23:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg","categories":["News"],"tags":{"21437":"bond","8616":"construction","21438":"delay","11130":"furniture","21439":"Kellerman","8848":"Library","8912":"new"}},{"id":74066,"title":"Local nonprofit invites community to &#8220;step out of your world&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/local-nonprofit-invites-community-to-step-out-of-your-world\/","content":"The Global Lives Project, a San Francisco-based nonprofit organization, will exhibit an interactive video display focused on broadening cross-cultural understanding and empathy during the week-long grand opening of the Palo Alto High School Media Arts Center starting Oct. 13.\r\n\r\n[caption id=\"attachment_74683\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg\"><img class=\"wp-image-74683\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg\" alt=\"David Harris, Executive Director of Global Lives, explains the purpose of the Global Lives Project to Palo Alto High School staff at a faculty meeting. Starting Oct. 13, Global Lives will display a video exhibit in the Media Arts Center. The organization's motto is &quot;step out of your world.&quot;\" width=\"400\" height=\"247\" \/><\/a> David Harris, executive director of Global Lives, explains the purpose of the Global Lives Project to Palo Alto High School staff at a faculty meeting. Starting Oct. 13, Global Lives will display a video exhibit in the Media Arts Center. The organization's motto is \"Step out of your world.\"[\/caption]\r\n\r\nThe video exhibit features raw footage from the lives of 20 participants of different ethnicities, ages, education levels and socio-economic backgrounds from around the world. The installation will be displayed in the MAC nonstop throughout the five days of the building's grand opening.\r\n\r\nAccording to the <a href=\"http:\/\/globallives.org\/about\/overview\/\" target=\"_blank\">Global Lives website<\/a>, the purpose of the project is to \"explore the diversity of human experience ... and encourage discussion, reflection,and inquiry about the wide variety of cultures, ethnicities, languages, and religions on this planet.\"\r\n\r\nDavid Harris, the Executive Director of Global Lives and a Mountain View High School alumnus, said Global Lives focuses on two main questions: What could global empathy look like, and what are the boundaries of an individual's moral universe?\r\n\r\nThe exhibit displays the days of the participants in real time to the audience as if they were on the PST time zone, according to teacher Eric Bloom.\r\n\r\n\"In the morning, it'll be their [the participants'] morning, wherever they are in the world, so there's an idea about kids just keep coming back,\" Bloom said. \"They'll see different parts of the day, and they can reflect on what they're doing in their day and what somebody else is doing in their day.\"\r\n\r\nWhile the Paly community is free to view the exhibit throughout the day, teachers may also schedule self-guided, \"Meet the Filmmaker\" and docent-led tours via Schoology. All tours are scheduled to last about 30 minutes.\r\n\r\nIn partnership with curriculum design professor Denise Pope from the Stanford University School of Eduation, Global Lives also developed a teaching curriculum called \"Unheard Stories\" for middle and high school students. It is aligned with the English and history Common Core standards and consists of three parts: Understanding Myself, Barriers to Understanding and Understanding Others.\r\n\r\nSome Paly teachers have integrated the curriculum into their classes, including the Social Justice Pathway.\r\n\r\n\"Erin [Angell] and I used it [the curriculum] in our Social Justice Pathway to give kids an opportunity to think about who they are and what influences them and then give them the chance to look into the lives of others,\" Bloom said.\r\n\r\nHarris encourages the use of the Global Lives website, which includes some of the exhibit videos, biographies of participants and an interactive map that shows connections between participants, to supplement the curriculum.\r\n\r\nPart of the Global Lives Project exhibit is currently on display at the local think tank Institute for the Future in downtown Palo Alto.\r\n\r\nHarris is looking forward to the project being displayed in the MAC.\r\n\r\n\"I have to say, this [the MAC] is one of the most exciting spaces I've had to work with in a long time,\" Harris said. \"Between your [Paly's] 14 different screens built into the walls here and the eight screens Global Lives will be bringing in ... this will be the first place we've ever shown all 20 of the Global Lives videos ... so this is a really cool opportunity for me as a filmmaker and artist, as well.\"","excerpt":"The Global Lives Project, a San Francisco-based nonprofit organization, will exhibit an interactive video display focused on broadening cross-cultural understanding and empathy during the week-long grand opening of the Palo Alto High School Media Arts Center starting Oct. 13.","date":"2014-09-29 17:20:55","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg","categories":["News","Spotlight"],"tags":{"29316":"curriculum","29220":"david evan harris","29219":"david harris","29221":"denise pope","29026":"exhibit","29025":"global lives","29222":"global lives project","18366":"mac","11127":"media arts center","8944":"palo alto high school","29027":"project","9653":"stanford","29028":"unheard stories"}},{"id":75059,"title":"What&#8217;s in my bag: Dorothy Han","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/whats-in-my-bag-dorothy-han\/","content":"<code><iframe src=\"\/\/www.thinglink.com\/card\/573253626114342914\" width=\"620\" height=\"465\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/code>\r\n\r\nThe Paly Voice went around asking students what they have in their bag in order to find out more about who they are. This week we sat down with junior Dorothy Han. Hover around the photo to learn more.","excerpt":"The Paly Voice went around asking students what they have in their bag in order to find out more about who they are. This week we sat down with junior Dorothy Han.","date":"2014-09-29 14:41:03","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0368.jpg","categories":["Multimedia","Spotlight"],"tags":{"29475":"backpack","29473":"dorothy han","29474":"three things","29476":"what's in my bag"}},{"id":74736,"title":"Football Recap: Vikings routed in second home game 35-7","permalink":"http:\/\/palyvoice.com\/2014\/09\/28\/football-recap-vikings-routed-in-second-home-game-35-7\/","content":"The Palo Alto High School football team (1-3, 0-0) failed to snap out of its recent offensive struggles, falling to the Palma High School Chieftains (4-0, 0-0) 35-7 on Friday night, despite a notable change in the offensive lineup.\r\n\r\nJunior quarterback Justin Hull started the game in place of junior Oliver Svirsky, the team's starting quarterback during the its first three games. Hull, a team captain, braved through several rough hits and instigated a few solid drives for the Vikings. Head coach Jake Halas credits Hull's work ethic and attitude every game to the quarterback switch.\r\n\r\n\"<span style=\"color: #3e454c;\">He's a gamer,\" Halas said after the loss. \"That's why he's in there at quarterback. We made the [quarterback] move because on game day, that kid shows up. Number five shows up to play.\" <\/span>\r\n\r\n[caption id=\"attachment_74966\" align=\"alignnone\" width=\"960\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg\"><img class=\"size-full wp-image-74966\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg\" alt=\"Members of the Palo Alto High School football team observe the game action from the home sideline. The Vikings lost their third straight game Friday night vs. Palma \" width=\"960\" height=\"720\" \/><\/a> Members of the Palo Alto High School football team observe the game action from the home sideline. The Vikings lost their third straight game Friday night vs. Palma. Photo by Josh Yuen.[\/caption]\r\n\r\nEven with Hull running the offense, the Chieftains defense held the Vikings scoreless until senior running back Jayshawn Puckett finally broke through for a 23-yard touchdown rush with 9:09 left in the game. Despite watching the Chieftains take full control of the game early in the fourth quarter, Puckett is proud of the way that the team stuck together and kept playing until the end.\r\n\r\n\"Our team kept fighting and pushing,\" Puckett said. \"We just kept fighting and tried to make something happen, something positive. I can say that we worked more as a team tonight, something that we've been struggling do.\"\r\n\r\nThe Chieftains offense, highlighted by sophomore phenom tailback Emilio Martinez, struck for four overpowering touchdowns in the first half. Martinez accounted for three of the team's five touchdowns, sprinting into the end zone in a variety of ways, including a screen pass and an inside run.\r\n\r\nThe Vikings turned the ball over to the Chieftains four times, which continuously crushed any hopes of a Vikings rally. Despite the team's continuous struggles, Hull feels that the team is making improvements and is playing better than what the score might indicate.\r\n\r\n\"We played hard,\" Hull said. \"The first half was closer than what the scoreboard said. The second half we played pretty well actually. We battled and that's all you can really ask for.\"\r\n\r\nThe Vikings will host the Wilcox High School Chargers (2-1, 0-0) for their first division game of the season at 7 p.m. on Friday, Oct. 3 at Hod Ray Field.","excerpt":"Despite starting a different quarterback, the Palo Alto High School football team (1-3, 0-0) was unable to snap out of a two-game scoring drought, falling to the Palma High School Chieftains (4-0, 0-0) 35-7 on Friday night. ","date":"2014-09-28 18:36:32","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg","categories":["Football","Sports","Sports Recap","Spotlight"],"tags":{"8714":"football","29315":"palma","8939":"palo alto"}},{"id":75016,"title":"Student journalists comment on J-day experience","permalink":"http:\/\/palyvoice.com\/2014\/09\/27\/student-journalists-comment-on-j-day-experience\/","content":"Student journalists at today's Journalism Education Association of Northern California <a href=\"http:\/\/palyvoice.com\/2014\/09\/27\/slideshow-jeanc-j-day\/\" target=\"_blank\">J-day journalism convention<\/a> at Palo Alto High School's Media Arts Center responded to The Paly Voice's questions: What's the coolest thing you've seen or heard here, and how will you apply what you've learned today to your publication?\r\n\r\nHover over the dots to read each student's response.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/572556695549509633\" width=\"620\" height=\"827\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nPhotos by George Lu.","excerpt":"Student journalists at today's Journalism Education Association of Northern California’s J-day journalism convention at Palo Alto High School's Media Arts Center responded to The Paly Voice's questions: What's the coolest thing you've seen or heard here, and how will you apply what you've learned today to your publication?","date":"2014-09-27 23:18:31","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/tmp5725566955495096331.jpg","categories":["Multimedia","Spotlight"],"tags":{"29411":"eagle eye","29410":"el camino fundamental","29389":"el estoque","29391":"georgeluphotography","8751":"gunn","29399":"j-day","29385":"jday","29386":"jeanc","29401":"Journalism Education Association of Northern California","18366":"mac","11127":"media arts center","11288":"monta vista","29402":"mvhs","29400":"norcaljday","29405":"octagon","29403":"oracle","8944":"palo alto high school","8996":"play","29413":"raven report","29404":"sacramento country day school","29409":"san leandro","10667":"santa clara","25428":"sequoia","29406":"stockton early college academy","29408":"the cargo","29412":"the roar","29415":"thing link","29414":"thinglink","29407":"wolves' chronicle"}},{"id":74981,"title":"Slideshow: JEANC J-day","permalink":"http:\/\/palyvoice.com\/2014\/09\/27\/slideshow-jeanc-j-day\/","content":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics. [slideshow post_id=74981]","excerpt":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics.","date":"2014-09-27 16:25:23","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_54291.jpg","categories":["Slideshow","Spotlight"],"tags":{"29389":"el estoque","29390":"elena kadvany","29391":"georgeluphotography","10751":"jack brook","29385":"jday","29386":"jeanc","8814":"journalism","29388":"lisa krieger","8964":"paly voice","29387":"paul kandell","18379":"rowan mcevoy","9202":"verde","9792":"viking"}},{"id":74752,"title":"Liveblog: Football vs. Palma","permalink":"http:\/\/palyvoice.com\/2014\/09\/26\/liveblog-football-vs-palma\/","content":"<em>Check back at 7:30 p.m. for live coverage as Palo Alto high school's football team (1-2, 0-0) takes on Palma High School (3-0, 0-0).<\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School football team (1-2, 0-0) takes on Palma High School (3-0, 0-0) at 7:30 p.m. Friday Sept. 25 at Paly.","date":"2014-09-26 18:18:31","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_3294-1.jpeg","categories":["Sports"],"tags":{"8714":"football","8855":"liveblog","29315":"palma","8953":"paly"}}]