[{"id":74042,"title":"Where are they now: Lily Zhang","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/where-are-they-now-lily-zhang\/","content":"[caption id=\"attachment_75694\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/asdfsdf-2.jpg\"><img class=\"size-full wp-image-75694\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/asdfsdf-2.jpg\" alt=\"Lily Zhang poses for a selfie with her bronze medal from the 2014 Youth Olympic Games. Photo by Lily Zhang.\" width=\"250\" height=\"333\" \/><\/a> Lily Zhang poses for a selfie with her bronze medal from the 2014 Youth Olympic Games. Photo by Lily Zhang.[\/caption]\r\n\r\nMaking Olympic history for the United States is not something a typical 18-year-old can check off her bucket list.\r\n\r\nNeither is being named \"Athlete of the Month\" for a sport by Team USA.\r\n\r\nRecent Palo Alto High School alumna Lily Zhang has accomplished both of these things and more. Not only is she the first (and only) American to have competed at the Olympic Games prior to the Youth Olympic Games, but Zhang is also the first to win a table tennis medal at the Olympic level for the U.S. She secured a bronze medal in women’s singles table tennis last month at the Youth Olympics in Nanjing, China. After a victorious trip overseas, Zhang returned to the Bay Area to pursue her college education at University of California, Berkeley.\r\n\r\nThe Paly Voice caught up with Zhang to learn more about her experiences as a professional athlete.\r\n\r\n<strong>The Paly Voice:<\/strong> When and why did you start playing table tennis?\r\n\r\n<strong>Lily Zhang:<\/strong> I started playing at the age of seven when my friend took me to the Palo Alto Table Tennis Club.\r\n\r\n<strong>TPV:<\/strong> What has been your favorite part about playing?\r\n\r\n<strong>LZ:<\/strong> There's so much that drew me to table tennis. I love the rapidity of the game, the vast amount of different strategies and styles, the mental aspect of the sport and I especially love traveling for tournaments and learning about the various cultures of the world.\r\n\r\n<strong>TPV:<\/strong> What are your hopes or expectations of the table tennis program at UC Berkeley?\r\n\r\n<strong>LZ:<\/strong> I know that UC Berkeley has one of the best table tennis teams in the nation and I already know many of the players on the team, so I'm extremely excited to join the team. I also hope to help the team win gold at the College Nationals next semester.\r\n\r\n<strong>TPV:<\/strong> How do you think the demands of a college student will affect your training?\r\n\r\n<strong>LZ:<\/strong> It's definitely much harder to practice here because of the demands of college, but I'm going to try to push myself to practice as much as I can on the weekends, as well as go home to my club on some weekends to practice.\r\n\r\n<strong>TPV:<\/strong> How has your experience at the Youth Olympic Games helped you as a professional athlete?\r\n\r\n<strong>LZ:<\/strong> Participating in the Youth Olympic Games has given me so much experience I can take with me to future tournaments or events. I think my mental game improved significantly after the Games, as I was able to calm myself down and breathe deeply whenever I got too nervous there.\r\n\r\n<strong>TPV:<\/strong> What’s the most helpful advice your coach or anyone has ever given you?\r\n\r\n<strong>LZ:<\/strong> l think the most helpful advice I received was from my parents. Unlike many other parents in this sport, my parents never, ever pushed me to play table tennis and always gave me the choice to pursue what I wanted. In doing so, they helped me realize that I play because I truly love the sport, not because I was pushed or forced to.\r\n\r\n<strong>TPV:<\/strong> Do you have any advice for current Paly athletes?\r\n\r\n<strong>LZ:<\/strong> I guess my advice to current Paly athletes would be something along the same lines: Pursue something you're really passionate about because you will work hard to achieve your goals, but at the same time, really enjoy doing it.\r\n\r\n<strong>TPV:<\/strong> What are the next steps in your table tennis career?\r\n\r\n<strong>LZ:<\/strong> I'm still trying to work it out with my professors, but I'm hoping to attend the 2014 World Junior Championships in Shanghai, China. It'll be my seventh time playing World Juniors, and my goal is to win the first ever medal for the U.S. there.","excerpt":"Making Olympic history for the United States is not something a typical 18-year-old can check off his or her bucket list. Recent Paly alumna Lily Zhang, however, is not your typical 18-year-old. ","date":"2014-10-09 15:11:40","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974391_10153225607383012_2071431614_n.jpg","categories":["Features","Spotlight"],"tags":{"29309":"cal","29307":"lily zhang","11531":"olympics","29311":"ping pong","29310":"table tennis","29308":"uc berkeley","11615":"where are they now"}},{"id":75853,"title":"Get a &#8220;taste&#8221; of Tasting Week","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/get-a-taste-of-tasting-week\/","content":"<em> Food celebration sweeps local schools in the Bay Area <\/em>\r\n\r\n[caption id=\"attachment_75855\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg\"><img class=\"size-full wp-image-75855\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg\" alt=\"The Paly cafeteria has a variety of food, from healthy fruit to unhealthy chips. The point of Tasting Week is to introduce healthier options to schools in Palo Alto and teach students about what they are eating. Photo by Ana Caklovic.\" width=\"600\" height=\"450\" \/><\/a> The Palo Alto High School cafeteria has a variety of food, from healthy fruit to unhealthy chips. The purpose of Tasting Week is to introduce healthier options to schools in Palo Alto and teach students about what they are eating. Photo by Ana Caklovic.[\/caption]\r\n\r\nTasting Week, a food event led by professional chefs, offers students in the Palo Alto Unified School District a chance to participate in various food-related workshops.\r\n\r\nAlthough the event is generally scheduled for Oct. 6-10, in reality, the celebration will extend into the next month, including a workshop held on Oct. 23 at Gunn High School, according to the <a href=\"tastingweek.com\">Tasting Week website<\/a>. Palo Alto High School students are welcome and are encouraged to participate at the event.\r\n\r\nChefs from popular Bay Area restaurants are running workshops so that students can learn more about food in a qualitative way, according to Tasting Week event organizers. Some of the PAUSD schools participating will be Escondido Elementary School and Barron Park Elementary School, according to the Tasting Week Calendar on the website.\r\n\r\nOn a press release on Monday, PAUSD Communications Coordinator Tabitha Kappeler-Hurley wrote that some of the chefs leading the workshops include c<span style=\"color: #222222;\">hef Charlie Ayers from Calafia in Palo Alto, chef Marco Fossati from Four Seasons in Palo Alto and chef Nathan Beriau from Ritz Carlton in San Francisco.<\/span>\r\n\r\nThe top chefs are visiting local schools to blossom students’ love for food, share new tastes and aromas, as well as teach students alternatives to unhealthy food options, according to Kappeler-Hurley.\r\n\r\n“The idea to have Bay Area schools launch this celebration of food came from a group of Bay Area parents who believe that educating children about taste is the best way to get them to love food and, at the same time, to fight obesity,” Kappeler-Hurley wrote.\r\n\r\nAfter its launch in Palo Alto four years ago, Tasting Week has now expanded to schools across the bay in cities such as San Francisco and Berkeley. The founder of the organization of the Bay Area Tasting Week organization is Rebecca Scholl-Barbier, a Palo Alto parent with four children in the PAUSD.\r\n\r\nSome students see the benefits of the event and are eager to sample and learn about the different tastes.\r\n\r\n“I’d want to go to a workshop,” Walter Hays Elementary fifth grader Hana Krieger said. “I think it [Tasting Week] is good because it gives students a chance to try things for free.”\r\n\r\nOthers understand the goal of Tasting Week, and see how it can educate people.\r\n\r\n“A lot of people who don’t know how to cook would want to go to the event,\" junior Isabelle Vincent said. \"People who don’t really know what goes in their food can develop healthier eating habits [at the workshops]. It’s always good to know how to cook at least one thing. I wouldn’t go out of my way to go [to a workshop] but if I knew it was happening and I was free I’d go.”\r\n\r\nFor those who are interested in participating in this event, the Tasting Week schedule for schools in the PAUSD can be found on the <a href=\"http:\/\/www.tastingweek.com\/calendar\/tasting-week-school-schedule-2014\/\">official website<\/a>.","excerpt":"Tasting Week, a food event led by professional chefs, offers students in the Palo Alto Unified School District a chance to participate in various food-related workshops.","date":"2014-10-09 15:09:11","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg","categories":["News","Spotlight"],"tags":{"8512":"Bay Area","29863":"chef","29864":"elementary school","8713":"Food","8751":"gunn","29867":"health","29866":"obesity","29862":"tasting week","29865":"walter hays"}},{"id":75082,"title":"APPetite blog: 2F1B","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/appetite-blog-2f1b\/","content":"<em>Welcome to APPetite, a student-run blog all about apps. We, Liana and Maddy, are here to help you make the most important of life decisions: “What app should I download next for my phone\/tablet?” Since we know you totally have loads of time to waste on your smartphone between school, sports and a myriad of other extra-curricular activities, be sure to check out APPetite to fulfill your hunger for your next app addiction.<\/em>\r\n\r\n<strong>Two Fingers One Brain (2F1B)<\/strong>\r\n\r\n<strong>Price: FREE<\/strong>\r\n\r\n<strong>Available: App Store, Google Play<\/strong>\r\n\r\n<strong>Rank: 4.9\/5<\/strong>\r\n\r\n<strong style=\"color: #000000;\">Why you should download: \"Two Fingers One Brain\" is great for those who are up for a challenge and like a good brain workout.<\/strong>\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/573334491259469825\" width=\"620\" height=\"229\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n\"Two Fingers One Brain,\" a.k.a. 2F1B, is an app that challenges users as it forces them to multitask. In the app you complete two mini-games simultaneously while under time pressure and a limited number of lives. The game is over once users run out of their five lives. Having to complete two different mini-games under time pressure on different sides of the screen is harder than it looks, but oh-so-addicting.\r\n\r\nPerfect for the competitive type, this app will test your patience as even the simplest tasks (e.g. how many numbers are here?) seem like the most advanced problems. When playing, it is important to not get discouraged as part of the fun is all of those facepalm moments.\r\n\r\nI stumbled across this app at the recommendation of a friend and have been hooked ever since. The only downside is when two of the hardest games are going on simultaneously, which is not a fun situation. But that's the draw: Those hard games are what keep you coming back for more wanting to get that high score.\r\n\r\nA variety of mini-games allows the user to not get bored by varying tasks while keeping them familiar.\r\n\r\nIt takes only one brain to know that this app is a winner and only one finger to download it, so if you're up for the challenge be sure to start testing your skills with 2F1B.","excerpt":"Two Fingers One Brain, a.k.a. 2F1B, is an app that challenges users as it forces them to multitask. In the app you complete two mini-games simultaneously while under time pressure and a limited number of lives. The game is over once users run out of their five lives. Having to complete two different mini-games under time pressure on different sides of the screen is harder than it looks, but oh-so-addicting.","date":"2014-10-09 13:47:33","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/11.jpg","categories":["APPetite","Spotlight"],"tags":{"29811":"2f1b","29416":"APPetite","29478":"blog","29810":"two fingers one brain"}},{"id":75684,"title":"What&#8217;s in my bag: Natalie Holler","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/whats-in-my-bag-natalie-holler\/","content":"<code><img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/576136198569852929\/1024\/10\/scaletowidth#tl-576136198569852929;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><\/code>\r\n\r\nAs part of The Paly Voice's \"What's in my Bag\" series to find out more about students at Paly, this week we sat down with senior Natalie Holler. Hover around the photo to learn more.","excerpt":"As part of the Paly Voice's \"What's in You're Bag\" series to find out more about students at Paly, this week we sat down with senior Natalie Holler. ","date":"2014-10-09 13:34:36","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/bag.png","categories":["Multimedia","Spotlight"],"tags":[]},{"id":75221,"title":"100 dollars a day for long showers?","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/100-dollars-a-day-for-long-showers\/","content":"<p>The City of Palo Alto adopted a new policy in which people who overuse water can face fines of up to $100 a day.  The new policy will involve a four step process. The first two violations will give the home either a letter or door hanger describing the water usage.<span style=\"color: #000000;\"> The third violation will be a letter describing the fines and the at the fourth violation, the fines will be executed, according to the City Council.<\/span><\/p>\r\n<p><span style=\"color: #000000;\">Palo Alto High School students have opinions on whether this process will be helpful or hurtful. Hover over the dots on the photo for student opinions.<\/span><\/p>\r\n<p><img style=\"max-width:100%\" src=\"\/\/cdn.thinglink.me\/api\/image\/576183855950594050\/1024\/10\/scaletowidth#tl-576183855950594050;1043138249'\" class=\"alwaysThinglink\"\/><script async charset=\"utf-8\" src=\"\/\/cdn.thinglink.me\/jse\/embed.js\"><\/script><\/p>\r\n","excerpt":"The City of Palo Alto adopted a new system to penalize residents who overuse water to help conserve water in the drought. The new system involves a series of warnings and then fines in order to stop water waste. ","date":"2014-10-09 13:27:21","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/unnamed.jpg","categories":["Uncategorized","Verbatims"],"tags":{"29490":"drought","8916":"news","8927":"opinion","8939":"palo alto","10249":"water"}},{"id":75319,"title":"Smartphone and iPhone Cult(ure)","permalink":"http:\/\/palyvoice.com\/2014\/10\/08\/smartphone-and-iphone-culture\/","content":"<em>Living in Silicon Valley, it’s no surprise that students here are incredibly \"well-connected.\"<\/em>\r\n\r\n[caption id=\"attachment_75348\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg\"><img class=\"size-full wp-image-75348\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg\" alt=\"Freshman Olivia Fernandez uses her iPhone to work on her homework during her prep. Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> Freshman Olivia Fernandez uses her iPhone to work on her homework during her prep. Photo by Ana Caklovic.[\/caption]\r\n\r\nNo one would guess that a public high school's number one addiction is being called education’s greatest resource. But the growing dependency on this product and the technology behind it is transforming the culture of Palo Alto High School. Technology represents the language of the next generation, the top end of the education spectrum and a community that’s pushing the boundaries of innovation. But what is Paly's latest obsession, both in the classroom and on the Quad? The smartphone.\r\n\r\nSophomore Samarth Venkatasubramaniam agrees: “Both students and teachers [are] becoming really dependent on their smartphones,\" Venkatrasubramaniam said. \"Many teachers … ask you to pull out your phone and ‘take this quiz’ or ‘use this app’. And students … communicate using their phone whether it’s chatting or texting and calling or Snapchatting … they’re always on their phones for communication or studies.”\r\n\r\nThe presence of iPhones and other smartphones in the classroom is viewed as an influence that can both help and distract. Students have a tendency to get distracted when they use their phones, but junior Ella Higashi thinks there are benefits that outweigh the risk of distraction.\r\n\r\n“My history class used them [smartphones] the other day, and I think it was helpful,\" Higashi said. \"Sometimes ... in science you can use your phone to upload things to the screen, which is really good for visual learning.\"\r\n\r\nSenior Claire Priestley also feels distraction should not be a major concern when using smartphones educationally.\r\n\r\n“Teachers are really concerned with you not being on task with your phone but I think the majority of the people will stay on task because most people here are really good people,” Priestley said.\r\n\r\nThe increasing use of smartphones in classroom activities may be due to an overall increase in smartphone ownership, specifically, iPhone ownership. In a study entitled “Smartphone Ownership in 2013,” the Pew Research Center found that “those from the upper end of the income and education spectrum are much more likely than those with lower income and educational levels to say they own an iPhone.\" The study found that 25 percent of cellphone users in the U.S. own an iPhone.\r\n\r\nThe iPhones is known for its beautiful design and intuitive interface. However, students like Higashi argue that the Apple product is overrated and that phones should be valued for their functionality instead of their beauty.\r\n\r\n“I think other smartphones can do the same stuff as iPhones,\" Higashi said. \"I think it’s more of the name ‘iPhone.'\"\r\n\r\nAccording to senior Maeve Lavelle, the popularity of iPhones and the power of the brand name seems to only have increased with time.\r\n\r\n“Freshman year it was kind of like, ‘Oh, you have an iPhone, cool. I don’t,’ but it was still acceptable. By senior year everyone has an iPhone except for maybe the odd few, and if you don’t have one by now, it’s kind of like ‘Oh, what’s up with you?’” Lavelle said, who is an owner of an iPhone 5S.\r\n\r\nOne aspect that contributes to iPhone ownership may just be a matter of familiarity with the iPhone and an unwillingness to step out of the comfort zone of Apple products. “I’ve only had an iPhone... so I don’t really know how to use phones that aren’t iPhones,” Priestley said. “I think I’d always stick with the iPhone because it’s just what I know.”\r\n\r\nThe iPhone can be either be perceived as a positive result of technology or an unnecessary display of money. iPhone culture is the feeling that an iPhones is the only acceptable type of phone, and that not having an iPhone is a huge loss and disadvantage.\r\n\r\n“[iPhone culture] is a result of us being in the upper-middle class to upper class, and it’s kind of a gross display of our wealth,” junior Sean Jawetz said. “But I don’t think it has a positive or negative effect on the culture of our student body.”\r\n\r\nThe dependency on smartphones shows that the technology culture is unnaturally strong and the iPhone culture even stronger. Paly students recognize that Paly’s iPhone culture is the exception, not the rule.\r\n\r\nAs Venkatasubramaniam puts it, “Phones are practical, obviously.That’s why people use them.”\r\n\r\n[caption id=\"attachment_75349\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97991.jpg\"><img class=\"size-full wp-image-75349\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97991.jpg\" alt=\"Sophomore Ciara Bleahen and sophomore Alicia Mies use their iPhones to listen to music and study in the library. Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> Sophomore Ciara Bleahen and sophomore Alicia Mies use their iPhones to listen to music and study in the library. Photo by Ana Caklovic.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Technology represents the language of the next generation, the top end of the education spectrum and a community that’s pushing the boundaries of innovation. But what is Paly's latest obsession, both in the classroom and on the Quad? The smartphone. ","date":"2014-10-08 18:35:11","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg","categories":["Features","Spotlight"],"tags":{"29624":"classroom","29620":"culture","29621":"feature","8793":"iphone","29623":"smartphone","9154":"technology","29622":"trend"}},{"id":75751,"title":"Sen. Ron Wyden, Paly alumnus, to hold hearing on campus","permalink":"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/","content":"[caption id=\"attachment_75761\" align=\"alignnone\" width=\"537\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg\"><img class=\" wp-image-75761\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg\" alt=\"U.S. Senator Ron Wyden gives a presentation titled &quot;American Innovation &amp; Your Privacy in a Digital World&quot; at Tech Fest Northwest in Portland, Oregon in Aug. 2014. Photo by the Office of Senator Ron Wyden.\" width=\"537\" height=\"403\" \/><\/a> U.S. Sen. Ron Wyden gives a presentation titled \"American Innovation and Your Privacy in a Digital World\" at Tech Fest Northwest in Portland this August. Tomorrow, Wyden will hold a Chairman's Roundtable titled \"The Impact of Mass Surveillance on the Digital Economy\" in the Big Gym of Palo Alto High School. Representatives from Google, Facebook, Dropbox, Grelock Partners and Microsoft will be a part of the discussion. Photo by the Office of Senator Ron Wyden.[\/caption]\r\n\r\nUnited States Sen. Ron Wyden will hold a Chairman’s Roundtable to discuss “The Impact of Mass Surveillance on the Digital Economy” in his first public forum for a Silicon Valley audience at 11 a.m. tomorrow in the Big Gym at Palo Alto High School, his former high school.\r\n\r\nParticipants will discuss how government mass surveillance programs are challenging innovation and global competitiveness, as well as their effects on businesses and its technology sector.\r\n\r\n“The economic impact [of mass surveillance] has gotten less attention, so that’s a really important topic that Wyden wants to give attention to,” Wyden's spokesman Keith Chu said.\r\n\r\nWyden has advocated for the U.S. to take a leading role in ensuring the preservation of the Internet as an open platform for communication and commerce, according to the <a href=\"https:\/\/www.eventbrite.com\/e\/chairmans-roundtable-the-impact-of-mass-surveillance-on-the-digital-economy-registration-13338841835\">event details<\/a>.\r\n\r\nThe individuals who will be present at the Chairman's Roundtable discussion include: Senate Finance Committee Chairman Ron Wyden, Executive Chairman of Google Eric Schmidt, Executive Vice President and General Counsel of Microsoft Brad Smith, General Counsel of Facebook Colin Stretch, General Counsel of Dropbox Ramsey Homsany and Partner of Greylock Partners John Lilly.\r\n\r\nAccording to <a href=\"http:\/\/www.wyden.senate.gov\/\">Wyden's Website<\/a>, Wyden served in the U.S. House of Representatives from 1981 until his election into Senate, and he currently is the top ranking Democrat for the Energy and Natural Resources Committee, while also serving on the Committees of Finance, Budget and Intelligence.\r\n\r\nThe event will take place at Paly's Big Gym where former Paly student Wyden, who graduated in late 1960, played basketball in high school.\r\n\r\nWhile an RSVP is not necessary, it is strongly recommended to make one <a href=\"https:\/\/wyden-nsa-roundtable.eventbrite.com\">here<\/a><span style=\"text-decoration: underline;\">.<\/span> Paly students and the general public are all welcomed.\r\n\r\n“As many students as possible would be great,” Chu said.","excerpt":"United States Senator Ron Wyden will hold a Chairman’s Roundtable to discuss “The Impact of Mass Surveillance on the Digital Economy” at 11 a.m. tomorrow in the Big Gym of Palo Alto High School.","date":"2014-10-07 21:37:54","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg","categories":["News","Spotlight"],"tags":{"11286":"big gym","29834":"chairman","29822":"Chairman's Roundtable","29828":"Committee","29827":"Democrat","29831":"digital","29832":"digital economy","29826":"economy","8753":"gym","29825":"innovation","29817":"Keith Chu","29830":"mass surveillance","29821":"Ron","29819":"Ron Wyden","29833":"roundtable","29818":"senator","29824":"Silicon Valley","29829":"surveillance","29823":"United States Senator","29820":"Wyden"}},{"id":75725,"title":"ASB profits from breast cancer awareness shirts","permalink":"http:\/\/palyvoice.com\/2014\/10\/07\/asb-profits-from-breast-cancer-awareness-shirts\/","content":"Palo Alto High School’s Associated Student Body meeting <a href=\"https:\/\/docs.google.com\/document\/d\/1aOWb0nbacex1jcIKZGbOwmFLAnX-brAdU_6abe343Hc\/edit\">minutes<\/a> from yesterday announced that ASB profited from the awareness shirts they <a href=\"http:\/\/palyvoice.com\/2014\/10\/02\/associated-student-body-releases-breast-cancer-awareness-statement\/\">sold<\/a> last week. According to the meeting minutes, ASB sold 405 of the 450 shirts and made a profit of $1,535.\r\n\r\nBreast cancer organization, HERS,  collected $450 in direct donations at the ASB-hosted tailgate on Friday, according to Student Activities Director Matt Hall.\r\n\r\nHall is very pleased that ASB did not lose money on the shirts after the <a href=\"http:\/\/palyvoice.com\/2014\/10\/02\/asb-breast-cancer-awareness-shirts-stir-controversy\/\">controversy<\/a>.\r\n\r\n“We were a little worried because we thought we started selling them late or that the pricing and sizing was off,\" Hall said.\r\n\r\nMany students said that ASB should not have sold the shirts considering the profits did not benefit the cause directly. After Claire Liu and other ASB officers Facebook postings about the shirt controversy, students said they understood that ASB’s intentions were never malicious, according to Senior Vice President Olivia Scola.\r\n\r\nSenior Coby Parker says he understands that ASB is legally not allowed to donated directly to the cause.\r\n\r\n“I think that the shirts are a good way of raising awareness for a meaningful cause and I know that ASB would have preferred to donate directly,\" Parker said. \"I understand they are legally not allowed to, but at first their idea was a little half-baked.”\r\n\r\nASB has sold out of all long-sleeve white shirts and is close to selling out of short sleeve pink shirts. There are many shirts that people ordered online and have not picked up yet.\r\n\r\nASB plans to discuss what to do with the profits made at the meeting tomorrow during 3rd period.\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s Associated Student Body meeting minutes from yesterday announced that ASB profited from the awareness shirts they sold last week. According to the meeting minutes, ASB sold 405 of the 450 shirts they bought and made a profit of $1535. \r\n","date":"2014-10-07 18:57:46","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/unnamed-1.jpg","categories":["News","Uncategorized"],"tags":{"8496":"ASB","14289":"awareness","29183":"cancer","29814":"coby parker","29812":"hers","8873":"Matt Hall","29813":"olivia scola","28780":"shirts"}},{"id":75679,"title":"Voice of the week: Zoe Limbrick","permalink":"http:\/\/palyvoice.com\/2014\/10\/07\/voice-of-the-week-zoe-limbrick\/","content":"&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_75753\" align=\"aligncenter\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_31802.jpg\"><img class=\"wp-image-75753\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_31802.jpg\" alt=\"\" width=\"500\" height=\"332\" \/><\/a> Junior Zoe Limbrick pauses from her fast-paced life to pose for The Paly Voice. Limbrick can often be found eating bagels, working on Paly Radio Club projects or simply lounging in the Media Arts Center. Photo by Chloe Fishman.[\/caption]\r\n\r\n<span style=\"color: #000000;\">This week The Paly Voice sat down with junior Zoe Limbrick to discuss her hilarious twitter, her love of bagels and her grandma's fridge.<\/span>\r\n\r\nThe Paly Voice: You have an extremely funny Twitter. How did it all start?\r\n\r\nZoe Limbrick: So the story of how I made my Twitter was freshman year they were interviewing me for The Campanile's 1 in 2000 thing. What a great way to start off life. So I was just going through my interview, talking about myself, and they said \"You should make a Twitter\" and I was like \"Okay.\" I started off tweeting some weird puns about sloths and Aeropostale and stuff. I think I deleted them, I was so embarrassed. And then I sort of just evolved with my life and here I am as @CaptainGenovia.\r\n\r\nTPV: What is your favorite tweet?\r\n\r\nZL: I do not have a favorite tweet, because would JK Rowling have a favorite book? People would expected her to have \"Harry Potter and the Goblet of Fire\" be her favorite book, but no. And my favorite tweet also is not my most popular tweet. I think it's some random tweet that nobody favorited from sophomore year. When the government was shut down, with a lot of abbreviations and stuff, \"you can shut down the government but you can't shut down my style.\" It got like two favorites. I was like \"Oh yeah! That is comedy gold.\"\r\n\r\nPV: Your most popular tweet is one referring to sophomore boys. Please explain the tweet and its inspiration.\r\n\r\nZL: The popular sophomore boys last year just never sat down during lunch, so I was like \"Please, rest your weary bones and take a rest.\" So I snapped a little pic and tweeted about it. It was \"Breaking news: popular sophomore boys are incapable of sitting.\"\r\n\r\nPV: If you could go anywhere in the world right now for a month, where would you go?\r\n\r\nZL: I'd go to New Zealand and roam with the sheep in the wilderness and have a good time. New Zealand is cool. My family is from New Zealand and I like it, and I know it as a place with lots of sheep. So I thought that would be a wild thing to bring up right now. Felt like an appropriate thing to say.\r\n\r\nPV: What is your favorite snack food?\r\n\r\nZL: Bagels are the backbone of this nation. If I had to live off of one item, it would be a bagel. There's a classic cream cheese, but also you can make a whole bagel sandwich. They are so diverse. I saw a Tumblr post that said you could just cut a hole in a piece of bread and call it a bagel, but that is the most insulting thing you could ever say.\r\n\r\nPV: Tell us about your involvement in Paly Radio Club.\r\n\r\nZL: Well, once-upon-a-time, in beginning journalism, Paul Kandell asked if anyone wanted to do radio. So I raised my hand but I never actually went to any of the meetings. It turns out that nobody went to any of the meetings. Then Maya Kandell said \"Hello! My father has an opportunity for radio\" and I said \"well I still want to do that.\" And my life just sort of descended into recording myself saying things and then making everyone listen to it, which is the dream.\r\n\r\nPV: What do you talk about on the air?\r\n\r\nZL: Well last week, I interviewed Molly Kraus about a poem she wrote about Ferguson (Missouri), and I posted that on SoundCloud. And we just have a good time.\r\n\r\nPV: What would people be surprised to find out that you do in free time?\r\n\r\nZL: Unrelated to bagels or radio, I sort of just sit in my house and go on Twitter and Tumblr. I watch a lot of comedy TV. I was raised on \"Seinfeld\" and \"Spongebob Squarepants.\" That cultivated me as a human being.\r\n\r\nPV: Have you read Tina Fey's book?\r\n\r\nZL: Yes! I am obsessed with Tina Fey and Amy Poehler as a duo, and for my friend's birthday I found these weird necklaces from Etsy where someone did a shrinky dink of their faces. It's very low quality on these chains you'd probably buy from a random art store, and I was like \"Ah yes. I will spend $20 on shipping and handling on this. Definitely worth my money.\"\r\n\r\nPV: What did you do last night?\r\n\r\nZL: I went to the Lorde concert. It was at the Greek theatre in Berkeley. And she's such a chill person. She's like \"I feel connected to the trees and nature right now. I like performing outdoors.\" And I'm like \"You go, Lorde. You connect to your trees. Rock on.\" She has a very strange hair flip dance move. It's very weird how she and Taylor Swift are best friends.\r\n\r\nPV: What is the weirdest thing in your refrigerator right now?\r\n\r\nZL: My family and I are semi-hoarders. We never throw out food, so we probably have yogurt from two months ago. Oh wait, I can tell you about my grandma's fridge. She is also an insane hoarder but she keeps a stack of $20 bills in the back of her fridge for safe keeping. I have not seen it, but it's a rumor within my family that she has this stack.\r\n\r\nPV: Now everyone is going to try to rob her!\r\n\r\nZL: No her fridge is so strange, nobody will try and get into that ... She's going to see this. She's on Facebook, and we're friends. She's going to share it and be like 'God dammit, Zoe. I just used the Lord's name in vain for you.'\r\n\r\nPV: What has been your favorite experience at Paly so far?\r\n\r\nZL: That sounds like some spiritual thing. The first thing that comes to my head is the Weird Wednesday. As a freshman, I was like I'm gunna go all out. I came in paisley pajama pants tucked into these weird rain boots and a big rain coat with leg warmers on my arms and ski goggles. Yeah, rock on Paly! And I took the shuttle to school, which was first of all, a big mistake. I sat on the shuttle among all of the normally dressed high schoolers. So then I just traversed across the school looking like I was ready to go skiing and take a nap. I was like \"Oh dear, I'm a small freshman.\" I went all out, like \"I'm gonna rule this school. Everyone's gonna love me.\" I was trying to act like \"Oh yeah I'm in on the joke that I look like a fool right now.\"\r\n\r\nPV: What is the last thing you want to say to the Paly community?\r\n\r\nZL: Hello NSA Employees, I know you read this, you cheeky minxes, please remember to floss as it is critical to your dental health and your gums won't bleed at the dentist.\r\n\r\n<em style=\"color: #000000;\">If you know a student (or student group) who you think should be interviewed, please leave a comment below.<\/em>","excerpt":"This week The Paly Voice sat down with junior Zoe Limbrick to discuss her hilarious twitter, her love of bagels and her grandma's fridge.","date":"2014-10-07 14:47:57","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_31802.jpg","categories":["Spotlight","Voice of the Week"],"tags":{"29809":"New Zealand","29808":"twitter","10258":"voice of the week","29690":"zoe limbrick"}},{"id":74473,"title":"Slideshow: Fiery Arts fall glass sale","permalink":"http:\/\/palyvoice.com\/2014\/10\/07\/slideshow-fiery-arts-fall-glass-sale\/","content":"Thanks to proceeds from the annual fall glassblowing sale, half of the Palo Alto High School Fiery Art Program's operating budget is secured this year.  The sale, hosted by Paly's Fiery Arts program, took place Sept. 19 and 20 on the corner of Embarcadero Road and El Camino Real. Over 800 pieces of glass art were available for sale, ranging from glass pumpkins, pears, apples, flowers and more, according to the <a href=\"http:\/\/paly.net\/event\/paly-fiery-arts-fall-glass-sale\">Paly website<\/a>.\r\n\r\n\"The sale [was] a success,\"ceramics teacher and organizer of the event Steve Ferrera said.\r\n\r\nAccording to Ferrera, there will also be a w<span style=\"color: #222222;\">inter sale on <\/span><span class=\"aBn\" style=\"color: #222222;\" tabindex=\"0\" data-term=\"goog_1438059656\"><span class=\"aQJ\">Dec. 6 and 7, and a<\/span><\/span><span style=\"color: #222222;\">ll proceeds will benefit the Fiery Arts program <\/span>\r\n\r\n\"We will have glass tree ornaments, reindeer and candy canes,\" Ferrara said. \"And a lot of discounted items — great for presents.\"\r\n\r\n[slideshow post_id=74473]","excerpt":"Over 800 pieces of glass art ranging from glass pumpkins, pears, apples, flowers and more were available at the Fiery Arts program's annual fall sale. To see the full slideshow of the event, read more.","date":"2014-10-07 14:01:15","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Nika4.jpg","categories":["Multimedia"],"tags":{"29380":"fiery arts","29382":"glass","29815":"glass blowing","29381":"glassblowing","8944":"palo alto high school","8953":"paly","29383":"sale","9107":"slideshow","29816":"steve ferrera"}}]