[{"id":80054,"title":"The final word on finals: A review of the resources","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/the-final-word-on-finals-a-review-of-the-resources\/","content":"As finals week approaches, Palo Alto High School students are starting to review for their semester exams. The Paly Voice investigated the resources available to Paly students, which include the library’s extended hours, tutoring by teachers in the Writing Center and free dinner for students staying late.\r\n\r\nPaly librarian Rachel Kellerman expects between 50 and 100 students to use the extended hours program.\r\n\r\n“This is our third year that we’ve done a late hours program, which was [started] in response to students wanting to work here late,\" Kellerman said.\r\n\r\nHover around the photo to learn more.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/599001324889047042\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe library, Student Center and Writing Center are open from 4 p.m. to 8 p.m., Monday through Thursday this week and Monday through Thursday next week. Dinner will be served in the Student Center between 5:30 p.m. and 6 p.m. each night.","excerpt":"As finals week approaches, The Paly Voice investigated the resources available to Paly students, such as the library’s extended hours, tutoring by teachers in the Writing Center and free dinner for students staying late.","date":"2014-12-09 18:47:51","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1776-copy.jpg","categories":["Features","Uncategorized"],"tags":{"34102":"extended hours","10172":"finals","33526":"first semester","8848":"Library","9045":"review","34116":"semester final","34117":"study","34115":"winter finals"}},{"id":79957,"title":"Students protest jury rulings on Quad","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/students-protest-jury-rulings-on-quad\/","content":"Palo Alto High School's Black Scholars United club arranged a peaceful protest today during Lunch on the Quad as a response to the recent Ferguson and Staten Island grand jury rulings.\r\n\r\nWhile protests were held in downtown Palo Alto on <a href=\"http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/\" target=\"_blank\">Nov. 25<\/a> and on <a href=\"https:\/\/www.facebook.com\/video.php?v=10152529283086305\" target=\"_blank\">Dec. 3<\/a> after grand juries ruled against indicting police officers Darren Wilson and Daniel Pantaleo, respectively, today was Paly's first student-led response to the grand jury decisions.\r\n\r\n[caption id=\"attachment_80045\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg\"><img class=\"wp-image-80045\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg\" alt=\"bsu\" width=\"350\" height=\"233\" \/><\/a> Palo Alto High School students in the Blacks Scholars United club hold signs on the Quad during Lunch. These posters read messages like \"#blacklivesmatter\" and \"I can't breathe.\" Photo by George Lu.[\/caption]\r\n\r\nStudents held signs with phrases such as \"When will this stop\" and \"Hands up, don't shoot\" and chanted \"No justice, no peace\" and \"Stop the violence.\" Unity Club members also drew chalk outlines of bodies, names of unarmed minorities who were killed by police officers and hashtagged catchphrases around campus.\r\n\r\nSenior Tiffany Fields, who held a sign saying \"My brother's keeper,\" told the crowd, \"Mike Brown could be my brother any day because he would put his hands up if someone's going to shoot him. Like Eric Garner, my brother is big, he's tall, and he could be choked to death because he is big – because he is intimidating, because of the color of his skin, and that's a problem for me.\"\r\n\r\nJunior Dami Bolarinwa's sign said, \"This is the United States. Are we truly united? This ain't a black thing, this ain't a white thing. It's all our problems.\"\r\n\r\n[soundcloud url=\"https:\/\/api.soundcloud.com\/tracks\/180759869\" params=\"color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false\" width=\"100%\" height=\"166\" iframe=\"true\" \/]\r\n\r\nSenior BSU co-president Jamina Kirkendoll wanted to promote awareness and a sense of unity within the community with this protest.\r\n\r\n\"The impact I was hoping for was to get this issue known on campus so that people can join, that black lives do matter, that we should support each other – it doesn't matter what skin color we are – that we are all together as one,\" Kirkendoll said.\r\n\r\nJunior Siggi Bengston said she believes that the youth play a crucial role in social issues.\r\n\r\n[caption id=\"attachment_80033\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8522.jpg\"><img class=\"wp-image-80033\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8522.jpg\" alt=\"Paly's Black Scholars United senior co-president Jamina Kirkendoll led chants during the protest. Photo by George Lu.\" width=\"250\" height=\"375\" \/><\/a> Paly's Black Scholars United senior co-president Jamina Kirkendoll leads chants during the protest. Photo by George Lu.[\/caption]\r\n\r\n\"I don't think people realize how real racism is on Paly campus and people don't realize how serious this issue is,\" Bengston said. \"We have the means to change society, and it starts with us. We are the younger generation. If we don't do anything and we sit around and are silent, nothing is going to change.\"\r\n\r\nOnly a few other students joined the 15 or so BSU members in the protest, but Fields said that this was not a concern to the club.\r\n\r\n\"We [BSU] weren't expecting anything,\" Fields said. \"We were doing this for a cause that we wanted to support. We wanted to do it for ourselves to show everyone that we care.\"\r\n\r\nSenior Sabrina Goyal felt that the fact that the protest was on the Quad during Lunch lessened the effectiveness of the protest.\r\n\r\n\"I would say I'm kind of disappointed that it's only a small group [of protestors] because I feel like everyone kind of shares these views,\" Goyal said. \"I believe in what they're saying, but I don't feel comfortable going up there and standing with them. I think that's kind of a shame. I guess it [the protest] is a start.\"\r\n\r\nPaly librarian Rachel Kellerman said that more students should feel comfortable expressing themselves on campus.\r\n\r\n\"I think it's part of our democracy, and it's great that students can participate in this democracy,\" Kellerman said. \"Part of that is peaceful protests sanctioned by the administration or the government. ... That's a big part of democracy – to express yourself in a peaceful way. Frankly, I wish students would do more of that here to express themselves.\"\r\n\r\nJunior Ariya Momeny felt that the protest was not well-timed and said he believed that if the protest supported the officers in question, the school would not be as supportive.\r\n\r\n[caption id=\"attachment_80037\" align=\"alignleft\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0197.jpg\"><img class=\"wp-image-80037\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0197.jpg\" alt=\"Chalk outlines of bodies, phrases like &quot;Don't shoot&quot; and &quot;Black lives matter&quot; and names of unarmed minorities who have been killed by police officers were drawn around campus. Photo by Lizzie Chun.\" width=\"250\" height=\"334\" \/><\/a> Chalk outlines of bodies, phrases like \"Don't shoot\" and \"Black lives matter\" and names of unarmed minorities who have been killed by police officers were drawn around campus. Photo by Lizzie Chun.[\/caption]\r\n\r\n\"This is and could be interpreted as affecting my education because lunchtime is my only time that I can unwind, especially during this period when I'm studying for finals and am really stressed out,\" Momeny said. \"I don't personally mind, but I could totally see how someone could be offended by this. It's a question of the guidelines and rules of how this [protest] is allowed, but if I was protesting something that the school itself didn't like or wasn't completely accepted by people, I would get shut down.\"\r\n\r\n<em>Editor's note: The story was corrected on Dec. 10 to attribute the chalk-drawn outlines to the Unity Club, not the Black Scholars United club.<\/em>","excerpt":"Palo Alto High School's Black Scholars United club arranged a peaceful protest today during Lunch on the Quad as a response to the recent Ferguson and Staten Island grand jury rulings.","date":"2014-12-09 14:44:08","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg","categories":["News","Spotlight"],"tags":{"34108":"ariya momeny","34103":"black scholars united","33962":"bsu","34106":"dami bolarinwa","33964":"daniel pantaleo","33958":"eric garner","33464":"ferguson","33961":"grand jury ruling","33465":"indictment","34104":"jamina kirkendoll","10167":"lunch","33462":"michael brown","33960":"mike brown","8944":"palo alto high school","33468":"peaceful","33467":"protest","9021":"quad","9025":"rachel kellerman","34107":"sabrina goyal","9102":"siggi bengston","33959":"staten island","34105":"tiffany fields","34180":"unity club"}},{"id":79978,"title":"City library to offer extended hours for teens during finals","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/city-library-to-offer-extended-hours-for-teens-during-finals\/","content":"[caption id=\"attachment_80018\" align=\"aligncenter\" width=\"557\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo.jpg\"><img class=\"wp-image-80018\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo.jpg\" alt=\"photo\" width=\"557\" height=\"418\" \/><\/a> Children play air hockey in the Teen Center at Mitchell Park during the Grand Opening of the new Mitchell Park facilities. The Teen Center will be open to provide space for fun and studying during finals week.[\/caption]\r\n\r\nThe Mitchell Park Library and the Teen Center will be open until 10 p.m. for high school students on Dec. 16-18 to assist teens in studying for final exams.\r\n\r\nThe extended hours will be open for any high school students with a valid student ID, according to a <a href=\"file:\/\/\/Users\/student\/Downloads\/finalsflyerFINAL.pdf\">press release<\/a> from the City of Palo Alto. Refreshments will be provided along with all of the resources for studying as well as fun at the Teen Center, which has air hockey and ping-pong tables.\r\n\r\nPalo Alto Teen Program Specialist Jose Perez said the extended hours will provide a relaxing environment for teens.\r\n\r\n\"The purpose is for students to study and have a work space, as well as space to relax and decompress,\" Perez said. \"There is going to be games, movies, snacks, and other fun activities listed.\"\r\n\r\nThe extended hours are a part of a series of events catered for teens during Teen Week at the Mitchell Park Library to celebrate its grand opening. Other events include a photojournalism workshop on Dec. 13 and an Xbox tournament on Dec. 19 after finals, according to a <a href=\"http:\/\/www.cityofpaloalto.org\/civicax\/filebank\/documents\/44939\">press release<\/a>.\r\n\r\nFor more information, visit the <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/lib\/teens\/default.asp\">Teens section<\/a> of the City of Palo Alto website.","excerpt":"The Mitchell Park Library and the Teen Center will be open until 10 p.m. for high school students on Dec. 16-18.","date":"2014-12-09 14:01:16","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo.jpg","categories":["News"],"tags":{"34101":"air hockey","34100":"city","34102":"extended hours","10172":"finals","8848":"Library","27709":"mitchell park","29311":"ping pong","29936":"studying","34099":"teen center"}},{"id":79659,"title":"Town and Country participates in holiday gift drive","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/town-and-country-participates-in-holiday-gift-drive\/","content":"[caption id=\"attachment_80019\" align=\"aligncenter\" width=\"700\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/unnamed1.jpg\"><img class=\"wp-image-80019 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/unnamed1.jpg\" alt=\"unnamed\" width=\"700\" height=\"525\" \/><\/a> A Christmas tree set up by The Family Giving Tree organization sits outside Ambassador Toys at Town and Country. The charity aims to provide gifts for underprivileged children in the Bay Area. Photo by Samuel Desré.[\/caption]\r\n\r\nTown and Country Village is engaging in a holiday gift drive run by the charity <a href=\"http:\/\/www.familygivingtree.org\/index.php\">Family Giving Tree,<\/a> which gives gifts to disadvantaged children in the Bay Area.\r\n\r\nThe organization has set up a Christmas tree, located in front of Ambassador Toys in Town and Country, with cards listing children's wishes, located in front of Ambassador Toys.\r\n\r\nSandra, an employee at Ambassador Toys, explained the process.\r\n\r\n\"To help ... the Family Giving Tree you [costumers] pick a tag from the tree that is up front, then you will buy the gift, which will go to underprivileged kids around the Bay Area that do not usually get a lot of gifts during the holiday season,\" Sandra said.\r\n\r\nAccording to Sandra, the Palo Alto community has been extremely generous in its participation in the gift drive.\r\n\r\n\"Almost half of the wish cards have already being taken,\" Sandra said.\r\n\r\nPaly student junior Matt Keller commended the charity and the event.\r\n\r\n\"I think it's a good cause because people around here have a lot to give back to the community,\" Keller said.\r\n\r\nFamily Giving Tree is in its 23rd year and has donated over 900,000 gifts and backpacks in California, according to its website. The last day to donate a gift to the charity is Dec. 19.","excerpt":"Town and Country Village is engaging in a holiday gift drive run by the charity Family Giving Tree, which gives gifts to disadvantaged kids in the Bay Area.","date":"2014-12-09 13:52:32","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/unnamed.jpg","categories":["News"],"tags":{"33929":"Family Giving Tree","33928":"Gift drive","32534":"holiday","9179":"Town and Country"}},{"id":79970,"title":"Paly Theatre to host 11th annual &#8216;Play in a Day&#8217;","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/paly-theatre-to-host-11th-annual-play-in-a-day\/","content":"[caption id=\"attachment_78171\" align=\"alignright\" width=\"221\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg\"><img class=\" wp-image-78171\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg\" alt=\"Members of the Palo Alto Theatre Department rehearse in costume in preparation for the opening night of &quot;Server of Two Masters&quot; last month. Photo by Alex Merkle-Raymond.\" width=\"221\" height=\"166\" \/><\/a> Members of the Palo Alto Theatre Department rehearse in costume in preparation for the opening night of \"Server of Two Masters\" last month. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nThe Palo Alto High School Theatre Department is hosting its 11th annual \"Play in a Day\" at 8 p.m. on Dec. 20 in the Haymarket Theater.\r\n\r\n“'Play in a Day' is pretty much exactly what it sounds like,” producer senior Hannah Nguyen said. “A big group of current Paly students as well as Paly alumni come together for just over 24 hours to produce a series of short plays.”\r\n\r\nAccording to Nguyen, participating actors and playwrights get together on Dec. 19 and are placed into groups. Each playwright is then assigned a theme and has to write a short play involving all the actors before 8 a.m. the next morning. After the script is finished, the actors rehearse all day for the performance at 8 p.m. on Dec. 20.\r\n\r\n“The best part [of the event] is that it’s tradition for alumni to participate,” Nguyen said. “Everyone has so much fun spending time with old friends doing theatre for an entire day. Even though there’s always a time crunch and it seems like there’s no way that the plays are going to work, everything somehow magically comes together.\"\r\n\r\nParticipants of the event echo the thoughts of Nguyen.\r\n\r\n“I think it’s a lot of fun, and it’s a good opportunity for people that don’t really do theatre a lot to get involved,” senior Katherine Craig said. “It’s really hectic and crazy, but the end result is always hilarious and worth it.”\r\n\r\nThose who want to sign up should contact <a href=\"mailto:hannah.nguyen@ymail.com\">Nguyen<\/a> as soon as possible. For those who simply want to enjoy a night of theatre, tickets are $10 for adults and $7 for seniors and students. They can be bought at the door or online at the Paly Theatre <a href=\"http:\/\/www.palytheatre.com\/\">website<\/a>. ","excerpt":"The Palo Alto High School Theatre Department is hosting its 11th annual \"Play in a Day\" at 7:30 p.m. on Dec. 20 in the Haymarket Theater.","date":"2014-12-09 13:37:01","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg","categories":["News"],"tags":[]},{"id":79790,"title":"What&#8217;s in my bag: Annie Zhou","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/whats-in-my-bag-annie-zhou\/","content":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, this week we sat down with freshman Annie Zhou. Hover around the photo to learn more.\r\n<code><img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/597179639495917568\/1024\/10\/scaletowidth#tl-597179639495917568;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><\/code>\r\n\r\nEditor's note: Will Zhou is not related to Annie Zhou.","excerpt":"As part of The Paly Voice’s “What’s in my Bag” series to find out more about students at Palo Alto High School, this week we sat down with freshman Annie Zhou.","date":"2014-12-09 13:25:20","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-4.jpg","categories":["Entertainment","Spotlight"],"tags":{"34096":"annie zhou","29475":"backpack","34097":"notebook","9129":"student","29476":"what's in my bag"}},{"id":79920,"title":"Before and after: Boys&#8217; soccer sports new hairdos","permalink":"http:\/\/palyvoice.com\/2014\/12\/08\/before-and-after-boys-soccer-sports-new-hairdos\/","content":"[caption id=\"attachment_79937\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-2.jpg\"><img class=\"size-full wp-image-79937\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-2.jpg\" alt=\"Sophomore Derek Schoenberger puts on his socks before soccer practice on Dec. 8, three days after receiving an &quot;Avatar&quot; style haircut. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> Sophomore Derek Schoenberger puts on his socks before soccer practice on Dec. 8, three days after receiving an \"Avatar\" style haircut. Photo by Amy Leung.[\/caption]\r\n\r\nSometimes, your idea of a perfect cut and your barber's idea of what you want don't quite align, resulting in a catastrophe. Although you may ask for it to be fixed, oftentimes you go home and hope to salvage it by styling it in the best way possible. In the case of some members of the Palo Alto High School boys' soccer team, the only option of styling is to cover it up completely with a beanie.\r\n\r\nLast Friday, the boys' varsity team members gave the traditional beginning-of-the-season haircuts to each team member, the worst of which were given to to first-year varsity players. The Paly Voice took before and after shots for a side-by-side comparison of some of the best (or worst) hairstyles.\r\n\r\n[caption id=\"attachment_79926\" align=\"alignleft\" width=\"213\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4709.gif\"><img class=\"size-full wp-image-79926\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4709.gif\" alt=\"Before: Junior Ariya Momeny. GIF by Amy Leung.\" width=\"213\" height=\"400\" \/><\/a> Before: Junior Ariya Momeny. GIF by Amy Leung.[\/caption]\r\n\r\n[caption id=\"attachment_79921\" align=\"alignleft\" width=\"213\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4704.gif\"><img class=\"wp-image-79921 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4704.gif\" alt=\"IMG_4704\" width=\"213\" height=\"400\" \/><\/a> After: Momeny and his \"Split Macklemore\" style. GIF by Amy Leung.[\/caption]\r\n\r\n[caption id=\"attachment_79927\" align=\"alignleft\" width=\"213\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4710.gif\"><img class=\"size-full wp-image-79927\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4710.gif\" alt=\"Before: Joseph Berardi. GIF by Amy Leung.\" width=\"213\" height=\"398\" \/><\/a> Before: Junior Joseph Berardi. GIF by Amy Leung.[\/caption]\r\n\r\n[caption id=\"attachment_79925\" align=\"alignleft\" width=\"215\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4708.gif\"><img class=\"size-full wp-image-79925\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4708.gif\" alt=\"After: Berardi and his &quot;Inverse Yamaka&quot; style. GIF by Amy Leung.\" width=\"215\" height=\"398\" \/><\/a> After: Berardi and his \"Inverse Yamaka\" style. GIF by Amy Leung.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_79929\" align=\"alignleft\" width=\"211\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4712.gif\"><img class=\"size-full wp-image-79929\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4712.gif\" alt=\"Before: Junior Quinn Grecius. GIF by Amy Leung.\" width=\"211\" height=\"396\" \/><\/a> Before: Junior Quinn Greicius. GIF by Amy Leung.[\/caption]\r\n\r\n[caption id=\"attachment_79924\" align=\"alignleft\" width=\"215\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4707.gif\"><img class=\"wp-image-79924 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4707.gif\" alt=\"IMG_4707\" width=\"215\" height=\"396\" \/><\/a> After: Greicius and his \"Geometric Chunk\" style. GIF by Amy Leung.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_79725\" align=\"alignleft\" width=\"213\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4662.gif\"><img class=\" wp-image-79725\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4662.gif\" alt=\"Before: Junior Takaaki Sagawa.\" width=\"213\" height=\"396\" \/><\/a> Before: Junior Takaaki Sagawa. GIF by Amy Leung.[\/caption]\r\n\r\n[caption id=\"attachment_79922\" align=\"alignleft\" width=\"210\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4705.gif\"><img class=\" wp-image-79922\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_4705.gif\" alt=\"After: Sagawa and his &quot;Handprint&quot; style. GIF by Amy Leung.\" width=\"210\" height=\"396\" \/><\/a> After: Sagawa and his \"Handprint\" style. GIF by Amy Leung.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Last Friday, the boys' varsity team gave its traditional beginning-of-the-season haircuts to each team member, the worst of which were given to to first-year varsity players. The Paly Voice took before and after shots for a side-by-side comparison of some of the best (or worst) hairstyles.","date":"2014-12-08 21:16:05","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/photo-2.jpg","categories":["Multimedia","Spotlight"],"tags":{"23909":"2014-2015","33956":"bad haircuts","10311":"boys soccer","33957":"gifs","33955":"incoming players","10519":"soccer haircuts","10523":"tradition","9200":"varsity"}},{"id":79896,"title":"This week&#8217;s Advisory is for all freshmen and seniors","permalink":"http:\/\/palyvoice.com\/2014\/12\/06\/this-weeks-advisory-is-for-all-freshmen-and-seniors\/","content":"","excerpt":"","date":"2014-12-06 18:13:28","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8462":"Advisory"}},{"id":79894,"title":"B day schedule on Monday, Dec. 8, C day on Friday, Dec. 12","permalink":"http:\/\/palyvoice.com\/2014\/12\/06\/b-day-schedule-on-monday-dec-8-c-day-on-friday-dec-12\/","content":"","excerpt":"","date":"2014-12-06 18:10:25","author":"Lizzie Chun","categories":["Ticker"],"tags":{"33934":"c day","33935":"schedule change"}},{"id":79775,"title":"Library plans finalized during facilities meeting","permalink":"http:\/\/palyvoice.com\/2014\/12\/05\/library-plans-finalized-during-facilities-meeting\/","content":"The Palo Alto High School library's new schematic plans were finalized for the approval of the school board in a Facilities Steering Committee meeting held on Tuesday.\r\n\r\n[caption id=\"attachment_79881\" align=\"alignright\" width=\"368\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/Screen-Shot-2014-12-05-at-3.41.43-PM.png\"><img class=\"wp-image-79881 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/Screen-Shot-2014-12-05-at-3.41.43-PM.png\" alt=\"Proposed Palo Alto High School library plans to send to the school board. The new plan is 13,000 square feet and get seat approximately 265. Photo courtesy of Deems Lewis McKinley Architecture.\" width=\"368\" height=\"365\" \/><\/a> Proposed Palo Alto High School library plans to send to the school board. The new plan is 13,000 square feet and get seat approximately 265. Photo courtesy of Deems Lewis McKinley Architecture.[\/caption]\r\n\r\nThe plan was unanimously voted on and is now ready to be sent to the school board for approval in late January.\r\n\r\nThe plan will include a new study area that is separated by window walls. There will be a new instructional and activities area in addition to increased storage space mainly to showcase books hanging in an \"L\" shape over the main part of the library, according to the architect Deems Lewis McKinley Architecture.\r\n\r\nAccording to Tom Hodges, the <span style=\"color: #000000;\">manager of the Palo Alto Unified School District’s bond program,<\/span> construction for the library construction cannot begin until the construction on the Performing Arts Center is finished, which will most likely be in March of 2016.\r\n\r\nDLM representative Erwin Lee says that major parts of the library plans are finished and only minor details need to be ironed out.\r\n\r\n\"On the library side, we're fine tuning a lot of stuff,\" Lee said. \"We added a study area that changes from an open area to a windowed walled closed area.\"","excerpt":"The Palo Alto High School Facilities Steering Committee unanimously voted on Tuesday to adopt the new library plans for approval of the school board in late January.","date":"2014-12-05 16:08:24","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/10841360_10205885334756877_978363161_n.jpg","categories":["News","Spotlight"],"tags":{"8616":"construction","8690":"facilities","33927":"finalize","8848":"Library","8944":"palo alto high school","29187":"renovation","33926":"schematics"}}]