[{"id":78252,"title":"Opinion: Destigmatize counseling in the Palo Alto community","permalink":"http:\/\/palyvoice.com\/2014\/11\/09\/opinion-destigmatize-counseling-in-the-palo-alto-community\/","content":"Counseling at Palo Alto High School is highly stigmatized, and is a concept many students are ignorant towards. Some do not know what ACS is or exactly what it does.\r\n\r\n[caption id=\"attachment_78393\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg\"><img class=\"wp-image-78393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg\" alt=\"photo\" width=\"400\" height=\"300\" \/><\/a> Adolescent Counseling Services is located both next to the Academic Resource Center in the Library and in the Tower Building. ACS provides counseling for students one-on-one and in groups. Photo by Lydia Barry.[\/caption]\r\n\r\nThis is not right.\r\n\r\n\"I don't think people utilize [counseling] as much as they could,\" senior Sharissa Holopainen said. \"Many students fear it could be viewed as a weakness.\"\r\n\r\nWe as an educational community need to destigmatize counseling for students. Staff and students alike must begin to view counseling as a positive thing at our high school, not as a sign of weakness.\r\n\r\nSo let's set one thing straight: Going to counseling is completely normal.\r\n\r\nCounseling is not just for the mentally ill. According to the ACS <a href=\"http:\/\/paly.net\/adolescent-counseling-services\">webpage<\/a>, students can go to counseling for a range of reasons such as (but not limited to): peer relationships, isolation, grief and loss, substance abuse, depression, cross-cultural issues, self esteem, academic stress, sexuality, parent\/child communication and anxiety.\r\n\r\n\"People often associate asking for help as a negative thing,\" senior Chloe Finley said. \"I think we should continue to stress the importance of asking for help when you need it and that talking about your problems with a counselor is very beneficial.\"\r\n\r\nCounseling can be in individual or group sessions. Counseling can be for when you're having a bad day, or when you get into a fight with your parents. It can be for when you fail a test, or even when you've just gotten great news and want someone to listen.\r\n\r\nNow that we've cleared all that up, let's talk about who else you can talk to on campus if you aren't inclined to attend ACS. At Paly, your Teacher Adviser and guidance counselor are trained to assist you if you ask them for help. They can refer you to someone to talk to, help you manage your stress or just be there to listen. Not to mention, your peers and teachers can often be an incredible support system, and we should not forget to rely on them in times of need. There are countless people at Paly who want to help you through whatever you're going through.\r\n\r\nCounseling is a great method for helping students that our school provides for free. Don't assume that if you weren't referred to the counselor or diagnosed as having a mental illness that counseling can't help you. Even going to visit the counselor to say hi and get acquainted is a great way to get comfortable with both the counselors and the general idea of counseling.\r\n\r\nEven if you are completely content with yourself and your life, encouraging others to go and being knowledgable about counseling services on campus can do a lot.\r\n\r\n\"I think the best way to stop the stigma is to get both students and adults who have struggled and who have used counseling to help them manage to come clean about it,\" junior Elana Rebitzer said. \"I know it's a really difficult topic for a lot of people, but if students see peers and respected adults saying 'I had a tough time, I was in your shoes, but going through counseling helped me to be where I am today' more students would be likely to try it.\"\r\n\r\nStudents: We are a community within ourselves. As much as we would like them to, often times parents and school staff simply do not understand what we go through like we do. It is our responsibility as well to look out for our peers. It is also important to not forget to look out for yourselves. Yes, we are in high school, but we are also in a crucial time in our lives. I implore you all to have some fun. Spend time doing things you love. Go out with your friends. Put your homework down and go for a walk. You are all important not just as students, but as people.\r\n\r\n<em>ACS is located both off the Quad in the library (next to the Academic Resource Center) and in the Tower Building on the first floor in room 5 1\/2.<\/em>\r\n\r\n<em style=\"color: #000000;\">A list of school and community resources are available on the <a style=\"color: #31318c;\" title=\"PAUSD Health Services\" href=\"http:\/\/pausd.org\/parents\/services\/health\/index.shtml\" target=\"_blank\">PAUSD Health Services page<\/a> and the <a style=\"color: #31318c;\" title=\"PAUSD Counseling Services\" href=\"http:\/\/pausd.org\/parents\/services\/counseling\/\" target=\"_blank\">Counseling Services page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. If you feel you or someone you know needs immediate support, please call 911.<\/em>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"We as an educational community need to destigmatize counseling for students.","date":"2014-11-09 20:39:07","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg","categories":["Opinion","Spotlight"],"tags":{"32450":"counseling","8751":"gunn","8939":"palo alto","8953":"paly"}},{"id":78431,"title":"T day schedule on Monday, Veterans Day holiday on Tuesday","permalink":"http:\/\/palyvoice.com\/2014\/11\/08\/t-day-schedule-on-monday-due-to-veterans-day-off\/","content":"","excerpt":"","date":"2014-11-08 13:54:51","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32534":"holiday","29302":"schedule","32535":"t day","32533":"veterans day"}},{"id":78397,"title":"Football to play Milpitas on Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/07\/football-to-play-milpitas-on-senior-night\/","content":"The Palo Alto High School football team (3-5, 2-2) will take on Milpitas High School (8-0, 4-0) on Senior Night at 7 p.m. today at home.\r\n\r\nBoth teams are coming off wins, as the Vikings defeated Santa Clara High School 55-26 at Paly's Homecoming game while the Trojans are fresh off of a victory on their Senior Night, defeating Los Gatos 27-21.\r\n\r\nPaly junior wide receiver and captain Eli Givens knows that the team must be prepared going into this matchup.\r\n\r\n\"We feel ready,\" Givens said. \"We've been preparing for this all season.\"\r\n\r\nGivens also appreciates the effort and the dedication this year's seniors have put into the team.\r\n\r\n\"We only have five seniors,\" Givens said. \"They haven't quit on us even though some others did. It means a lot to the juniors, sophomores and freshmen that they haven't given up on this team.\"\r\n\r\nDespite some tough losses, Givens is encouraged by the teams' gradual improvement.\r\n\r\n\"It's been frustrating losing some games that we knew we could have won or at least done better,\" Givens said. \"But we have gotten better as a team from the beginning of the season to now. And it's really exciting to see that.\"\r\n\r\nThe commemorations for the five seniors will start prior to kickoff.","excerpt":"The Palo Alto High School football team (3-5, 2-2) will take on Milpitas High School (8-0, 4-0) on Senior Night at 7 p.m. today at home.","date":"2014-11-07 16:13:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o.jpg","categories":["Football","Sports"],"tags":{"9656":"eli givens","8714":"football","8889":"milpitas","8953":"paly","9087":"Senior Night"}},{"id":78164,"title":"Cross country to run in CCS Championship","permalink":"http:\/\/palyvoice.com\/2014\/11\/06\/cross-country-to-run-in-ccs-championship\/","content":"[caption id=\"attachment_78286\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/xc.png\"><img class=\"size-full wp-image-78286\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/xc.png\" alt=\"Junior Sam Desre, sophomores Kent Slaney and Naveen Pai, and senior Lucas Matison run on the 2.95 mile trail at Crystal Springs on Nov. 5. The Palo Alto High School boys' varsity team came in first. Photo courtesy of Malcom Slaney.\" width=\"600\" height=\"401\" \/><\/a> Junior Sam Desre, sophomores Kent Slaney and Naveen Pai and senior Lucas Matison run on the 2.95 mile trail at Crystal Springs on Nov. 5. The Palo Alto High School boys' varsity team came in first. Photo courtesy of Malcom Slaney.[\/caption]\r\n\r\nThe Palo Alto High School boys' cross country team will compete at the Central Coast Section Championship after finishing first in the Santa Clara Valley Athletic League El Camino division championship on Nov 5.\r\n\r\nSenior Lucas Matison led the boys by individually finishing in first place in the league championship at 2.95 mile Crystal Springs with a time of 15:31, according to <a href=\"http:\/\/www.prepcaltrack.com\/ATHLETICS\/XC\/2014\/ec_res.htm\">calpreptrack.com<\/a>. Sophomore Kent Slaney came in sixth with a time of 16:19.\r\n\r\nMatison thinks the season has gone well, despite injuries, and hopes the team will be able to make it to the state championship.\r\n\r\n<span class=\"_5yl5\" data-reactid=\".1g.$mid=11415162452246=272824f0f35bb653e42.2:0.0.0.0.0\"><span data-reactid=\".1g.$mid=11415162452246=272824f0f35bb653e42.2:0.0.0.0.0.0\"><span data-reactid=\".1g.$mid=11415162452246=272824f0f35bb653e42.2:0.0.0.0.0.0.$end:0:$0:0\">\"Some of the Paly boys have had a couple rough patches dealing with injuries this season, but today we had everyone out there strong and healthy,\" Matison said. \"From how we performed today, I think we will do quite well at CCS. I'm hoping that we can qualify to go to state as a team.\"<\/span><\/span><\/span>\r\n\r\nSophomore Naveen Pai is also confident for the CCS championship.\r\n\r\n<span class=\"_5yl5\" data-reactid=\".1j.$mid=11415161563633=2f3b5b45ae38412e888.2:0.0.0.0.0\"><span data-reactid=\".1j.$mid=11415161563633=2f3b5b45ae38412e888.2:0.0.0.0.0.0\"><span data-reactid=\".1j.$mid=11415161563633=2f3b5b45ae38412e888.2:0.0.0.0.0.0.$end:0:$0:0\">\"CCS is an ever bigger race [than the league championship] and a fun course,\" Pai said. \"I'm confident that we'll be able to perform to the best of our ability. My focus going forward is to prepare for an all-out race, and I want to give my team the best possible chance of advancing to States.\"<\/span><\/span><\/span>\r\n\r\nThe Junior Varsity boys' team also had a strong performance at the meet and placed first in the championship as well. Freshman Sam Craig, freshman Reed Foster and sophomore Ben Beaudry, respectively, finished first, second and third.\r\n\r\nThe girls' cross country team placed third overall, the same as last year, with junior Bryn Carlson placing sixth. Although the girls' team probably will not make it to CCS, individual runners may be able to compete, according to senior Kylie Wilson.\r\n\r\n\"[I'm] not sure if they will [go to CCS] this year [as a team], but individuals will probably qualify to move on,\" Wilson said.\r\n\r\nThe meet will start at 11 a.m. on Nov. 15 at Toro Park in Salinas.","excerpt":"The Palo Alto High School's boys' cross country team will be competing the CCS Championship on Nov. 15 at Toro Park in Salinas after finishing first in the SCVAL league championship.","date":"2014-11-06 19:42:07","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/xc.png","categories":["Sports","Spotlight"],"tags":{"8544":"bryn carlson","8568":"CCS","8620":"cross country","32448":"crystal springs","10041":"Lucas Matison","18834":"scvals"}},{"id":78210,"title":"Boys&#8217; water polo prepares for championships","permalink":"http:\/\/palyvoice.com\/2014\/11\/06\/water-polo-boys-league-preview\/","content":"[caption id=\"attachment_78306\" align=\"alignnone\" width=\"658\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10683495_936995846317213_634147306_o1.jpg\"><img class=\"size-full wp-image-78306\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10683495_936995846317213_634147306_o1.jpg\" alt=\"Senior Captains Lucas Novak  Ray Zhao block a shot at practice. Photo by George Lu.\" width=\"658\" height=\"421\" \/><\/a> Senior captains Lucas Novak and Ray Zhao block a shot at practice. Photo by George Lu.[\/caption]\r\n\r\nThe Palo Alto High School boys' water polo team (9-3) has high hopes as it gets ready for the De Anza League championships, which will take place from today to Saturday at Gunn High School.\r\n\r\nThe team is confident going into leagues because of its strong league record and the quality of play it has been able to produce lately.\r\n\r\nAccording to Max Preps, the top two scorers on the team are junior Winston Rosati and senior captain Lucas Novak, who have averaged of 3.3 and 2.6 goals per game, respectively. The team's offense will rely on them to make a difference in their play, according to junior driver Ryan Reed.\r\n\r\nAccording to Reed, the team had a couple of tense games this season because of its inability to control the first quarter against weaker teams.\r\n\r\n\"We can challenge the best teams, but it's important that we work on putting weaker teams away in the first quarter,\" Reed said.\r\n\r\nAccording to Reed, one of the team's weaknesses this season is the players' tendency to play down to the level of their opponents. The team's toughest opponent will be Gunn (12-0), to whom the Vikings fell, 12-6, on Senior Night, according to Reed.\r\n\r\nThe Vikings, who are ranked second in leagues, will play Homestead High School, ranked seventh, today at 6:40 p.m in the first round of the De Anza Division League tournament.\r\n\r\nIf the Vikings win against the Mustangs, they will most likely go on to play against Mountain View High School, ranked third in leagues, for a place in the championship game at 4:20 p.m on Friday.","excerpt":"The Palo Alto High School boys' water polo team (9-3) has high hopes as it gets ready for the De Anza League championships, which will take place this Thursday to Saturday at Gunn High School.","date":"2014-11-06 15:40:27","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10683495_936995846317213_634147306_o1.jpg","categories":["Sports"],"tags":{"9845":"boys water polo","15412":"de anza","15411":"leagues","32468":"ryan reed","9846":"water polo"}},{"id":78275,"title":"Club to host sMACdown","permalink":"http:\/\/palyvoice.com\/2014\/11\/06\/preview-club-to-host-smacdown\/","content":"The Palo Alto High School Super Smash Bros club will host a video gaming tournament for Paly, Gunn High School and Los Altos High School from 9 a.m. to 6 p.m. Saturday in the Paly Media Arts Center.\r\n\r\n[caption id=\"attachment_78279\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Smash-1.jpg\"><img class=\"wp-image-78279\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Smash-1.jpg\" alt=\"Smash Bros club members practice their skills during their lunchtime club  meetings. Photo by William Zhou \" width=\"400\" height=\"298\" \/><\/a> Smash Bros club members practice their skills during their lunchtime club<br \/> meetings. Photo by William Zhou[\/caption]\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/feature-what-is-smash-bro-club\/\">Super Smash Bros<\/a> is a fighting game series that has been popular among students.\r\n\r\n“Super Smash Bros is a game that can be played many times and provides a new experience every time,” Paly Super Smash Bros club president Andy Kotik said. “It can be a very competitive game or a very friendly game, so it has a broad appeal.”\r\n\r\nThe Super Smash Bros club is hosting the tournament for fun and for honor, according to Kotik.\r\n\r\n“We just love the game and want to get others into it,” Kotik said. “Second, Los Altos High School hosted one last year, so we returned the favor. Also they beat us last year, so we had to fight for our honor.”\r\n\r\nIn addition to Los Altos High School, the tournament is open to several other schools.\r\n\r\n“We invited Gunn because they have a gaming club and we know several good players so we decided to go for it,\" Kotik said. \"There were also plans to invite San Mateo High School, but it overlapped with their Homecoming.”\r\n\r\nThere will be three brackets in the tournament for the different iterations of the games and styles of play. The brackets are Project M, Brawl and crew battles. Project M and Brawl are events for singles while crew battles have a group of 12 players in six player teams face off, Kotik said.\r\n\r\nAccording to Kotik, the tournament already has over 40 participants.\r\n\r\n“It's a pretty popular game, and I figured, across three schools, we could gather a significant crowd,” Kotik said. “I'm very excited.”\r\n\r\nTo participate in the tournament, players can register <a href=\" https:\/\/docs.google.com\/forms\/d\/1ScdXImWDNwvuo0y0sIvUITdg-snYxVhs6H76H3dJmcM\/viewform\">online<\/a> or at the door from 9 a.m. to 9:50 a.m.\r\n\r\nThe tournament will also be<a href=\"http:\/\/www.twitch.tv\/palysmashbros\"> streamed online <\/a>","excerpt":"The Palo Alto High School Super Smash Bros club will host a video gaming tournament for Paly, Gunn High School and Los Altos High School <a href=\"http:\/\/palyvoice.com\/2014\/11\/06\/preview-club-to-host-smacdown\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-11-06 13:38:54","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Smash-1.jpg\nmeetings. Photo by William Zhou\" \/>","categories":["News"],"tags":{"28772":"club","32466":"gaming","8751":"gunn","9849":"los altos","8953":"paly","32464":"smash","32465":"smash bros","30023":"stream","32467":"tornament"}},{"id":78255,"title":"Liveblog: Girls&#8217; volleyball plays Gunn in Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/06\/liveblog-girls-volleyball-plays-gunn-in-senior-night\/","content":"[caption id=\"attachment_76376\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0875.jpg\"><img class=\"size-full wp-image-76376\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0875.jpg\" alt=\"Senior captain and right side hitter Anna Dukovic prepares to kill the ball in a match against Mountain View. Dukovic had the most kills of the night for the Vikings with 18  kills and had a streak of three kills in a row in the second set. Mountain View won this match in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.\" width=\"600\" height=\"399\" \/><\/a> Senior captain and right side hitter Anna Dukovic prepares to kill the ball in a match against Mountain View. Dukovic had the most kills of the night for the Vikings with 18 kills and had a streak of three kills in a row in the second set. Mountain View won this match in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\n<em>Check back at 6:30 p.m. for live coverage as Palo Alto High School girls' volleyball team takes on its rival Gunn High School in its Senior Night.\r\n<\/em>\r\n\r\n[liveblog]","excerpt":"Check back at 6:30 p.m. for live coverage as Palo Alto High School girls' volleyball team takes on its rival Gunn High School in its Senior Night.\r\n","date":"2014-11-06 13:03:58","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0875.jpg","categories":["Sports"],"tags":{"11244":"girls volleyball","8751":"gunn","8855":"liveblog","17488":"rival","9087":"Senior Night"}},{"id":78229,"title":"Community service fair to provide volunteer opportunities","permalink":"http:\/\/palyvoice.com\/2014\/11\/05\/community-service-fair-to-provide-volunteer-opportunities\/","content":"Palo Alto High School is holding a Social Action and Community Service Fair during lunch tomorrow on the Quad to inform students about local volunteer opportunities.\r\n\r\nAlmost 30 local clubs and organizations will be present at Paly to enlighten students regarding possible volunteer opportunities around the Bay Area, according to Paly community service project leader sophomore Candace Wang.\r\n\r\nThe goal of the day is to show Paly students that they can be valuable assets to the community and to the world, according to Paly community service and career adviser Christina Owen.\r\n\r\n“On average, Paly Vikings contribute more than 40,000 hours of service to nearly 200 community benefit organizations such as Boys and Girls Club, the Humane Society, Canopy tree planting, Palo Alto Art Center, City of Palo Alto sports programs and more,” Owen wrote in the Community Service Fair flier.\r\n\r\nWhile Paly has previously hosted this fair, it did not occur last year because of schedule challenges, according to Owen.\r\n\r\nStudents are asked to participate in two community service booths or donate to either the Toys for Tots booth or the InnVision winter clothing drive in order to receive free Spot's pizza. Toys should be new and wrapped and the clothing should be winter appropriate.\r\n\r\n“It [the fair] is a motivation to find out about the organizations, participate in activities, see clubs from campus and find out what their mission is,” Owen said.\r\n\r\nFor more information about community service opportunities, there is an information night on community service and social causes at 7:30 p.m. on Nov. 17 in the Social Studies Resource Center with milk and cookies.","excerpt":"Tomorrow at lunch, the Community Service Fair will be hosted on the Palo Alto High School Quad. After participating in two booths or donating to a drive, students can receive free pizza.","date":"2014-11-05 21:30:04","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/IMG_1459.jpeg","categories":["News","Spotlight"],"tags":{"11889":"christina owen","14812":"community service","15095":"fair","32454":"social action","32453":"social causes","32455":"volunteer"}},{"id":78170,"title":"Preview: &#8220;A Server of Two Masters&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/11\/05\/preview-a-server-of-two-masters\/","content":"[caption id=\"attachment_78171\" align=\"aligncenter\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg\"><img class=\" wp-image-78171\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg\" alt=\"Cast members rehearse in costume in preparation for opening night. The show opens Thursday Nov. 6. \" width=\"587\" height=\"441\" \/><\/a> Cast members rehearse in costume in preparation for the opening night of \"Server of Two Masters,\" a comedy set in Silicon Valley. The show opens this Thursday for general admission. Tickets can be bought online or at the door. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\nThe Palo Alto High School Theatre Department will debut a new show called “A Server of Two Masters” at 7:30 p.m. this Thursday in the Haymarket Theatre.\r\n\r\nThe show, written by Paly parent Tony Kienitz, is based off of Carlo Goldoni’s “The Servant of Two Masters” but adds a unique twist by setting it in the Silicon Valley. The comedy mocks Silicon Valley culture by depicting a teenager working two internships.\r\n\r\nKientz directed Paly’s first play this year, “The Stinky Cheese Man,” but Kathleen Woods, the head of the Theatre Department, will be directing the play.\r\n\r\nWoods believes that the show will be a success and that the story will be easy for the audience to connect with.\r\n\r\n“I think they [the audience] are going to be able to relate to it like crazy,” Woods said. “There’s a lot of Palo Alto specific humor, and there’s a lot of California Silicon Valley high tech humor. It’s really a lot of fun.”\r\n\r\nAccording to Woods, the play did present several unexpected challenges due to script adaptations.\r\n\r\n“Because we adapted the script and because we used improv, there have been challenges,\" Woods said. \"In fact, we are still reworking parts of it. It’s very close. We’re just working with the structure to modernize it but to keep the story clear.”\r\n\r\nJunior Charlotte Moffatt, who works as a technician for the production, says the play has many unique aspects.\r\n\r\n“It's [as] if you took Silicon Valley and mashed it up with 1500s Italian theatre and then added a lot of nonsense which gave birth to a comedy,” Moffatt said.\r\n\r\nSeveral actors said that they have enjoyed the show and its production.\r\n\r\n“The show is very fun to work on,” senior Cara Kienitz said. “It’s much different than all the shows we have done recently because they were dramas and this ones just very lighthearted and fun.”\r\n\r\nTickets are $10 for adults and $7 for seniors and students. They can be bought at the door or online at the <a href=\"http:\/\/www.palytheatre.com\/\">Paly Theatre website<\/a>. Shows will take place 7:30 p.m. to 10:30 p.m. this Thursday, Friday, and Nov. 13 to Nov. 15 at the Haymarket Theatre.","excerpt":"The Palo Alto High School Theatre Department will debut a new show called “A Server of Two Masters” at  7:30 p.m. this Thursday in the Haymarket Theater. \r\n","date":"2014-11-05 21:16:58","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1.jpeg","categories":["Entertainment","Spotlight"],"tags":{"32452":"kienitz","29646":"paly theater","9012":"preview","32446":"Server of Two Masters","9160":"theatre"}},{"id":78131,"title":"Preview: Girls&#8217; volleyball to play Gunn on Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/05\/preview-girls-volleyball-to-play-gunn-on-senior-night\/","content":"[caption id=\"attachment_76374\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg\"><img class=\"size-full wp-image-76374\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg\" alt=\"Senior captain and outside hitter Jade Schoenberger spikes the ball through a block in the game against Mountain View High School. Photo by Liana Pickrell. \" width=\"600\" height=\"399\" \/><\/a> Senior captain and outside hitter Jade Schoenberger hits the ball over a block in the game against Mountain View High School on Oct. 14. Mountain View won this match in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School girls' volleyball team (3-8, 17-11) will play crosstown rival Gunn High School (3-7, 16-12) on its Senior Night at 6:45 p.m. Thursday at home.\r\n\r\nThe Vikings' last match against Gunn resulted in a close loss (25-21, 25-23, 25-21) and a Twitter fight over school pride. However, in light of Gunn's recent <a href=\"http:\/\/palyvoice.com\/2014\/11\/04\/administration-offers-student-support-in-wake-of-gunn-student-death\/\" target=\"_blank\">tragedy<\/a>, senior defense specialist Kabria Dame says that she hopes that the competition does not get too out of hand.\r\n\r\n\"I don't want the competition between Gunn and Paly to overrule the volleyball spirit,\" Dame said. \"I also want people to come support the Gunn seniors because they deserve to be supported after their loss.\"\r\n\r\nRegardless, senior setter and right side Gillian Chryst says the team has the drive to win this game against its rival.\r\n\r\n“We’re just really excited,\" Chryst said. \"We’ve been playing these girls since the beginning of high school, so it’s kind of bittersweet. They [Gunn] stole one early from us, and it was a close match even though we lost in three sets, but I definitely think that we can take them.\"\r\n\r\nChryst also said that this game is important in order to prove that this year's volleyball team, with a less impressive record than those of previous seasons, is still strong.\r\n\r\n“This is the last time we can show the school and everyone that we are a good team and that we all have talent,” Chryst said.\r\n\r\nDame agreed, stressing the importance of Senior Night in that this match is the closing game of their years at Paly.\r\n\r\n“This is our last game in the Big Gym, and it’s our Senior Night,\" Dame said. \"We need to win.\"\r\n\r\nThe match will start at 6:45 p.m., but there will be commemorations for the seven seniors beforehand.","excerpt":"The Palo Alto High School girls' volleyball team (2-8, 16-11) will play crosstown rival Gunn High School (3-7, 16-12) in its Senior Night at 6:45 p.m. on Thursday at home. Although the match starts at 6:45 p.m., there will be commemorations for the seven seniors beforehand.","date":"2014-11-05 17:52:51","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0936.jpg","categories":["Sports","Spotlight"],"tags":{"8751":"gunn","8953":"paly","9087":"Senior Night","9216":"volleyball"}}]