[{"id":72768,"title":"Review: Gelataio brings a taste of Italy to downtown","permalink":"http:\/\/palyvoice.com\/2014\/08\/28\/review-gelataio-brings-a-taste-of-italy-to-downtown\/","content":"[caption id=\"attachment_72777\" align=\"aligncenter\" width=\"543\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/2gelato.jpg\"><img class=\"wp-image-72777 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/2gelato.jpg\" alt=\"2gelato\" width=\"543\" height=\"407\" \/><\/a> Two Piccolo cups with cajeta (Mexican caramel) and chocolate in one cup and mint chocolate chip and straciatella in the other. On top of each gelato cup, a triangle-shaped wafer dipped in either milk or dark chocolate from two chocolate faucets is placed. Photo by Liana Pickrell.[\/caption]\r\n\r\n[caption id=\"attachment_72821\" align=\"alignleft\" width=\"183\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo.jpg\"><img class=\"wp-image-72821\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo.jpg\" alt=\"The sign outside of Gelataio advertising freshly made flavors. The sign also displays its slogan: &quot;Naturally California Fresh.&quot; Photo by Maddy Jones.\" width=\"183\" height=\"243\" \/><\/a> This sign outside of Gelataio advertises its freshly made flavors. The sign also displays its slogan: \"Naturally California Fresh.\" Photo by Maddy Jones.[\/caption]\r\n\r\nUpon our arrival to the well-lit and colorfully-furnished shop located at 121 Lytton Ave, the abundance of choices hit us. Although Gelataio is slightly off the beaten path of University Avenue, its modern flair and unique spin on gelato makes it worth the extra trek to the end of Lytton Avenue near the train station.\r\n\r\nGelataio, which opened Aug. 14, blends together traditional gelato from Italy with fresh California ingredients.  The atmosphere also offers a blended vibe. The mixture of Italian chatter from behind the counter and the high-tempo, artsy pop music playing in the background created an inviting and cool ambiance.\r\n\r\nRanging from traditional gelato to chocolate-dipped gelato bars and take-home pints, Gelataio will satisfy any sweet tooth. In order to try a range of tates we tried the Piccolino and four different flavors of gelato in Piccolo-sized cups: mint and choco-chip, straciatella, chocolate and cajeta (Mexican caramel). All the flavors were very creamy and fresh tasting, but not overbearingly sweet.\r\n\r\n\"What I intend to do is make my gelatos with an Italian passion and California fresh products that we have here,\" store founder and gelatiere Christianne Mares said. Mares grew up making gelato in Germany for friends and family, but two years ago she took classes and started making it professionally.\r\n\r\n[caption id=\"attachment_72868\" align=\"alignright\" width=\"273\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-9.jpg\"><img class=\"wp-image-72868\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-9.jpg\" alt=\"Gelataio displays its various offerings of gelato flavors at the front of the store. Photo by Maddy Jones.\" width=\"273\" height=\"159\" \/><\/a> Gelataio displays its various offerings of gelato flavors at the front of the store. Photo by Maddy Jones.[\/caption]\r\n\r\nAlthough some items are slightly pricey, each cup comes with at least two flavors and is expertly presented with a chocolate dipped wafer. Even the small, Piccolo ($3.99), is plenty to eat. For the extra hungry, the Regular ($4.99) offers three flavors and the Grande ($5.99), which offers five flavors, is coming soon.\r\n\r\nThe highlight of the dessert was the Piccolino ($3.15). It was a mini three-inch hazelnut ice cream cone dipped in chocolate and topped with crushed hazelnuts. It was a perfect marriage of Nutella and a Drumstick in a little three-inch cone.\r\n\r\nAnother reason to love this store is the punch card Gelataio hands to you after you pay where after you order seven different times you get a free gelato of any size.\r\n\r\nOverall, Gelataio is definitely worth it to go to. The flavors are rich and the gelato is creamy.\r\n\r\nGelataio is open everyday. Sunday to Wednesday it is open from 12 a.m. to 9 p.m. and from Thursday to Saturday it is open from 12 p.m. to 10 p.m.","excerpt":"Although slightly off the beaten path of University Ave, Gelataio's modern flair and unique spin on gelato makes it worth the extra trek to the end of Lytton Ave near the train station.","date":"2014-08-28 17:27:49","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/2gelato.jpg","categories":["Features","Opinion","Spotlight"],"tags":{"8713":"Food","23903":"gelataio","9044":"restaurant","9045":"review"}},{"id":72937,"title":"Verbatim: Reactions to the Napa earthquake","permalink":"http:\/\/palyvoice.com\/2014\/08\/27\/verbatim-reactions-to-the-napa-earthquake\/","content":"The Paly Voice asks students and teacher about their reactions to the earthquake last week as well as how they would react in the case of a severe earthquake in Palo Alto.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/pKHJjM-h30o\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asks students and teacher about their reactions to the earthquake last week as well as how they would react in case of a severe earthquake in Palo Alto.","date":"2014-08-27 18:07:11","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/earthquakeverbatimfeaturedimage.png","categories":["Spotlight","Verbatims"],"tags":{"10608":"bloom","23938":"earthquake","9765":"multimedia","23940":"napa","8939":"palo alto","23939":"reaction","9106":"sleep","9201":"verbatim"}},{"id":72895,"title":"Freshmen to elect Associated Student Body officers","permalink":"http:\/\/palyvoice.com\/2014\/08\/27\/freshmen-to-elect-associate-student-body-officers\/","content":"<p>Voting for this year's Palo Alto High School freshmen Associated Student Body officers begins today and will continue on through the end of school on Friday.<\/p>\r\n<p>Freshmen can vote online <a href=\"http:\/\/vote.tallyspace.com\/vote\/list\/pahs\" target=\"_blank\">here<\/a> all day starting today. Voting stations with Chromebooks will also be set up during lunch today and tomorrow on the Quad, according to Student Activities Director Matt Hall.<\/p>\r\n<p>Freshman Jaiveer Sandhu is running for class president, while freshmen Claire Billman and Noah Yuen are running for vice president.<\/p>\r\n<p>According to Hall, there are fewer candidates than last year.<\/p>\r\n<p>\"As to why the numbers have dropped, it's hard to pin down,\" Hall said. \"Election numbers often cycle up and down over the years, so this may be just that.\"<\/p>\r\n<p>The uncontested presidential candidate Sandhu said in his <a href=\"https:\/\/www.youtube.com\/watch?v=A5Dr31OnEzE\" target=\"_blank\">candidate speech video<\/a> that his participation in middle school student government gives him the necessary experience to be class president.<\/p>\r\n<p>\"As freshman president, I'll use my years of experience to work towards more class spirit, class unity and to represent everyone's voice,\" Sandhu said.<\/p>\r\n<p>Billman compared herself to a supportive wingman in <a href=\"https:\/\/www.youtube.com\/watch?v=krqy0MCwjZw\" target=\"_blank\">her speech<\/a>.<\/p>\r\n<p>\"Although I won't be helping you pick up girls, I'll be fighting as hard as I can for you – each and every one of you – because I know what all of us need to get through this together, and I will stop at nothing to make it happen,\" Billman said.<\/p>\r\n<p>In <a href=\"https:\/\/www.youtube.com\/watch?v=ifO0lldspT0\" target=\"_blank\">Yuen's speech<\/a>, he stressed the importance of uniting the freshman class.<\/p>\r\n<p>\"I not only understand that we're entering this mysterious path known as freshman year, but I know how to make it less mysterious for us, as well,\" Yuen said. \"The key to this, besides electing me as your VP, is unity.\"<\/p>\r\n<p>According to Hall, the election results will be announced Friday evening after verification by Hall and the faculty.<\/p>\r\n","excerpt":"Voting for this year's Palo Alto High School freshmen Associated Student Body officers begins today and will continue on through the end of school on Friday.","date":"2014-08-27 11:19:05","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo1.jpg","categories":["News"],"tags":{"8496":"ASB","23934":"class president","23933":"freshmen elections"}},{"id":72871,"title":"School board discusses goals for academic year","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/school-board-discusses-goals-for-academic-year\/","content":"[caption id=\"attachment_72885\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/boardmeeting8-26.png\"><img class=\"wp-image-72885\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/boardmeeting8-26.png\" alt=\"boardmeeting8-26\" width=\"600\" height=\"340\" \/><\/a> PAUSD school board officials discuss plans for the new school year in a screenshot of the live stream of the school board meeting Tuesday night. Screenshot by Takaaki Sagawa.[\/caption]\r\n\r\nThe Palo Alto Unified School District Board of Education announced plans earlier tonight to improve education, school environment and academic assistance for the 2014-15 school year during a school board meeting at the PAUSD district office.\r\n\r\nAt the meeting, the board presented five goals to the community, all with an emphasis on improving the education and the environment of Palo Alto schools through governance and communication.\r\n\r\nThe new PAUSD superintendent Max McGee said the board intends to focus on the overall improvement of curricula.\r\n\r\n“There’s one [goal] about consistency, high quality and fairness in curriculum, instruction and assessment,” McGee said. “I’ve heard this [complaint] from students, and I’ve only been here three weeks.”\r\n\r\nThe board also aims to prioritize an action plan to provide individualized academic assistance through equitable opportunities for all students who are preparing for post-high school life.\r\n\r\n“We want to make sure that all of our students have nothing but the best education we can provide,” McGee said. “This goes for resources and assistance. … We want all our students to think college-bound and beyond college.”\r\n\r\nAdditionally, the board wants to ensure a safe environment for all enrolled in PAUSD, according to Associate Superintendent Charles Young.\r\n\r\n“I believe that the initiative that we will be focusing our efforts on this year [is] fostering personal development in health of students through social, emotional, behavioral and physical supports and services,” Young said.\r\n\r\nMcGee also stressed the importance of the district’s unity while still promoting individual school growth.\r\n\r\n“The big general themes are balancing a district mission and vision but still giving schools the opportunity to innovate, to incubate ideas,” McGee said. “So it’s a balance. It’s like helping a collective community versus a collection of communities.”\r\n\r\nIn order to more clearly communicate with residents, the district plans to ask the community directly of its concerns.\r\n\r\n“We’re holding a lot of outreach events to understand and listen,” McGee said. “We want to hear what’s on your mind, so we’re holding ourselves accountable for that.”\r\n\r\nThe district also intends to promote transparency to keep everyone informed on all of its progress.\r\n\r\n“The second measurable is to create a baseline of positive, neutral and negative media reports related to the district,” McGee said. “My experience is that generally, organizations that are seen as open, responsible, proactive and forthright have fewer negative reports. We want to create this baseline so we can look month after month, year after year to see how we’re doing.”\r\n\r\nThe goals presented earlier tonight will be reviewed periodically throughout the school year by the school board, according to McGee.\r\n\r\n“Each of those [goals] have some measures and deliverables,” McGee said. “We’ll be bringing these goals back to the board quarterly to review to make sure we get the job done.”","excerpt":"The Board of Education discussed measures and deliverables for the 2014-15 academic year at the first school board meeting.","date":"2014-08-26 23:45:07","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/boardmeeting8-26.png","categories":["News","Spotlight"],"tags":{"23909":"2014-2015","23906":"academic year","23907":"assistance","11799":"Board of Education","8604":"college","23932":"first meeting","23905":"goals","10043":"meeting","9069":"School Board","9129":"student","9152":"teachers","23910":"transparency","23908":"tutor"}},{"id":72874,"title":"Freshman class elections start Aug. 27, vote at paly.io\/vote2018","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/freshman-class-elections-start-aug-27-vote-at-paly-iovote2018\/","content":"","excerpt":"","date":"2014-08-26 21:29:28","author":"Charles Yu","categories":["Ticker"],"tags":[]},{"id":72812,"title":"Season preview: Girls&#8217; volleyball welcomes new head coach","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/season-preview-girls-volleyball-welcomes-new-head-coach\/","content":"[caption id=\"attachment_72814\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg\"><img class=\"size-full wp-image-72814\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg\" alt=\"Desiderio discusses goals for the day’s practice with the team. Photo by Amy Leung. \" width=\"600\" height=\"400\" \/><\/a> Desiderio discusses goals for the day’s practice with the team. Photo by Amy Leung.[\/caption]\r\n\r\nPalo Alto High School girls’ volleyball team is preparing for its first preseason game on Sept. 9 as it adapts to a different style with a new head coach.\r\n\r\nLast season, the team lost head coach Dave Winn and graduated seniors Keri Gee, Lauren Kerr, Sarah Limb and Becca Raffel.\r\n\r\nAfter coaching eight successful seasons and clinching two state championships, Winn stepped down from his position when he was offered the varsity coach position at Mountain View High School in his hometown.\r\n\r\nThe girls’ volleyball team went 25-11 overall and 8-4 in league last year. Its season ended at the Norcal Semifinals with a loss to Granite Bay, the team that would eventually go on to win the California Interscholastic Federation (CIF) State Championship.\r\n\r\n“Dave did a lot for the Paly volleyball program, so I know we’re all thankful for him and we’ll miss him a lot,” junior middle blocker Claire Dennis said.\r\n\r\nThe new head coach, Daniele Desiderio, has over two decades of playing experience. He was the second youngest player in history to join the professional Italian National League at age 16. After a successful career on the team, Desiderio said he went on to play in the International League, playing for seven different countries including Japan, Spain and Iran.\r\n\r\nWith this extensive amount of experience on his résumé, Desiderio has a lot to bring to Paly’s volleyball team, according to Dennis.\r\n\r\n“He’s a different type of coach than we’ve had before,” Dennis said. “He’s talked a lot about small details and improving those. … I think that’s a very important thing to go from a good player to a great player.”\r\n\r\nBecause Desiderio recognizes that this is a transition year, he decided to take on a relatively larger team of 18 players versus last year's already large 16 members.\r\n\r\n“We had so many seniors and juniors and players already on this team,” Desiderio said. “These players were part of this program, and I didn’t want to be the one putting them outside.”\r\n\r\nHowever, Desiderio hopes to take younger rising varsity athletes and use the freshmen and junior varsity teams to train them to play with the medley of styles that Desiderio learned throughout his professional career.\r\n\r\n“I would like to have more freshmen on the team in the future,” Desiderio said. “I will be responsible for all of the program and will try to fix fundamentals so [players] will arrive at the varsity level and it will be easy for them to play and be inside our system.”\r\n\r\nIn addition, Desiderio intends to have all the girls improve through the season by giving everyone the opportunity to play.\r\n\r\n“All the players that were in the tryouts, they will play this season,” Desiderio said. “Some on varsity, some of them somewhere else. We plan to have them play more.\"\r\n\r\nAfter just five days of tryouts, Desiderio already sees potential in the varsity team.\r\n\r\n“I saw a lot of them have a lot of great effort and try to apply everything I coach them,” Desiderio said. “I’m pretty sure we will have a good season overall because the players show me a great attitude and effort.”\r\n\r\nVarsity assistant coach Jekara Wilson-Gaines also noted the team’s improvement under Desiderio’s instruction.\r\n\r\n“I’m most looking forward to seeing how the girls thrive under his guidance,” Wilson-Gaines said. “I feel a lot of players, if not all, will improve and have fun while doing so.”\r\n\r\nDennis expressed similar sentiments about the upcoming season.\r\n\r\n“[Senior] Jade [Schoenberger] is going to be a big contributor, and [senior] Anna [Dukovic] as well,” Dennis said. “[Sophomore] Jess [Lee] is really exciting because she had to step up a lot last year and I know that she’s ready for it this year.”\r\n\r\nSenior outside hitter Anna Dukovic has an outlook of friendly competition on the situation.\r\n\r\n“I look forward to playing Dave’s [Mountain View] team,” Dukovic said, “and hopefully beating them.”\r\n\r\nThe Vikings will play their first preseason away game at 6:30 p.m. on Sept. 9 at Leland High School.","excerpt":"The Palo Alto High School's girls' volleyball team prepares to enter the season under the training of a new head coach.","date":"2014-08-26 19:23:20","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg","categories":["Sports","Spotlight"],"tags":{"12701":"2014","23661":"daniele","23662":"desiderio","8693":"Fall","12043":"new coach","9216":"volleyball"}},{"id":72859,"title":"Parking passes being sold to seniors in Auditor&#8217;s Office, enforcement begins Sept. 24","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/parking-passes-being-sold-to-seniors-in-auditors-office-enforcement-begins-sept-24\/","content":"","excerpt":"","date":"2014-08-26 18:50:47","author":"Maddy Jones","categories":["Ticker"],"tags":[]},{"id":72852,"title":"Alternative schedule Friday, Aug. 29, school ends early with no first or seventh period","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/alternative-schedule-friday-aug-29-school-ends-early-with-no-first-or-seventh-period\/","content":"","excerpt":"","date":"2014-08-26 18:50:27","author":"Maddy Jones","categories":["Ticker"],"tags":[]},{"id":72848,"title":"Community service hours for transcripts and President&#8217;s Award due Aug. 29","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/community-service-hours-for-transcripts-and-presidents-award-due-aug-29\/","content":"","excerpt":"","date":"2014-08-26 17:34:32","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","23889":"president's award","23890":"volunteer hours"}},{"id":72841,"title":"Verbatim: Freshmen reactions to Paly","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/verbatim-freshmen-reactions-to-paly\/","content":"The Paly Voice asks the Freshman Class of 2018 about its first impressions of Palo Alto High School.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/wWsEPYit78M\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asks the Freshman Class of 2018 about its first impressions of Palo Alto High School.","date":"2014-08-26 16:19:04","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-26-at-4.18.52-PM.png","categories":["Spotlight","Verbatims"],"tags":{"24174":"2018","24173":"class of 2018","8721":"freshmen","24172":"freshmen reactions","24175":"julia asin","9201":"verbatim"}}]