[{"id":76175,"title":"APPetite blog: Heads Up!","permalink":"http:\/\/palyvoice.com\/2014\/11\/03\/appetite-blog-heads-up\/","content":"<em>Here is the third installment of APPetite featuring \"Heads Up!\" Read our blog to discover great games and other apps available in Apple’s App Store. We will cover apps ranging from retrofitted classic games to useful productivity apps. Check in each week to fulfill your hunger for a new addictive app fix!<\/em>\r\n\r\nMouse over the stars on the infographic below to learn more about \"Heads Up!\"\r\n<iframe src=\"\/\/www.thinglink.com\/card\/578831857039179777\" width=\"419\" height=\"455\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<strong>Heads Up!<\/strong>\r\n<strong>Price: 99 cents<\/strong> <strong>on App Store and FREE on Google Play<\/strong>\r\n<strong>In-App Purchases: Extra decks are available (99 cents each) <\/strong>\r\n<strong>Available: App Store, Google Play<\/strong>\r\n<strong>Rank: 4.5\/5<\/strong>\r\n<strong>Why you should download: \"<del><\/del>Heads Up!\" is a fun twist on charades and provides hours of laughter.\r\n<\/strong>\r\n\r\nCan you guess this word from these hints?\r\n\r\n1) The holiday that worships a bunny.\r\n\r\n2) Colorful plastic eggs.\r\n\r\n3) Lots of chocolate and candy.\r\n\r\nIf you guessed Easter you are going to love \"Heads Up!\"\r\n\r\n\"Heads Up!\" is a modern spin on charades and one of my favorite games. It is very intuitive to play as well. Just pick a category like \"Animals Gone Wild\" or \"Superstars\" and start guessing. \"Heads Up!\" requires at least two players, but can include as may people as you want. One player is the designated guesser and places the mobile device on their forehead. The other players act out or describe the word displayed. Tilt up for correct answers and tilt down to pass. At the end of the minute, the app shows which words the person got right and wrong. During the game, \"Heads Up!\" uses the front-facing camera to record the round, and at the end,  you can replay it for laughs.\r\n\r\n\"Heads Up!\" also offers extra category decks for 99 cents such as \"Movie Buff\" and \"Superheroes.\" I bought one extra deck \"Wish You Were Here\" that had famous cities and locations. Although it was fun, I'm not sure it was worth the money. The included decks are more than enough for hours of entertainment.\r\n\r\nMy personal favorite deck is \"Act It Out\" where you are only allowed to use gestures to describe the words. It is always super funny to watch and fun to act out.\r\n\r\nI rate it two thumbs and one \"Heads Up!\"\r\n\r\n&nbsp;","excerpt":"Here is the third installment of APPetite featuring Heads Up! Read our blog to discover great games and other apps available in Apple’s App Store. Check in each week to fulfill your hunger for a new addictive app fix!","date":"2014-11-03 14:07:41","author":"Liana Pickrell","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/appetite.jpg","categories":["APPetite","Entertainment"],"tags":{"29416":"APPetite","29997":"appstore","29478":"blog","8793":"iphone"}},{"id":78076,"title":"Students celebrate San Francisco Giants&#8217; win in World Series","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/students-celebrate-san-francisco-giants-win-in-world-series\/","content":"[caption id=\"attachment_78078\" align=\"alignnone\" width=\"535\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png\"><img class=\"wp-image-78078\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png\" alt=\"Screen Shot 2014-11-02 at 11.16.47 AM\" width=\"535\" height=\"402\" \/><\/a> San Francisco Giants players Buster Posey and Santiago Casilla stand on top of a double-decker bus at the Giants parade that traveled from Market Street to the Civic Center on Friday. The parade was held in honor of the season and the Giants' third World Series championship in five years. Although it was raining at the parade, no spirits were dampened. \"The parade was so fun despite the rain,\" Palo Alto High School senior Priscilla Bell said. Photo by Priscilla Bell.[\/caption]\r\n\r\nPalo Alto High School students express their excitement for the San Francisco Giants' third World Series win in five years by attending the rain-soaked streets of San Francisco for a parade on Friday.\r\n\r\n“It was just magical the way everything came together to get them into the World Series,” said junior Nikhil Rajaram, who was not able to attend the parade. “It's just great to be able to grow up in a time where we have as great a local baseball team as we do.”\r\n\r\nThe parade that began on Market Street and ended at the Civic Center celebrated the Giants' season and their championship. In the victory game on Thursday, which was led by the pitcher and World Series Most Valuable Player Madison Bumgarner, the Giants took Game seven of the 2014 World Series on the road against the Kansas City Royals by a score of 3-2.\r\n\r\nThe Giants now have established what many consider a dynasty: three World Series wins in five seasons: 2010, 2012 and 2014. Although he did not attend the parade, senior Galen Byrd is excited about the Giants being able to win so many World Series championships in such a small period of time.\r\n\r\n“It is just exciting to be watching history unfold in front of our eyes,” Byrd said. “I think a lot of kids don't understand how rare it is to win a championship in any major league sport, so to have won three in five years is just crazy.”\r\n\r\nSenior Priscilla Bell, a passionate Giants fan, attended the rainy and confetti-filled parade in 2010, 2012 and 2014.\r\n\r\n“There were so many people, and we all kept cheering,” Bell said. “All the players were on top of double-decked buses and waving.”\r\n\r\nDespite the rain, Bell managed to have a great time.\r\n\r\n“It [the parade] was just about embracing being there and [being] around everyone else who is a massive Giants fan, and [I was] so happy to be there,” Bell said.\r\n\r\nThe parade celebrated the legendary game that had Tim Hudson as the starting pitcher, the oldest pitcher ever to start a Game seven in the World Series. He ran into trouble in the second inning after an RBI [runs batted in] double and a sacrifice fly. This forced manager Bruce Bochy to bring in left-handed reliever Jeremy Affeldt to take his place. Affeldt responded by pitching 2.1 scoreless innings of relief, setting the stage for Bumgarner in the fifth inning with the Giants leading 3-2.\r\n\r\nBumgarner was named the MVP of the series after setting an Major League Baseball record for most innings pitched in a single postseason. His relief appearance in Game seven, five shutout innings, came just three days after he threw 117 pitches while throwing a complete-game shutout in Game 5 on Sunday.\r\n\r\n“I've been a Giants fan since I can remember, and it's always nice to see a Bay Area team win something so amazing,” junior Maddy Atwater said.","excerpt":"Many San Francisco Giants fans from Palo Alto lined up on the rain-soaked streets of San Francisco on Friday to celebrate the San Francisco Giants' third win in the World Series in five years.","date":"2014-11-02 20:39:23","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-11.16.47-AM.png","categories":["Sports"],"tags":{"31867":"buster posey","31864":"civic center","8732":"giants","31866":"kansas city royals","31865":"market street","9655":"San Francisco Giants","31868":"santiago casilla","9239":"world series"}},{"id":77397,"title":"Spirit Week Final Results","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/spirit-week-final-results\/","content":"The seniors won both the Spirit Dance and best float on Day Five of Spirit Week, which allowed them to beat the juniors. Despite their lead throughout the week, the juniors came in 71 points behind the seniors. View official scores on ASB's <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">website<\/a>.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/3168737-spirit-week-2014-day-5\" width=\"600\" height=\"933\" frameborder=\"0\" scrolling=\"no\"><\/iframe>","excerpt":"The senior class wins Spirit Week 2014. ","date":"2014-11-02 12:39:18","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/gatsby.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","31233":"final results","30978":"results","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78074,"title":"Main Office to collect Spirit Week outfit donations from Nov. 3 to Nov. 7","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/spirit-week-outfit-donations-to-be-collected-from-nov-3-to-nov-7-in-the-main-office\/","content":"","excerpt":"","date":"2014-11-02 10:25:48","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8596":"clothes","31863":"costumes","8651":"donations","30835":"outfits","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78070,"title":"Election Day on Nov. 4, polls open from 7 a.m. to 8 p.m.","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/election-day-on-nov-4-poll-open-from-7-a-m-to-8-p-m\/","content":"","excerpt":"","date":"2014-11-02 10:19:55","author":"Lizzie Chun","categories":["Ticker"],"tags":{"31862":"election day","8667":"elections","31861":"local election"}},{"id":77769,"title":"Video: Spirit Dance 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/02\/video-spirit-dance-2014\/","content":"This year’s Spirit Week came to its grand finale this Friday with an after-school rally showcasing each class's float and Spirit Dance. The senior class, winners of the best dance performance, performed at halftime during the Homecoming football game. For the first time, the Spirit Dances were performed on both the track and the field and the previous restriction on a maximum number of participants was lifted. Check out the full performances below. See The Paly Voice's complete Spirit Week coverage <a href=\"http:\/\/palyvoice.com\/spiritweek-2014\/\">here<\/a>.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/N86D_nPi59w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/H9qDaRY_qlE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/vOnqlQXsqPI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/SSjvFXbjXKI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Watch this year's Spirit Dances.","date":"2014-11-02 01:20:27","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-02-at-12.55.52-AM.png","categories":["Multimedia","Spirit Week 2014","Video"],"tags":{"12701":"2014","8626":"dance","9779":"dances","9795":"freshman","8726":"gatsby","31062":"great gatsby","31771":"juiors","30873":"lion king","30851":"pirates","30844":"red card","9090":"seniors","9114":"Sophomores","9780":"spirit dance","9119":"Spirit Week","31860":"world cup"}},{"id":77969,"title":"Slideshow: Spirit Dances","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/slideshow-spirit-dances\/","content":"At the final Spirit Week 2014 rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school. The Associated Student Body <a href=\"https:\/\/twitter.com\/palyASB\/status\/528338947512872960\" target=\"_blank\">tweeted<\/a> later that evening that the seniors' dance won first place. The rest of the scores from Day Five will be released at Homecoming tonight and on ASB's <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\" target=\"_blank\">website<\/a>.\r\n\r\n[slideshow post_id=77969]","excerpt":"At the final Spirit Week rally yesterday, Palo Alto High School students participated in their respective class' Spirit Dance on the football field after school.","date":"2014-11-01 20:52:54","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/pappas.jpg","categories":["Spirit Week 2014"],"tags":{"29391":"georgeluphotography","31770":"last rally","8953":"paly","9107":"slideshow","9780":"spirit dance","31769":"spirit dances","9119":"Spirit Week","27181":"spirit week 2014"}},{"id":78006,"title":"Liveblog: Homecoming 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/liveblog-homecoming-2014\/","content":"[liveblog]","excerpt":" Read for live updates about the Homecoming Dance.","date":"2014-11-01 18:30:01","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/20141101_2143251.jpg","categories":["Uncategorized"],"tags":{"8626":"dance","9781":"homecoming","8855":"liveblog"}},{"id":77785,"title":"Day Five Recap: Rain does not stop Spirit Week","permalink":"http:\/\/palyvoice.com\/2014\/11\/01\/day-five-recap-rain-does-not-stop-spirit-week\/","content":"[caption id=\"attachment_77797\" align=\"alignnone\" width=\"550\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10743719_10204702638793525_1404602102_n.jpg\"><img class=\"wp-image-77797\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10743719_10204702638793525_1404602102_n.jpg\" alt=\"Juniors Clara Wolfe, Rachel Selingson, Emma Scott and Aiva Petriceks pose as Griffin Carlson jumps of the float. Photo by George Lu.\" width=\"550\" height=\"366\" \/><\/a> Juniors Clara Wolfe, Rachel Selingson, Emma Scott and Aiva Petriceks pose as Griffin Carlson jumps of the float. Photo by George Lu.[\/caption]\r\n\r\nThe rain did not stop Palo Alto High School students from competing in the final two rallies on Day Five of Spirit Week.\r\n\r\nThe lunch rally was held in the rain, but there was still a huge turnout from all grades. However, due to the weather, the \"Mummy Game\" had to be canceled because it required the use of paper. The freshmen won the second game \"Pumpkin Bowling,\" and there was a three-way tie for second.\r\n\r\nAccording to students, Spirit Commissioners Emma Cole and Ariya Momeny handled the situation perfectly despite the difficulties brought upon by the rain.\r\n\r\n“I felt that the planning committee did a good job adapting to the circumstances,” sophomore Naveen Pai said. “Things would have been too chaotic if the rally was moved to the gym.”\r\n\r\nPaly students thought that the rain added to Spirit Week and made it more exciting.\r\n\r\n“I loved getting soaked with everyone during the rally while we cheered for our class,” senior dance member Johnny Lee said.\r\n\r\nPai agrees with Lee.\r\n\r\n“It was a cool experience to be out in the rain with the rest of my class even if that meant one game had to be canceled,\"Pai said.\r\n\r\nThe rain stopped just in time for the floats to be displayed and the dancers to perform for students, parents and staff during the after-school rally.\r\n\r\n“Paly's spirit was clearly noticeable, and the atmosphere was electric,” Pai said.\r\n\r\nThe seniors won best dance and gained the privilege to perform their dance at the halftime of the Homecoming football game.\r\n\r\nCheck back to The Paly Voice for scores.","excerpt":"The rain did not stop Palo Alto High School students from competing in the final two rallies on Day Five of Spirit Week.","date":"2014-11-01 17:27:03","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/juniorconfetti.jpg","categories":["Spirit Week 2014"],"tags":[]},{"id":77962,"title":"Editorial: Spirit Week should be about unity","permalink":"http:\/\/palyvoice.com\/2014\/10\/31\/editorial-spirit-week-should-be-about-unity\/","content":"This week, Palo Alto High School students are participating in the annual tradition of Spirit Week. This is the third year since the Associated Student Body introduced a new Spirit Week scoring policy in order to ensure fairness among classes and supposedly remove senior class-favoritism. With juniors currently in the lead and seniors trailing behind, the plausibility for a junior win during Spirit Week becomes more and more apparent. The tension between the classes has escalated to the point where the essence of Spirit Week is eclipsed.\r\n\r\nOver the past years, students have grown to become more preoccupied with earning the championship title rather than just having fun and enjoying the week. Both inter- and intra-class drama and petty disputes have become an all too familiar part of Spirit Week.\r\n\r\nASB’s intentions to create a fairer Spirit Week are inherently good, but the reality of a non-senior win has perverted the true meaning behind Spirit Week — an event to bring classes together in support of Paly as a school. In recent years, instead of unifying the student body, this change has caused heightened tensions between classes, one especially evident this year between the junior and senior classes. Students’ focus on winning Spirit Week has caused a rivalry to the extent that it generates an almost unhealthy competitiveness among the student body.\r\n\r\nRigged or not, Spirit Week should be about coming together as a community and having fun. Instead of pitting the classes against each other, ASB should incorporate joint-class activities and encourage cross-class collaboration. The fault at hand is not only of ASB, but of each and every student. The Paly Voice acknowledges and supports the competitive nature of Spirit Week; however, we believe that in order to preserve the integrity of the week, students should tone down the level of competitiveness. Under these newly revised scoring criteria, the student body as a whole should bring Spirit Week back to its roots: a time for togetherness and appreciation for Paly.\r\n\r\n&nbsp;","excerpt":"As a heated Spirit Week comes to a close, The Paly Voice urges for the Paly community to bring Spirit Week back to its roots by promoting unity and Paly pride instead of unhealthy competition.","date":"2014-10-31 23:56:48","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-31-at-11.57.40-PM.png","categories":["Editorial","Spotlight"],"tags":{"12701":"2014","19460":"2015","31768":"2016","31764":"appreciation","8496":"ASB","31767":"dispute","8654":"drama","8816":"junior","31766":"rivalry","31765":"roots","9119":"Spirit Week","27181":"spirit week 2014","31763":"togetherness","31762":"unity"}}]