[{"id":72812,"title":"Season preview: Girls&#8217; volleyball welcomes new head coach","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/season-preview-girls-volleyball-welcomes-new-head-coach\/","content":"[caption id=\"attachment_72814\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg\"><img class=\"size-full wp-image-72814\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg\" alt=\"Desiderio discusses goals for the day’s practice with the team. Photo by Amy Leung. \" width=\"600\" height=\"400\" \/><\/a> Desiderio discusses goals for the day’s practice with the team. Photo by Amy Leung.[\/caption]\r\n\r\nPalo Alto High School girls’ volleyball team is preparing for its first preseason game on Sept. 9 as it adapts to a different style with a new head coach.\r\n\r\nLast season, the team lost head coach Dave Winn and graduated seniors Keri Gee, Lauren Kerr, Sarah Limb and Becca Raffel.\r\n\r\nAfter coaching eight successful seasons and clinching two state championships, Winn stepped down from his position when he was offered the varsity coach position at Mountain View High School in his hometown.\r\n\r\nThe girls’ volleyball team went 25-11 overall and 8-4 in league last year. Its season ended at the Norcal Semifinals with a loss to Granite Bay, the team that would eventually go on to win the California Interscholastic Federation (CIF) State Championship.\r\n\r\n“Dave did a lot for the Paly volleyball program, so I know we’re all thankful for him and we’ll miss him a lot,” junior middle blocker Claire Dennis said.\r\n\r\nThe new head coach, Daniele Desiderio, has over two decades of playing experience. He was the second youngest player in history to join the professional Italian National League at age 16. After a successful career on the team, Desiderio said he went on to play in the International League, playing for seven different countries including Japan, Spain and Iran.\r\n\r\nWith this extensive amount of experience on his résumé, Desiderio has a lot to bring to Paly’s volleyball team, according to Dennis.\r\n\r\n“He’s a different type of coach than we’ve had before,” Dennis said. “He’s talked a lot about small details and improving those. … I think that’s a very important thing to go from a good player to a great player.”\r\n\r\nBecause Desiderio recognizes that this is a transition year, he decided to take on a relatively larger team of 18 players versus last year's already large 16 members.\r\n\r\n“We had so many seniors and juniors and players already on this team,” Desiderio said. “These players were part of this program, and I didn’t want to be the one putting them outside.”\r\n\r\nHowever, Desiderio hopes to take younger rising varsity athletes and use the freshmen and junior varsity teams to train them to play with the medley of styles that Desiderio learned throughout his professional career.\r\n\r\n“I would like to have more freshmen on the team in the future,” Desiderio said. “I will be responsible for all of the program and will try to fix fundamentals so [players] will arrive at the varsity level and it will be easy for them to play and be inside our system.”\r\n\r\nIn addition, Desiderio intends to have all the girls improve through the season by giving everyone the opportunity to play.\r\n\r\n“All the players that were in the tryouts, they will play this season,” Desiderio said. “Some on varsity, some of them somewhere else. We plan to have them play more.\"\r\n\r\nAfter just five days of tryouts, Desiderio already sees potential in the varsity team.\r\n\r\n“I saw a lot of them have a lot of great effort and try to apply everything I coach them,” Desiderio said. “I’m pretty sure we will have a good season overall because the players show me a great attitude and effort.”\r\n\r\nVarsity assistant coach Jekara Wilson-Gaines also noted the team’s improvement under Desiderio’s instruction.\r\n\r\n“I’m most looking forward to seeing how the girls thrive under his guidance,” Wilson-Gaines said. “I feel a lot of players, if not all, will improve and have fun while doing so.”\r\n\r\nDennis expressed similar sentiments about the upcoming season.\r\n\r\n“[Senior] Jade [Schoenberger] is going to be a big contributor, and [senior] Anna [Dukovic] as well,” Dennis said. “[Sophomore] Jess [Lee] is really exciting because she had to step up a lot last year and I know that she’s ready for it this year.”\r\n\r\nSenior outside hitter Anna Dukovic has an outlook of friendly competition on the situation.\r\n\r\n“I look forward to playing Dave’s [Mountain View] team,” Dukovic said, “and hopefully beating them.”\r\n\r\nThe Vikings will play their first preseason away game at 6:30 p.m. on Sept. 9 at Leland High School.","excerpt":"The Palo Alto High School's girls' volleyball team prepares to enter the season under the training of a new head coach.","date":"2014-08-26 19:23:20","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0115.jpg","categories":["Sports","Spotlight"],"tags":{"12701":"2014","23661":"daniele","23662":"desiderio","8693":"Fall","12043":"new coach","9216":"volleyball"}},{"id":72859,"title":"Parking passes being sold to seniors in Auditor&#8217;s Office, enforcement begins Sept. 24","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/parking-passes-being-sold-to-seniors-in-auditors-office-enforcement-begins-sept-24\/","content":"","excerpt":"","date":"2014-08-26 18:50:47","author":"Maddy Jones","categories":["Ticker"],"tags":[]},{"id":72852,"title":"Alternative schedule Friday, Aug. 29, school ends early with no first or seventh period","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/alternative-schedule-friday-aug-29-school-ends-early-with-no-first-or-seventh-period\/","content":"","excerpt":"","date":"2014-08-26 18:50:27","author":"Maddy Jones","categories":["Ticker"],"tags":[]},{"id":72848,"title":"Community service hours for transcripts and President&#8217;s Award due Aug. 29","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/community-service-hours-for-transcripts-and-presidents-award-due-aug-29\/","content":"","excerpt":"","date":"2014-08-26 17:34:32","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","23889":"president's award","23890":"volunteer hours"}},{"id":72841,"title":"Verbatim: Freshmen reactions to Paly","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/verbatim-freshmen-reactions-to-paly\/","content":"The Paly Voice asks the Freshman Class of 2018 about its first impressions of Palo Alto High School.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/SliyE9sOIiw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asks the Freshman Class of 2018 about its first impressions of Palo Alto High School.","date":"2014-08-26 16:19:04","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-26-at-4.18.52-PM.png","categories":["Spotlight","Verbatims"],"tags":[]},{"id":72780,"title":"Slideshow: Back-to-school rally","permalink":"http:\/\/palyvoice.com\/2014\/08\/26\/slideshow-back-to-school-rally-2\/","content":"The back-to-school rally took place on the Quad on Friday during lunch. Check out the highlights from the festivities.\r\n\r\n[slideshow post_id=72780]\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The back-to-school rally took place on the Quad on Friday during lunch. Check out the highlights from the festivities.","date":"2014-08-26 13:55:43","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2461.jpg","categories":["Multimedia","Spotlight"],"tags":{"23161":"cheer team","23160":"dance team","9789":"friday rally","8859":"lunchtime rally","23159":"pep rally"}},{"id":72789,"title":"New buildings officially in use for 2014-15 school year","permalink":"http:\/\/palyvoice.com\/2014\/08\/25\/new-buildings-officially-in-use-for-2014-15-school-year\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_72795\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2351.jpg\"><img class=\"wp-image-72795\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2351.jpg\" alt=\"Students enjoy the new, modern furniture of the Media Arts Center. Photo by Adele Bloch.\" width=\"600\" height=\"400\" \/><\/a> Students enjoy the new, modern furniture of the Media Arts Center. Photo by Adele Bloch.[\/caption]\r\n\r\nAfter over six years of planning, the Media Arts Center and the combined Social Science and Math buildings are officially in use for Palo Alto High School’s 2014-15 school year.\r\n\r\nBoth buildings are accessible to students regularly, providing them with a contrasting setting and environment to other buildings on campus. The buildings are two-storied, and each offer new hang-out spots and furniture to Paly students.\r\n\r\nHistory teacher and Paly alumnus Steve Foug admires the new buildings and looks forward to teaching his students in the updated classrooms.\r\n\r\n“I really like the newness of everything,” Foug said. “I was telling the kids in my class, ‘You know that moment when you get an iPhone and you peel that plastic off of it when its brand new? There’s that nice feeling to it.’”\r\n\r\nEach building has been designed to showcase modern features, such as new computers, elevators and glassy windows. According to Foug, the history building lets in more natural light and is much more central to campus than the previous building he was acquainted with.\r\n\r\nThe area outside of the new social science building has become a frequent hang-out spot for many students, according to Foug.\r\n\r\n“I’ve already noticed a congregation area in front of the math and history building,” Foug said.\r\n\r\nHowever, some students find the math and history building difficult to get to from their other classes, and thus do not want to spend their free time there.\r\n\r\n“I like how they’re open, but I don't like how they are so far away from everything,” senior Kabria Dame said.\r\n\r\nAccording to senior Charlene Zhu, the new buildings also have another drawback; the stairs can be an obstacle because of the heavy crowds and limited space, causing some students to worry about being late to class.\r\n\r\n“They [the stairs] do slow me down because so many people are trying to go up and down them at once, especially the ones in the front, but it’s just a small annoyance,” Zhu said.\r\n\r\nHowever, some students are still very optimistic about the new building, regardless of the stairs.\r\n\r\n“I feel like it’s not too big of an issue,” sophomore Nathaniel Hancock said. “The people with complaints probably try to walk up the stairs at the time of a huge crowd, but the stairs are normally pretty empty for me.”\r\n\r\nDespite the extra distance and occasionally inconvenient stairs, the open space of each building adds new opportunities for teachers and students, according to English teacher Craig Bark who uses the MAC as a second classroom.\r\n\r\nIn the first week of school, Bark had his students conduct interviews for a personality profile class assignment in the MAC, which provided a cozy environment for his students.\r\n\r\n“I let them use the MAC for interviews so that they are in a comfortable setting where they can spread out,” Bark said. “They can find a nice place to work with their friend, where it’s very relaxing.”\r\n\r\n[caption id=\"attachment_72796\" align=\"alignnone\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2348.jpg\"><img class=\"wp-image-72796\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2348.jpg\" alt=\"Students study at high-rise tables on the second floor of the Media Arts Center. Photo by Adele Bloch.\" width=\"500\" height=\"333\" \/><\/a> Students study at high-rise tables on the second floor of the Media Arts Center. Photo by Adele Bloch.[\/caption]\r\n\r\nJunior Aiva Petriceks enjoys spending her prep in the MAC because of the quiet work environment and spacious attributes.\r\n\r\n“There was a good amount of people in there [the MAC],” Petriceks said. “I can see it becoming one of the new places where everyone will go on rainy days.”\r\n\r\nThe proposition for the new buildings <a title=\"Paly to apply for $3 million media arts grant\" href=\"http:\/\/palyvoice.com\/2009\/09\/03\/node-21594\/\" target=\"_blank\">arose<\/a> in 2008 and construction began in 2011. The buildings officially opened last week.\r\n\r\nAfter coming to the MAC every day for classes and conferences during the first week of school, Bark says he already feels at home in the new building.\r\n\r\n“It’s not a row of seats in a classroom with somebody sitting behind you breathing down your neck,” Bark said. “It’s bean bags, it’s upstairs, it’s space.”\r\n\r\nAlthough other teachers have been able to make fairly quick transitions, Foug saysthat he needs more time to adjust to the new building since he had strong ties to his old classroom in the 300 building.\r\n\r\n“I was there [my old classroom] for 15 years,” Foug said. “All my old desks are gone. Those are some of the classrooms where I had history when I was a student. Everything doesn’t feel like home yet.”","excerpt":"&nbsp; After over six years of planning, the Media Arts Center and the combined Social Science and Math buildings are officially in use for Palo <a href=\"http:\/\/palyvoice.com\/2014\/08\/25\/new-buildings-officially-in-use-for-2014-15-school-year\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-08-25 20:21:46","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/IMG_2351.jpg","categories":["News","Spotlight"],"tags":{"23599":"charlene zhu","18366":"mac","11127":"media arts center","23598":"steve foug"}},{"id":72649,"title":"Slideshow: Media Arts ribbon-cutting highlights annual school picnic","permalink":"http:\/\/palyvoice.com\/2014\/08\/23\/slideshow-media-arts-ribbon-cutting-highlights-annual-school-picnic\/","content":"<p>The Palo Alto High School Parent Teacher Student Association hosted the annual Welcome-Back-to-School dinner on Thursday evening, featuring the ribbon-cutting ceremony for the new Media Arts Center, student performances and food trucks.<\/p>\r\n<p>Principal Kim Diorio, Paly journalism advisers Paul Kandell and Esther Wojcicki, former California State Senator Joe Simitian and Palo Alto Unified School District Board of Education President Barb Mitchell spoke during the ceremony.<\/p>\r\n<p>Each thanked the numerous people involved in the MAC project, including past Principal Jacqueline McEvoy, the boosters, previous advisers Ellen Austin and Mike McNulty, the Facilities Steering Committee, the school Board, Paly administration, the architects and various donors.<\/p>\r\n<p>According to Wojcicki, there will also be a three day-long grand opening of the MAC starting Oct 16.<\/p>\r\n<p>Arianna Huffington, founder of The Huffington Post, will attend the event on Oct. 16, and Paly alumnus James Franco will be there on Oct. 18, according to Wojcicki.<\/p>\r\n<p>Global Voices, which \"curate[s], verif[ies] and translate[s] trending news and stories you might be missing on the Internet, from blogs, independent press and social media in 167 countries,\" <a title=\"Global Voices\" href=\"http:\/\/globalvoicesonline.org\/about\/\" target=\"_blank\">according to its website<\/a>, will be there for a week and will be featured on Oct. 17.<\/p>\r\n<p>[slideshow post_id=72649]<\/p>\r\n","excerpt":"The Palo Alto High School Parent Teacher Student Association hosted the annual Welcome-Back-to-School dinner on Thursday evening, featuring the ribbon-cutting ceremony for the new Media Arts Center, student performances and food trucks.","date":"2014-08-23 10:16:26","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0091.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"22661":"back to school dinner","18366":"mac","11127":"media arts center","22663":"ribbon cutting","9107":"slideshow","22662":"welcome back to school"}},{"id":72651,"title":"Admin: Adam Paulson selected as new Dean of Students","permalink":"http:\/\/palyvoice.com\/2014\/08\/21\/admin-adam-paulson-selected-as-new-dean-of-students\/","content":"","excerpt":"","date":"2014-08-21 23:34:08","author":"Lizzie Chun","categories":["Ticker"],"tags":{"22665":"adam paulson","22666":"admin","22664":"dean of students","11237":"tosa"}},{"id":72640,"title":"Media Arts Center to receive grand opening","permalink":"http:\/\/palyvoice.com\/2014\/08\/21\/media-arts-center-to-receive-grand-opening\/","content":"[caption id=\"attachment_72645\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png\"><img class=\"size-full wp-image-72645\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png\" alt=\"A sign announcing the Welcome-Back-To-School Dinner hangs on a portable in the Quad. Photo by Emma Chiu.\" width=\"600\" height=\"318\" \/><\/a> A sign announcing the Welcome-Back-To-School Dinner hangs on a portable in the Quad. Photo by Emma Chiu.[\/caption]\r\n\r\nAfter about three years of construction, the grand opening of Palo Alto High School’s new Media Arts Center will be held late Thursday afternoon, before the annual Welcome-Back-to-School dinner.\r\n\r\nThe approximately 15-minute ceremony will begin at 5 p.m. at the MAC with an opening from Paly Principal Kim Diorio, followed by some words by Palo Alto Unified School District Board of Education President Barb Mitchell, according to head of Media Arts Boosters Debbie Crouch.\r\n\r\n“The Welcome-Back picnic is kind of what drove us to have the ribbon cutting at that time because we’d have a group of people on campus,” Crouch said.\r\n\r\nDiorio and Mitchell will thank members of the district office who were involved, the people who ran the construction project and the Brin-Wojcicki Foundation, which has <a title=\"Brin-Wojcicki Donation\" href=\"http:\/\/palyvoice.com\/2014\/03\/25\/foundation-donates-funds-for-media-arts-equipment\/\" target=\"_blank\">donated<\/a> around $80,000 for extra equipment in the building’s classrooms, computer lab, kitchen, atrium and more. The foundation’s donation was an icing on the cake to the $50,000 already raised by boosters, $10 million paid for by Measure A and a $2.7 million state Career-Technical Education grant the project won.\r\n\r\nAccording to Crouch, the ceremony will end with an official ribbon-cutting by Diorio, Crouch and others to officially complete the project that was kicked off by the passage of Measure A in June 2008. These representatives of the long-term project will even use official scissors for the occasion.\r\n\r\n“The boosters bought the big ceremonial scissors that are 38 inches tall so a lot of people can hold on to them,” Crouch said.\r\n\r\nAs an administrator who has been involved with the MAC project for quite some time, Diorio is enthusiastic about the opening of the building.\r\n\r\n“I’m really excited about this building and this space because I think it’s really innovative and creative in nature and in design,” Diorio said. “I think obviously it was built to showcase our media arts programs ... but I think it will be more than that. Not just a classroom space, but a space the whole school will benefit from because there’s a lot of smaller spaces within the building that people can go to [and] collaborate.”\r\n\r\nDiorio also anticipates the building to be used not just for classroom purposes, but for meetings and event hostings as well.\r\n\r\n“We’re gonna use it [the MAC] for staff meetings, [and] we’ll use that atrium area for a lot of events,” Diorio said. “I think the Media Arts boosters are working on lining up some different speakers. Because it can hold about 150-200 people, we can easily seat that, and that’s just on the ground floor.”\r\n\r\nTo continue the celebration of the MAC’s grand opening, the PTSA will be hosting the annual Welcome Back Dinner at the Quad. As a new experiment this year, the food will be provided entirely by food trucks.\r\n\r\n“We’ll cut the ribbon and then folks can do a couple of things,” said head of district public relations Tabitha Hurley Kappeler. “They can either go back over to the Quad where there will be the food trucks, or they can do tours [of the MAC].”\r\n\r\nAccording to Diorio, the event has used the same caterer for many years and the PTSA just wanted to do something a little different and a little more exciting.\r\n\r\n“She [ PTSA President Barb Schroeder] approached me back in the spring and said, ‘What if we did food trucks’ and I said ‘sure, let’s try it,’” Diorio said.\r\n\r\nAccording to the Paly Link bulletin email, the dinner will include Takoz Mod Mex-Mexican, Rice Rockit (Filipino\/Hawaiian Fusion) and Paddy Wagon Sliders. Lastly, Kona Ice-Shaved Ice will have a parking spot on the Quad to serve dessert.\r\n\r\nThe Welcome Back Dinner will also include a number of performances from student groups, including the dance and cheer teams, as well as Paly’s own band and choir.\r\n\r\n“Given the two new buildings being open and the food trucks and the student performances, it should be a fun night,” Dioro said.","excerpt":"After about three years of construction, the grand opening of Palo Alto High School’s new Media Arts Center will be held late Thursday afternoon, before <a href=\"http:\/\/palyvoice.com\/2014\/08\/21\/media-arts-center-to-receive-grand-opening\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-08-21 00:12:15","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png","categories":["News","Spotlight"],"tags":[]}]