[{"id":75054,"title":"Theatre program starts new ComedySportz team","permalink":"http:\/\/palyvoice.com\/2014\/10\/10\/theatre-program-starts-new-comedysportz-team\/","content":"[caption id=\"attachment_75291\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8527.jpg\"><img class=\"size-full wp-image-75291\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8527.jpg\" alt=\"Senior Will Kast plays with an air balloon during the improv troupe auditions.Photo by Emma Chiu\" width=\"600\" height=\"400\" \/><\/a> Senior Will Kast plays with an air balloon during the Improv Troupe auditions. Photo by Emma Chiu[\/caption]\r\n\r\nWho knew that the drama could be considered a sport?\r\n\r\nFor the first year ever, the Palo Alto High School Theatre Department will partake in competitive improvisation as part of its newly-created ComedySportz team, according to Paly Theatre instructor Kathleen Woods.\r\n\r\nComedySportz is a competitive improv comedy organization that exists at the high school, college and professional level .\r\n\r\n“The competitions actually have a referee, and one of the teams ends up winning the competition,” Woods said.\r\n\r\nBecause this is the Paly team’s first year, it will not compete regularly and instead participate in a total of two tournaments over the course of the entire school year, according to junior and two-year Improv Troupe member Zoe Limbrick.\r\n\r\n“It’s going to be two events on the weekend [per year], and it’s either going to be competitions … within the troupe or with other schools nearby,” Limbrick said. “We’re going to bring in professionals to teach us and work on our improv.”\r\n\r\nAccording to Woods, one of the competitions the team will likely partake in is a South Bay tournament in April.\r\n\r\nSenior Chris Hinstorff, a Voice staff member, created the team after meeting with an adult member from the <a title=\"San Jose ComedySportz\" href=\"http:\/\/comedysportzsanjose.com\/]\" target=\"_blank\">ComedySportz team in San Jose<\/a> at the Northern California Thespian Leadership Conference in September.\r\n\r\n“As part of his [Hinstorff’s] honors project as head of Paly’s Improv Troupe, he’s decided to take that additional step and have students train in ComedySportz,” Woods said.\r\n\r\n[caption id=\"attachment_75297\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8498.jpg\"><img class=\"size-full wp-image-75297\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8498.jpg\" alt=\"Sophomore Jason Pollak, junior Paul Bleich and sophomore Joey Kellison-Linn enjoy comedy sports in the Haymarket theater. Photo by Emma Chiu.\" width=\"600\" height=\"400\" \/><\/a> Sophomore Jason Pollak, junior Paul Bleich and sophomore Joey Kellison-Linn enjoy ComedySportz in the Haymarket Theater. Photo by Emma Chiu.[\/caption]\r\n\r\nThe training that troupe members receive will help them practice for not only ComedySportz competitions, but for other theatre-related competitions as well, such as the California State Thespian Festival, which the Paly Theatre Department attends every year.\r\n\r\nAccording to Woods, the improv competition at the Thespian Festival has a slightly different format from the ComedySportz competitions.\r\n\r\n“It’s usually three different students from three different schools [who] have to make up a team,” Woods said. “Then, [they] all compete with other student groups from different schools.”\r\n\r\nLast year, all 18 students who went to the festival earned some sort of statewide recognition, according to Woods. This included first and second place in both categories of Lighting and Sound. In addition, two students won statewide scholarships.\r\n\r\n“That’s exceptional,” Woods said. “That’s really, really unusual for any one school to have that much.”\r\n\r\nWith talented resources in the department, Woods is looking forward to the year ahead with regards to ComedySportz.\r\n\r\n“Every ComedySportz event that I’ve attended … is just very clever and sharp and quick,\" Woods said. \"It’s just a lot of fun to watch as an audience member, and it’s really rewarding for the students participating in the improv. I’m really looking forward to the added element of having ComedySportz.”","excerpt":"For the first year ever, the Palo Alto High School Theatre Department will partake in competitive improvisation as part of its newly-created ComedySportz team.","date":"2014-10-10 13:30:11","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_8527.jpg","categories":["Entertainment"],"tags":{"29694":"chris hinstorff","29692":"comedy sports","29691":"comedysportz","29693":"improv","29689":"kathleen woods","9159":"theater","9160":"theatre","29695":"thespian","29690":"zoe limbrick"}},{"id":75828,"title":"Highlights from Sen. Wyden&#8217;s roundtable discussion with tech leaders","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/highlights-from-sen-wydens-roundtable-discussion-with-leaders-of-technology\/","content":"<em>At a <a href=\"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/\" target=\"_blank\">Senate Finance Committee Chairman's roundtable<\/a> <i>held yesterday in the Palo Alto High School Big Gym<\/i>, United States Sen. Ron Wyden and five tech leaders examined how consumer and foreign government responses to U.S. mass surveillance programs are challenging U.S. innovation and global competitiveness. Following the slideshow are excerpts from each panel member's contribution to the discussion.<\/em>\r\n\r\n<span class=\"Apple-style-span\" style=\"color: #000000;\">[slideshow post_id=75828]<\/span>\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Senate Finance Committee Chairman Ron Wyden<\/span><\/strong>\r\n\r\n\"People from all over the country do not want America's political system to fritter away [all of the] hard-earned opportunities for foreign competitors [and] high wage industries. As chairman of the Senate Finance Committee, I'm here to tell you that I will not let that happen.\"\r\n\r\n\"Make no mistake, America's intelligence [agencies] are made up of thousands of overwhelmingly dedicated men and women who make enormous sacrifices to protect this nation. No one that I know in the senate or at this table wants to deprive our intelligence agencies of the tools that will actually make the world safer. But it's now clear that dragnet surveillance conflicts with core American values and doesn't make us safer.\r\n\r\n\"The government ought to stop requiring American companies to participate in this suspicion-less collection of customers data and begin the process of rebuilding trust at home.\"\r\n\r\n<b><span class=\"Apple-style-span\" style=\"color: #000000;\">Executive Vice President and General Counsel of Microsoft Brad Smith<\/span><\/b>\r\n\r\n\"Just as people would not put their money in a bank they don't trust, they will be reluctant to put their information in a data center or in a phone they don't trust.\"\r\n\r\n\"When trust is shattered, it needs to be rebuilt.\"\r\n\r\n\"[We need] to go back to the fundamental personal rights that are at stake. I think all of us stand for a straightforward proposition: If you're a consumer or a company, you own your email, your text messages, your photos and all the content that you create. Even when you put your content in our data centers or the devices that we make, you still own it. You are entitled to the legal protection under our Constitution and our laws, and we will not rebuild trust until our own government recognizes that straightforward principle.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Executive Chairman of Google Eric Schmidt<\/span><\/strong>\r\n\r\n\"We want to thank you [Sen. Wyden] for being a phenomenal champion for technology [and] for jobs. And I think, and we probably all think, that you are a true patriot.\"\r\n\r\n\"Thank goodness that you [Sen. Wyden] led the fight against bulk surveillance, but things are getting worse.\"\r\n\r\n\"I think the simplest outcome is that we're going to end up breaking the Internet. What's going to happen is the government will ... eventually say, 'We want our own Internet in our own country because we want it to work our way. We don't want the NSA and other people in it.' The cost of that is huge, in terms of knowledge, discovery, science, growth and jobs.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">General Counsel of Facebook Colin Stretch<\/span><\/strong>\r\n\r\n\"One of the biggest challenges we're confronting as an industry is the inability for most of the world's population to access the Internet. ... Eighty percent of the people without Internet access around the world are within range of a cell tower. The reason they do not have Internet access is because it costs too much. One of the big challenges for us as an industry is to bring technology to address that problem, to get the rest of the world. Data localization takes us in exactly the wrong direction, simply because it costs too much money.\"\r\n\r\n\"From our perspective, the most profoundly disturbing [disclosures] was ... hacking, the sort of things we do see from some other countries that are involved with state-sponsored espionage. That put the relationship between the industry and the U.S. government on a slightly different footing. ... What those disclosures [hacking] brought to light was there was this effort outside of what we all thought of as the appropriate legal process to attain user data. ... It placed renewed focus on our need to protect ourselves from these sorts of unauthorized overseas attacks.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">General Counsel of Dropbox Ramsey Homsany<\/span><\/strong>\r\n\r\n\"We need to be committed to providing good security and encryption for our users.\"\r\n\r\n\"Encryption is a critically important technology for everything we do and everything that happens on the Internet. Why would we start to hamper with it ... rather than wanting to develop great encryption and apply it so that consumers can have a lot of trust and faith in the fact that what they do store online is safe? There are many other ways for the government to get data when they're doing investigations ... which has been the legal norm for hundreds of years.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Partner of Greylock Partners John Lilly<\/span><\/strong>\r\n\r\n\"Most people want to follow the law. Most people want to stay safe ... but [there's] this bifurcation of citizenry and law enforcement and government, and we're getting a drumbeat of that, and that's increasingly the society we do not want.\"\r\n\r\n&nbsp;","excerpt":"At a Senate Finance Committee Chairman's roundtable held yesterday in the Paly Big Gym, United States Sen. Ron Wyden and five tech leaders discussed the \"Impact of Mass Surveillance on the Digital Economy.\"","date":"2014-10-09 22:39:19","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_1585.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"11286":"big gym","29857":"brad smith","29858":"colin stretch","29832":"digital economy","29826":"economy","29861":"eric schmidt","29860":"john lilly","29830":"mass surveillance","8944":"palo alto high school","29859":"ramsey homsany","29833":"roundtable","29855":"senate finance committee","29818":"senator","29854":"senator ron wyden","29829":"surveillance","29820":"Wyden"}},{"id":75806,"title":"Senator visits student journalists","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/senator-visits-student-journalists\/","content":"[caption id=\"attachment_75885\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_4196.jpg\"><img class=\"wp-image-75885\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_4196.jpg\" alt=\"Senator Ron Wyden addresses relevant political issues for high school students including college affordability, the future of tech industry and climate change. Ron Wyden spoke preceding his roundtable discussion with tech leaders on 'Impact of Mass Surveillance in our Digital Economy'. Photo by Takaaki Sagawa\" width=\"600\" height=\"400\" \/><\/a> Sen. Ron Wyden addresses relevant political issues for high school students, including college affordability, the future of tech industry and climate change. Wyden spoke yesterday morning at the Media Arts Center, preceding his roundtable discussion with tech leaders on the 'Impact of Mass Surveillance in our Digital Economy'. Photo by Aisha Chabane.[\/caption]\r\n\r\nUnited States Senator and Palo Alto High School alumnus Ron Wyden (D-Oregon) informed Paly student journalists of the current political issues and its relevance as well as his memories from Paly.\r\n\r\nThe senator addressed the main topic of mass surveillance at 10 a.m. yesterday in the MAC, later to be discussed in the <a href=\"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/\">roundtable discussion<\/a> with tech leaders.\r\n\r\n\"There's been a tremendous amount of discussion about digital surveillance related to privacy, national security and those issues,\" Wyden said. \"But there has been virtually no discussion on digital surveillance as to what it's doing to cutting-edge companies.\"\r\n\r\nWyden elaborated on the topic, providing relevance from a perspective for the future generation.\r\n\r\n\"I think your generation understands the potential of digital goods and digital services for both the economy and quality of life and what it's meant to your generation,\" Wyden said. \"And the thing is, the technology jobs pay good wages when arguably the premier economic issue of our time is wage growth.\"\r\n\r\nThe reason for the selection of Paly's Big Gym as the venue for the discussion became evident as Wyden recounted his favorite memories from Paly.\r\n\r\n\"A special Paly memory was this basketball game in the winter of 1967 when the gym had to be locked because there were so many people,\" Wyden said. \"The sidelines were three or four people deep, and Paly beat Sequoia [High School]. ... But I remember so many wonderful memories. I guess Peninsula Creamery is still around – my favorite place. ... I was also voted most fun to be with in the Madrono.\"\r\n\r\nClick on a topic of the conference below to listen to the recordings from the conference.\r\n\r\n[soundcloud url=\"https:\/\/api.soundcloud.com\/playlists\/54305704\" params=\"auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\" width=\"100%\" height=\"450\" iframe=\"true\" \/]","excerpt":"Sen. Ron Wyden spoke with student journalists yesterday to talk about his story at Paly as well as current political issues facing America.","date":"2014-10-09 21:40:26","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo.PNG.jpeg","categories":["News"],"tags":{"29838":"alumnus","10098":"basketball","14850":"climate","29840":"DC","29827":"Democrat","29842":"domestic","29843":"economic","8727":"gay","29836":"journalists","29841":"laws","18366":"mac","29835":"press conference","27727":"questions","29844":"rights","29819":"Ron Wyden","29818":"senator","29837":"story","9129":"student","29839":"Washington"}},{"id":74042,"title":"Where are they now: Lily Zhang","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/where-are-they-now-lily-zhang\/","content":"[caption id=\"attachment_75694\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/asdfsdf-2.jpg\"><img class=\"size-full wp-image-75694\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/asdfsdf-2.jpg\" alt=\"Lily Zhang poses for a selfie with her bronze medal from the 2014 Youth Olympic Games. Photo by Lily Zhang.\" width=\"250\" height=\"333\" \/><\/a> Lily Zhang poses for a selfie with her bronze medal from the 2014 Youth Olympic Games. Photo by Lily Zhang.[\/caption]\r\n\r\nMaking Olympic history for the United States is not something a typical 18-year-old can check off her bucket list.\r\n\r\nNeither is being named \"Athlete of the Month\" for a sport by Team USA.\r\n\r\nRecent Palo Alto High School alumna Lily Zhang has accomplished both of these things and more. Not only is she the first (and only) American to have competed at the Olympic Games prior to the Youth Olympic Games, but Zhang is also the first to win a table tennis medal at the Olympic level for the U.S. She secured a bronze medal in women’s singles table tennis last month at the Youth Olympics in Nanjing, China. After a victorious trip overseas, Zhang returned to the Bay Area to pursue her college education at University of California, Berkeley.\r\n\r\nThe Paly Voice caught up with Zhang to learn more about her experiences as a professional athlete.\r\n\r\n<strong>The Paly Voice:<\/strong> When and why did you start playing table tennis?\r\n\r\n<strong>Lily Zhang:<\/strong> I started playing at the age of seven when my friend took me to the Palo Alto Table Tennis Club.\r\n\r\n<strong>TPV:<\/strong> What has been your favorite part about playing?\r\n\r\n<strong>LZ:<\/strong> There's so much that drew me to table tennis. I love the rapidity of the game, the vast amount of different strategies and styles, the mental aspect of the sport and I especially love traveling for tournaments and learning about the various cultures of the world.\r\n\r\n<strong>TPV:<\/strong> What are your hopes or expectations of the table tennis program at UC Berkeley?\r\n\r\n<strong>LZ:<\/strong> I know that UC Berkeley has one of the best table tennis teams in the nation and I already know many of the players on the team, so I'm extremely excited to join the team. I also hope to help the team win gold at the College Nationals next semester.\r\n\r\n<strong>TPV:<\/strong> How do you think the demands of a college student will affect your training?\r\n\r\n<strong>LZ:<\/strong> It's definitely much harder to practice here because of the demands of college, but I'm going to try to push myself to practice as much as I can on the weekends, as well as go home to my club on some weekends to practice.\r\n\r\n<strong>TPV:<\/strong> How has your experience at the Youth Olympic Games helped you as a professional athlete?\r\n\r\n<strong>LZ:<\/strong> Participating in the Youth Olympic Games has given me so much experience I can take with me to future tournaments or events. I think my mental game improved significantly after the Games, as I was able to calm myself down and breathe deeply whenever I got too nervous there.\r\n\r\n<strong>TPV:<\/strong> What’s the most helpful advice your coach or anyone has ever given you?\r\n\r\n<strong>LZ:<\/strong> l think the most helpful advice I received was from my parents. Unlike many other parents in this sport, my parents never, ever pushed me to play table tennis and always gave me the choice to pursue what I wanted. In doing so, they helped me realize that I play because I truly love the sport, not because I was pushed or forced to.\r\n\r\n<strong>TPV:<\/strong> Do you have any advice for current Paly athletes?\r\n\r\n<strong>LZ:<\/strong> I guess my advice to current Paly athletes would be something along the same lines: Pursue something you're really passionate about because you will work hard to achieve your goals, but at the same time, really enjoy doing it.\r\n\r\n<strong>TPV:<\/strong> What are the next steps in your table tennis career?\r\n\r\n<strong>LZ:<\/strong> I'm still trying to work it out with my professors, but I'm hoping to attend the 2014 World Junior Championships in Shanghai, China. It'll be my seventh time playing World Juniors, and my goal is to win the first ever medal for the U.S. there.","excerpt":"Making Olympic history for the United States is not something a typical 18-year-old can check off his or her bucket list. Recent Paly alumna Lily Zhang, however, is not your typical 18-year-old. ","date":"2014-10-09 15:11:40","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/asdfsdf-21.jpg","categories":["Features","Spotlight"],"tags":{"29309":"cal","29307":"lily zhang","11531":"olympics","29311":"ping pong","29310":"table tennis","29308":"uc berkeley","11615":"where are they now"}},{"id":75853,"title":"Get a &#8220;taste&#8221; of Tasting Week","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/get-a-taste-of-tasting-week\/","content":"<em> Food celebration sweeps local schools in the Bay Area <\/em>\r\n\r\n[caption id=\"attachment_75855\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg\"><img class=\"size-full wp-image-75855\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg\" alt=\"The Paly cafeteria has a variety of food, from healthy fruit to unhealthy chips. The point of Tasting Week is to introduce healthier options to schools in Palo Alto and teach students about what they are eating. Photo by Ana Caklovic.\" width=\"600\" height=\"450\" \/><\/a> The Palo Alto High School cafeteria has a variety of food, from healthy fruit to unhealthy chips. The purpose of Tasting Week is to introduce healthier options to schools in Palo Alto and teach students about what they are eating. Photo by Ana Caklovic.[\/caption]\r\n\r\nTasting Week, a food event led by professional chefs, offers students in the Palo Alto Unified School District a chance to participate in various food-related workshops.\r\n\r\nAlthough the event is generally scheduled for Oct. 6-10, in reality, the celebration will extend into the next month, including a workshop held on Oct. 23 at Gunn High School, according to the <a href=\"tastingweek.com\">Tasting Week website<\/a>. Palo Alto High School students are welcome and are encouraged to participate at the event.\r\n\r\nChefs from popular Bay Area restaurants are running workshops so that students can learn more about food in a qualitative way, according to Tasting Week event organizers. Some of the PAUSD schools participating will be Escondido Elementary School and Barron Park Elementary School, according to the Tasting Week Calendar on the website.\r\n\r\nOn a press release on Monday, PAUSD Communications Coordinator Tabitha Kappeler-Hurley wrote that some of the chefs leading the workshops include c<span style=\"color: #222222;\">hef Charlie Ayers from Calafia in Palo Alto, chef Marco Fossati from Four Seasons in Palo Alto and chef Nathan Beriau from Ritz Carlton in San Francisco.<\/span>\r\n\r\nThe top chefs are visiting local schools to blossom students’ love for food, share new tastes and aromas, as well as teach students alternatives to unhealthy food options, according to Kappeler-Hurley.\r\n\r\n“The idea to have Bay Area schools launch this celebration of food came from a group of Bay Area parents who believe that educating children about taste is the best way to get them to love food and, at the same time, to fight obesity,” Kappeler-Hurley wrote.\r\n\r\nAfter its launch in Palo Alto four years ago, Tasting Week has now expanded to schools across the bay in cities such as San Francisco and Berkeley. The founder of the organization of the Bay Area Tasting Week organization is Rebecca Scholl-Barbier, a Palo Alto parent with four children in the PAUSD.\r\n\r\nSome students see the benefits of the event and are eager to sample and learn about the different tastes.\r\n\r\n“I’d want to go to a workshop,” Walter Hays Elementary fifth grader Hana Krieger said. “I think it [Tasting Week] is good because it gives students a chance to try things for free.”\r\n\r\nOthers understand the goal of Tasting Week, and see how it can educate people.\r\n\r\n“A lot of people who don’t know how to cook would want to go to the event,\" junior Isabelle Vincent said. \"People who don’t really know what goes in their food can develop healthier eating habits [at the workshops]. It’s always good to know how to cook at least one thing. I wouldn’t go out of my way to go [to a workshop] but if I knew it was happening and I was free I’d go.”\r\n\r\nFor those who are interested in participating in this event, the Tasting Week schedule for schools in the PAUSD can be found on the <a href=\"http:\/\/www.tastingweek.com\/calendar\/tasting-week-school-schedule-2014\/\">official website<\/a>.","excerpt":"Tasting Week, a food event led by professional chefs, offers students in the Palo Alto Unified School District a chance to participate in various food-related workshops.","date":"2014-10-09 15:09:11","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo-1.jpg","categories":["News","Spotlight"],"tags":{"8512":"Bay Area","29863":"chef","29864":"elementary school","8713":"Food","8751":"gunn","29867":"health","29866":"obesity","29862":"tasting week","29865":"walter hays"}},{"id":75082,"title":"APPetite blog: 2F1B","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/appetite-blog-2f1b\/","content":"<em>Welcome to APPetite, a student-run blog all about apps. We, Liana and Maddy, are here to help you make the most important of life decisions: “What app should I download next for my phone\/tablet?” Since we know you totally have loads of time to waste on your smartphone between school, sports and a myriad of other extra-curricular activities, be sure to check out APPetite to fulfill your hunger for your next app addiction.<\/em>\r\n\r\n<strong>Two Fingers One Brain (2F1B)<\/strong>\r\n\r\n<strong>Price: FREE<\/strong>\r\n\r\n<strong>Available: App Store, Google Play<\/strong>\r\n\r\n<strong>Rank: 4.9\/5<\/strong>\r\n\r\n<strong style=\"color: #000000;\">Why you should download: \"Two Fingers One Brain\" is great for those who are up for a challenge and like a good brain workout.<\/strong>\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/573334491259469825\" width=\"620\" height=\"229\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n\"Two Fingers One Brain,\" a.k.a. 2F1B, is an app that challenges users as it forces them to multitask. In the app you complete two mini-games simultaneously while under time pressure and a limited number of lives. The game is over once users run out of their five lives. Having to complete two different mini-games under time pressure on different sides of the screen is harder than it looks, but oh-so-addicting.\r\n\r\nPerfect for the competitive type, this app will test your patience as even the simplest tasks (e.g. how many numbers are here?) seem like the most advanced problems. When playing, it is important to not get discouraged as part of the fun is all of those facepalm moments.\r\n\r\nI stumbled across this app at the recommendation of a friend and have been hooked ever since. The only downside is when two of the hardest games are going on simultaneously, which is not a fun situation. But that's the draw: Those hard games are what keep you coming back for more wanting to get that high score.\r\n\r\nA variety of mini-games allows the user to not get bored by varying tasks while keeping them familiar.\r\n\r\nIt takes only one brain to know that this app is a winner and only one finger to download it, so if you're up for the challenge be sure to start testing your skills with 2F1B.","excerpt":"Two Fingers One Brain, a.k.a. 2F1B, is an app that challenges users as it forces them to multitask. In the app you complete two mini-games simultaneously while under time pressure and a limited number of lives. The game is over once users run out of their five lives. Having to complete two different mini-games under time pressure on different sides of the screen is harder than it looks, but oh-so-addicting.","date":"2014-10-09 13:47:33","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/11.jpg","categories":["APPetite","Spotlight"],"tags":{"29811":"2f1b","29416":"APPetite","29478":"blog","29810":"two fingers one brain"}},{"id":75684,"title":"What&#8217;s in my bag: Natalie Holler","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/whats-in-my-bag-natalie-holler\/","content":"<code><img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/576136198569852929\/1024\/10\/scaletowidth#tl-576136198569852929;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script><\/code>\r\n\r\nAs part of The Paly Voice's \"What's in my Bag\" series to find out more about students at Paly, this week we sat down with senior Natalie Holler. Hover around the photo to learn more.","excerpt":"As part of The Paly Voice's \"What's in My Bag?\" series to find out more about students at Paly, this week we sat down with senior Natalie Holler. ","date":"2014-10-09 13:34:36","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/bag.png","categories":["Multimedia","Spotlight"],"tags":[]},{"id":75221,"title":"100 dollars a day for long showers?","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/100-dollars-a-day-for-long-showers\/","content":"<p>The City of Palo Alto adopted a new policy in which people who overuse water can face fines of up to $100 a day.  The new policy will involve a four step process. The first two violations will give the home either a letter or door hanger describing the water usage.<span style=\"color: #000000;\"> The third violation will be a letter describing the fines and the at the fourth violation, the fines will be executed, according to the City Council.<\/span><\/p>\r\n<p><span style=\"color: #000000;\">Palo Alto High School students have opinions on whether this process will be helpful or hurtful. Hover over the dots on the photo for student opinions.<\/span><\/p>\r\n<p><img style=\"max-width:100%\" src=\"\/\/cdn.thinglink.me\/api\/image\/576183855950594050\/1024\/10\/scaletowidth#tl-576183855950594050;1043138249'\" class=\"alwaysThinglink\"\/><script async charset=\"utf-8\" src=\"\/\/cdn.thinglink.me\/jse\/embed.js\"><\/script><\/p>\r\n","excerpt":"The City of Palo Alto adopted a new system to penalize residents who overuse water to help conserve water in the drought. The new system involves a series of warnings and then fines in order to stop water waste. ","date":"2014-10-09 13:27:21","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/unnamed.jpg","categories":["Uncategorized","Verbatims"],"tags":{"29490":"drought","8916":"news","8927":"opinion","8939":"palo alto","10249":"water"}},{"id":75319,"title":"Smartphone and iPhone Cult(ure)","permalink":"http:\/\/palyvoice.com\/2014\/10\/08\/smartphone-and-iphone-culture\/","content":"<em>Living in Silicon Valley, it’s no surprise that students here are incredibly \"well-connected.\"<\/em>\r\n\r\n[caption id=\"attachment_75348\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg\"><img class=\"size-full wp-image-75348\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg\" alt=\"Freshman Olivia Fernandez uses her iPhone to work on her homework during her prep. Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> Freshman Olivia Fernandez uses her iPhone to work on her homework during her prep. Photo by Ana Caklovic.[\/caption]\r\n\r\nNo one would guess that a public high school's number one addiction is being called education’s greatest resource. But the growing dependency on this product and the technology behind it is transforming the culture of Palo Alto High School. Technology represents the language of the next generation, the top end of the education spectrum and a community that’s pushing the boundaries of innovation. But what is Paly's latest obsession, both in the classroom and on the Quad? The smartphone.\r\n\r\nSophomore Samarth Venkatasubramaniam agrees: “Both students and teachers [are] becoming really dependent on their smartphones,\" Venkatrasubramaniam said. \"Many teachers … ask you to pull out your phone and ‘take this quiz’ or ‘use this app’. And students … communicate using their phone whether it’s chatting or texting and calling or Snapchatting … they’re always on their phones for communication or studies.”\r\n\r\nThe presence of iPhones and other smartphones in the classroom is viewed as an influence that can both help and distract. Students have a tendency to get distracted when they use their phones, but junior Ella Higashi thinks there are benefits that outweigh the risk of distraction.\r\n\r\n“My history class used them [smartphones] the other day, and I think it was helpful,\" Higashi said. \"Sometimes ... in science you can use your phone to upload things to the screen, which is really good for visual learning.\"\r\n\r\nSenior Claire Priestley also feels distraction should not be a major concern when using smartphones educationally.\r\n\r\n“Teachers are really concerned with you not being on task with your phone but I think the majority of the people will stay on task because most people here are really good people,” Priestley said.\r\n\r\nThe increasing use of smartphones in classroom activities may be due to an overall increase in smartphone ownership, specifically, iPhone ownership. In a study entitled “Smartphone Ownership in 2013,” the Pew Research Center found that “those from the upper end of the income and education spectrum are much more likely than those with lower income and educational levels to say they own an iPhone.\" The study found that 25 percent of cellphone users in the U.S. own an iPhone.\r\n\r\nThe iPhones is known for its beautiful design and intuitive interface. However, students like Higashi argue that the Apple product is overrated and that phones should be valued for their functionality instead of their beauty.\r\n\r\n“I think other smartphones can do the same stuff as iPhones,\" Higashi said. \"I think it’s more of the name ‘iPhone.'\"\r\n\r\nAccording to senior Maeve Lavelle, the popularity of iPhones and the power of the brand name seems to only have increased with time.\r\n\r\n“Freshman year it was kind of like, ‘Oh, you have an iPhone, cool. I don’t,’ but it was still acceptable. By senior year everyone has an iPhone except for maybe the odd few, and if you don’t have one by now, it’s kind of like ‘Oh, what’s up with you?’” Lavelle said, who is an owner of an iPhone 5S.\r\n\r\nOne aspect that contributes to iPhone ownership may just be a matter of familiarity with the iPhone and an unwillingness to step out of the comfort zone of Apple products. “I’ve only had an iPhone... so I don’t really know how to use phones that aren’t iPhones,” Priestley said. “I think I’d always stick with the iPhone because it’s just what I know.”\r\n\r\nThe iPhone can be either be perceived as a positive result of technology or an unnecessary display of money. iPhone culture is the feeling that an iPhones is the only acceptable type of phone, and that not having an iPhone is a huge loss and disadvantage.\r\n\r\n“[iPhone culture] is a result of us being in the upper-middle class to upper class, and it’s kind of a gross display of our wealth,” junior Sean Jawetz said. “But I don’t think it has a positive or negative effect on the culture of our student body.”\r\n\r\nThe dependency on smartphones shows that the technology culture is unnaturally strong and the iPhone culture even stronger. Paly students recognize that Paly’s iPhone culture is the exception, not the rule.\r\n\r\nAs Venkatasubramaniam puts it, “Phones are practical, obviously.That’s why people use them.”\r\n\r\n[caption id=\"attachment_75349\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97991.jpg\"><img class=\"size-full wp-image-75349\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97991.jpg\" alt=\"Sophomore Ciara Bleahen and sophomore Alicia Mies use their iPhones to listen to music and study in the library. Photo by Ana Caklovic.\" width=\"600\" height=\"400\" \/><\/a> Sophomore Ciara Bleahen and sophomore Alicia Mies use their iPhones to listen to music and study in the library. Photo by Ana Caklovic.[\/caption]\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Technology represents the language of the next generation, the top end of the education spectrum and a community that’s pushing the boundaries of innovation. But what is Paly's latest obsession, both in the classroom and on the Quad? The smartphone. ","date":"2014-10-08 18:35:11","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_97951.jpg","categories":["Features","Spotlight"],"tags":{"29624":"classroom","29620":"culture","29621":"feature","8793":"iphone","29623":"smartphone","9154":"technology","29622":"trend"}},{"id":75751,"title":"Sen. Ron Wyden, Paly alumnus, to hold hearing on campus","permalink":"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/","content":"[caption id=\"attachment_75761\" align=\"alignnone\" width=\"537\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg\"><img class=\" wp-image-75761\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg\" alt=\"U.S. Senator Ron Wyden gives a presentation titled &quot;American Innovation &amp; Your Privacy in a Digital World&quot; at Tech Fest Northwest in Portland, Oregon in Aug. 2014. Photo by the Office of Senator Ron Wyden.\" width=\"537\" height=\"403\" \/><\/a> U.S. Sen. Ron Wyden gives a presentation titled \"American Innovation and Your Privacy in a Digital World\" at Tech Fest Northwest in Portland this August. Tomorrow, Wyden will hold a Chairman's Roundtable titled \"The Impact of Mass Surveillance on the Digital Economy\" in the Big Gym of Palo Alto High School. Representatives from Google, Facebook, Dropbox, Grelock Partners and Microsoft will be a part of the discussion. Photo by the Office of Senator Ron Wyden.[\/caption]\r\n\r\nUnited States Sen. Ron Wyden will hold a Chairman’s Roundtable to discuss “The Impact of Mass Surveillance on the Digital Economy” in his first public forum for a Silicon Valley audience at 11 a.m. tomorrow in the Big Gym at Palo Alto High School, his former high school.\r\n\r\nParticipants will discuss how government mass surveillance programs are challenging innovation and global competitiveness, as well as their effects on businesses and its technology sector.\r\n\r\n“The economic impact [of mass surveillance] has gotten less attention, so that’s a really important topic that Wyden wants to give attention to,” Wyden's spokesman Keith Chu said.\r\n\r\nWyden has advocated for the U.S. to take a leading role in ensuring the preservation of the Internet as an open platform for communication and commerce, according to the <a href=\"https:\/\/www.eventbrite.com\/e\/chairmans-roundtable-the-impact-of-mass-surveillance-on-the-digital-economy-registration-13338841835\">event details<\/a>.\r\n\r\nThe individuals who will be present at the Chairman's Roundtable discussion include: Senate Finance Committee Chairman Ron Wyden, Executive Chairman of Google Eric Schmidt, Executive Vice President and General Counsel of Microsoft Brad Smith, General Counsel of Facebook Colin Stretch, General Counsel of Dropbox Ramsey Homsany and Partner of Greylock Partners John Lilly.\r\n\r\nAccording to <a href=\"http:\/\/www.wyden.senate.gov\/\">Wyden's Website<\/a>, Wyden served in the U.S. House of Representatives from 1981 until his election into Senate, and he currently is the top ranking Democrat for the Energy and Natural Resources Committee, while also serving on the Committees of Finance, Budget and Intelligence.\r\n\r\nThe event will take place at Paly's Big Gym where former Paly student Wyden, who graduated in late 1960, played basketball in high school.\r\n\r\nWhile an RSVP is not necessary, it is strongly recommended to make one <a href=\"https:\/\/wyden-nsa-roundtable.eventbrite.com\">here<\/a><span style=\"text-decoration: underline;\">.<\/span> Paly students and the general public are all welcomed.\r\n\r\n“As many students as possible would be great,” Chu said.","excerpt":"United States Senator Ron Wyden will hold a Chairman’s Roundtable to discuss “The Impact of Mass Surveillance on the Digital Economy” at 11 a.m. tomorrow in the Big Gym of Palo Alto High School.","date":"2014-10-07 21:37:54","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/WYDEN.jpg","categories":["News","Spotlight"],"tags":{"11286":"big gym","29834":"chairman","29822":"Chairman's Roundtable","29828":"Committee","29827":"Democrat","29831":"digital","29832":"digital economy","29826":"economy","8753":"gym","29825":"innovation","29817":"Keith Chu","29830":"mass surveillance","29821":"Ron","29819":"Ron Wyden","29833":"roundtable","29818":"senator","29824":"Silicon Valley","29829":"surveillance","29823":"United States Senator","29820":"Wyden"}}]