[{"id":71358,"title":"All-girls robotics team mentors first Colombian robotics team","permalink":"http:\/\/palyvoice.com\/2014\/05\/27\/all-girls-robotics-team-mentors-first-colombian-robotics-team\/","content":"","excerpt":"Local all-girls robotics team mentors the creation of the first all-girls FRC robotics team in South America","date":"2014-05-27 11:44:38","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/svrbooth1.jpg","categories":["Editor's Pick","Features"],"tags":{"17501":"5311","17510":"Ames Research Center","17509":"Bogota","17505":"Colombia","17512":"Ebeth Mittman","17499":"FIRST","17498":"FRC","17504":"Girl Scouts","17503":"NASA","9049":"robotics","17507":"SENA","17511":"Silicon Valley Regionals","17506":"South America","17497":"Space Cookies","17500":"Space Stars","17508":"Stephenie Zhang","17502":"team 1868"}},{"id":72273,"title":"&#8220;Palo Alto&#8221; offers unconvincing, aimless portrayal of high school life","permalink":"http:\/\/palyvoice.com\/2014\/05\/27\/palo-alto-offers-unconvincing-aimless-portrayal-of-high-school-life\/","content":"[caption id=\"attachment_72452\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party1.jpg\"><img class=\"size-full wp-image-72452\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party1.jpg\" alt=\"&quot;Palo Alto&quot; centers around the experiences of two teens, April (Emma Roberts) and Teddy (Jack Kilmer). Photo by tribecafilm.com.\" width=\"800\" height=\"422\" \/><\/a> \"Palo Alto\" centers around the experiences of two teens, April (Emma Roberts) and Teddy (Jack Kilmer). Photo by tribecafilm.com.[\/caption]\r\n\r\nIt turns out the only thing that angers Palo Altans more than James Franco’s novel “Palo Alto: Stories” is Gia Coppola’s film adaptation of that book, \"Palo Alto.\"\r\n\r\nThe drama, based on a select few of the stories written by Franco in his novel, follows the confusing, angst-ridden life of high school students. April (Emma Roberts) is a quiet girl who plays on the school soccer team. While her parents may be negligent, her coach Mr B. (James Franco) gives her more than enough attention, appropriate or otherwise. Meanwhile, Teddy (Jack Kilmer) and his dangerously rebellious friend Fred (Nat Wolff) are constantly getting into trouble just for the sake of it.\r\n\r\nIf the plot sounds bland, that’s because it is. Nothing happens in this film. Perhaps Coppola wanted to simply show section of the lives of these characters, but their problems and actions are so useless the story ends up being average. It’s hard to relate to characters when they do things for no specific reason and barely, or never, learn from their mistakes.\r\n\r\nThe general explanation of these characters’ actions is their ubiquitously bad parents, but that hardly explains most of what happens in the film. If one of the characters had that problem, and the problem was really focused on, it would be excusable, but that’s not the case. It’s a lazy writing technique, and inspires no love for the characters.\r\n\r\nActually, that would be a good way of describing most of the writing: lazy. Every character besides Teddy and April are archetypal and act without reason or intention. Seriously, how many times are we going to see a high school film with unexplainably malicious popular girls until it gets boring?\r\n\r\nTo continue the motif of laziness, the film is full of pseudo-deep shots and scenes. The meaning or point of them is implied, but is not actually there. An example: a minute-long shot of April looking out a window is not deep, it’s boring. There’s no content to shots like these; if a character is supposed to be thinking, there are better ways to show that then to let the audience guess.\r\n\r\nThe one redeeming part of the writing was some of the humor. Most of it consists of stupid, immature jokes, or silly tidbits of dialogue, but its accuracy to the way that high school students act made it amusing. Someone blurting a lame, uninspired insult about their friend’s sexuality isn't inherently funny – it’s funny because it’s just the kind of obnoxious thing a teenager would do. Once again the issue comes back to laziness, when jokes and gags are repeated.\r\n\r\nPerformance-wise, the film was acceptable. None of the actors ended up being more than decent because, as good as their performances were, their roles were so boring and melodramatic it gave them few opportunities to actually show their ability.\r\n\r\nThe film actually had some great moments of camerawork and editing. A lot of the cinematography felt fitting and interesting, especially the shots of suburban night life. The pacing of shots complimented the content of the scenes well. The film seemed to have a high-contrast filter, which really helped the mood. Colors were vibrant and pleasing to look at, which contrasted interestingly with the darker content.\r\n\r\nSome residents of real-life Palo Alto have criticized the film for portraying the town in an unfairly negative light, but in reality nothing in the movie is specific or even connected to the actual city. None of Palo Alto’s notable attributes, such as Facebook headquarters or the presence of Stanford, are more than slightly alluded to, and the settings in which the film takes place are clearly <i>not <\/i>Palo Alto (to a native Palo Altan, at least). The movie was actually filmed entirely in Southern California.\r\n\r\nSo, rather than specifically criticising the local culture in the manner of “Silicon Valley,\" “Palo Alto” is actually meant to serve as a portrait of teenage life anywhere in the country. Its name ends up being little more than a placeholder that could potentially be interchanged with any other town – Palo Alto just happened to be James Franco’s childhood home and therefore the nominal location of his stories. The supposed denigration of the town turns out to be a non-issue; the <a href=\"http:\/\/verdemagazine.com\/james-francos-palo-alto\">\"shadowy side of Palo Alto\"<\/a> is really just the negative aspects of teenage life everywhere.\r\n\r\nIn the end, the film offers a generally reasonable but oversimplified look at the adolescent experience. The issues and challenges faced by the movie’s characters are certainly real, but the one-dimensional characters greatly reduce its believability – and there are certain moments of dialogue which simply don’t feel real (not to mention the unrealistically high amount of cigarette smoking by the teens in the supposedly present-day setting of the movie). The film manages to touch on elements of what it is like to be a teenager, but its lack of significant plot or point ultimately prevents it from being more than a pessimistic, apathetic adaptation.\r\n\r\n&nbsp;\r\n\r\n<b>“Palo Alto”<\/b>\r\n\r\n<b>1 hour, 40 minutes<\/b>\r\n\r\n<b>Rated: R for strong sexual content, drug and alcohol use, pervasive language, smoking, all involving teens<\/b>\r\n\r\n<b>Directed by Gia Coppola<\/b>\r\n\r\n<b>Starring: James Franco, Emma Roberts, Jack Kilmer<\/b>\r\n\r\n<b>Based on the novel <\/b><b><i>Palo Alto <\/i><\/b><b>by James Franco<\/b>","excerpt":"It turns out the only thing that angers Palo Altans more than James Franco’s novel “Palo Alto” is Gia Coppola’s film adaptation of that book by the same name.","date":"2014-05-27 11:17:34","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party.jpg","categories":["Entertainment","Reviews","Spotlight"],"tags":{"19415":"Emma Roberts","8706":"film","19414":"Gia Coppola","8801":"james franco","8899":"movie","19416":"Nat Wolff","8939":"palo alto","9045":"review"}},{"id":72192,"title":"Students to perform in teen musical","permalink":"http:\/\/palyvoice.com\/2014\/05\/27\/students-to-perform-in-teen-musical\/","content":"Fifteen Palo Alto High School students will be taking part in a teen musical from June 12-28 at Southside Theater in San Francisco, Calif.\r\n\r\nThe indie-rock musical, Body of Water, is unique in its scripting as it is a non-traditional take on musicals, according to senior Aaron Slipper.\r\n\r\n<span style=\"color: #3e454c;\">\"Body of Water is 'Breakfast Club' meets 'Lord of the Flies' meets 'Schindler's List',\" Slipper said. \"It is an exciting and very original musical. Or, should I say anti-musical. That's how it was first described to me. You'll see no split leaps or chorus line numbers. It is highly dystopian.\"<\/span>\r\n\r\n[caption id=\"attachment_72363\" align=\"alignright\" width=\"361\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10388257_780476648638987_1331653994_n.jpg\"><img class=\"wp-image-72363\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10388257_780476648638987_1331653994_n.jpg\" alt=\"10388257_780476648638987_1331653994_n\" width=\"361\" height=\"587\" \/><\/a> The Body of Water will feature 14 Paly students in the stage troupe, A Theatre Near U.[\/caption]\r\n\r\nThe script, written by Tony Kienitz, features a group of teens hiding to escape from ideological extremists who have seized their families. According to Slipper, the music by Jim Walker as well as the choreography will be most memorable for the audience.\r\n\r\n\"There is superb choreography, dancing and some really memorable and somewhat shocking songs,\" Slipper said.\r\n\r\nThe cast actors of the musical is completely composed of teenagers, who have continuously workshopped the play for over a year.\r\n\r\n\"<span class=\"Apple-style-span\" style=\"color: #3e454c;\">I am joined by 14 peers from Paly and others from Westmont [High School], [Henry M.] Gunn [High School] and Los Altos [High School],\" Slipper said. \"It has been an intimate and highly enjoyable process. We have been together to witness the creation, rehearsal and, soon, performance of this unique work of art.\"<\/span>\r\n\r\nThe 15 Paly students along with other teens from the Bay Area will perform nine times over the course of 17 days from June 12-28 at the Southside Theater. The schedule as well as tickets are available <a href=\"http:\/\/www.brownpapertickets.com\/event\/626000\">here<\/a>.","excerpt":"Fifteen Palo Alto High School students will be taking part in a teen musical from June 12-28 at Southside Theater in San Francisco, Calif.","date":"2014-05-27 11:10:09","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/1506773_1483801551832399_730957061954257065_n.jpg","categories":["News","Uncategorized"],"tags":{"19301":"aaron slipper","19407":"body of water","19628":"musical","9061":"San Francisco","19627":"Southside theater","9159":"theater"}},{"id":72461,"title":"Breaking: Glenn “Max” McGee to succeed Kevin Skelly as PAUSD superintendent","permalink":"http:\/\/palyvoice.com\/2014\/05\/23\/breaking-glenn-max-mcgee-to-succeed-kevin-skelly-as-pausd-superintendent\/","content":"","excerpt":"","date":"2014-05-23 20:56:02","author":"Charles Yu","categories":["Ticker"],"tags":[]},{"id":72358,"title":"Award-winning historian David M. Kennedy visits Paly","permalink":"http:\/\/palyvoice.com\/2014\/05\/23\/award-winning-historian-david-m-kennedy-visits-paly\/","content":"[caption id=\"attachment_72400\" align=\"alignnone\" width=\"533\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg\"><img class=\"wp-image-72400\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg\" alt=\"David M. Kennedy and history teacher Jack Bungarden pose for a picture with Paly students. Form left to right is Hannah Zhang, Hannah Nguyen, David Kennedy, Jack Bungarden, Lizzy Chen, and Johnny Lee. Photo By Claire Liu.\" width=\"533\" height=\"400\" \/><\/a> David M. Kennedy and history teacher Jack Bungarden pose for a picture with Paly students. From left to right is junior Hannah Zhang, junior Hannah Nguyen, Kennedy, Bungarden, junior Lizzie Chun and junior Johnny Lee. Photo By Claire Liu.[\/caption]\r\n\r\nStanford professor and Pulitzer prize-winning historian David M. Kennedy spoke to Palo Alto High School students in Advanced Placement United States History and answered their questions on Tuesday during Tutorial. He is most widely known among Paly students as the author of <em>The American Pageant<\/em>, the main text used in the APUSH course.\r\n\r\n\"I thought it was really interesting,\" junior Guive Assadi said. \"[Kennedy] mostly didn't talk about specific history. He talked about historiography, and I think that's really cool.\"\r\n\r\nKennedy started the session by reading a comical essay that was composed of funny mistakes by college students. He then talked about the importance of studying history and how it helps us understand ourselves, and ended the afternoon by fielding questions from students answering a few questions.\r\n\r\nJunior Will Kast thought the session was both interesting and entertaining.\r\n\r\n\"The essay made from a compilation of student written essays was my favorite part,\" Kast said. \"I thought it was absolutely hilarious.\"\r\n\r\nFor Kast, it was a great way to wrap up the year.\r\n\r\n\"Sometimes when a class is as exhausting as APUSH, you forget why studying is so important,\" Kast said. \"Hearing Dr. Kennedy speak was a good reminder of why it's so important to study history.\"\r\n\r\nAssadi also viewed the experience as a great way to cap off his time studying American history at Paly.\r\n\r\n\"We read Kennedy's book, but we never get to hear his methodology,\" Assadi said. \"I think it's a great thing to participate in at the end of the year to reflect on the class, but also on the various techniques he employs in our book.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Stanford professor and Pulitzer prize-winning historian David M. Kennedy spoke to Palo Alto High School students in Advanced Placement United States History and answered their questions on Tuesday during Tutorial","date":"2014-05-23 20:55:29","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg","categories":["News"],"tags":{"8490":"apush","19629":"bungarden","11617":"history","8829":"kennedy"}},{"id":72442,"title":"Graduation at 5 p.m. on May 28 on the Quad","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/graduation-at-5-p-m-on-may-28-on-the-quad-2\/","content":"","excerpt":"","date":"2014-05-22 20:55:13","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8742":"graduation"}},{"id":72406,"title":"Voice Video: Field Day 2014","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/voice-video-field-day-2014\/","content":"<iframe width=\"560\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/DP8qQi-XW88\" frameborder=\"0\" allowfullscreen><\/iframe>","excerpt":"The Paly Voice films Field Day 2014 with a GoPro.","date":"2014-05-22 18:30:04","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-3.jpg","categories":["Multimedia","Video"],"tags":{"8704":"field day","8953":"paly"}},{"id":71426,"title":"2014: Spring semester in review","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/2014-spring-semester-in-review\/","content":"[caption id=\"attachment_72249\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg\"><img class=\"size-full wp-image-72249\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg\" alt=\"One of the many highlights of this semester was Field Day, during which bungee jumping was been offered as an activity for the first time. Photo by Amanda Carlsson.\" width=\"800\" height=\"600\" \/><\/a> One of the many highlights of this semester at Palo Alto High School was Field Day last Friday, during which bungee jumping was offered as an activity for the first time. Photo by Amanda Carlsson.[\/caption]\r\n\r\nThe school year is finally coming to a close and among countless projects and finals, The Paly Voice wanted to take a break and remember all that has happened this past semester at Palo Alto High School and within the Paly community. Despite controversial news surrounding old Paly administration dominating the community, these past months have also been filled with fun and success. Before we all throw our books in the air and head into summer, we want to take a moment to reflect upon the last five months:\r\n\r\n<b>Clubs <\/b>\r\n\r\nClubs continued to be active on campus this semester in lunchtime performances, competitions and events. A highlight for clubs this spring semester came when the Science Olympiad team placed first in regionals to advance to the Northern California state competition, where it came in <a href=\"http:\/\/palyvoice.com\/2014\/04\/17\/science-olympiad-places-second-at-state-competition\/\">second place<\/a>. The Robotics team came in <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/robotics-team-places-22nd-out-of-58-at-silicon-valley-regional\/\">22nd<\/a> out of 58 teams in the Silicon Valley Regional competition to conclude its season. The club’s robot is built entirely by students, with little help from adult mentors. Additionally, The Best Buddies club was <a href=\"http:\/\/palyvoice.com\/2014\/05\/21\/palys-best-buddies-chapter-awarded-outstanding-high-school-chapter-of-the-year\/\">honored<\/a> as an “Outstanding High School Chapter of the Year” for the second year in a row.\r\n\r\n<b>Administration <\/b>\r\n\r\nThis semester saw not only changes in staff, but a change in administration attitudes. The administration selected Earl Hansen’s replacement: <a href=\"http:\/\/palyvoice.com\/2014\/03\/19\/breaking-news-admin-selects-new-athletic-director\/%20\">Jason Fung<\/a>. Not only is he a Paly graduate (‘92), but he has been actively involved in multiple sports programs at Paly since 2008. Next, the administration selected <a href=\"http:\/\/palyvoice.com\/2014\/03\/04\/meet-chase-palys-new-campus-supervisor\/%20 \">Chase Hartmann<\/a> to replace Mary Puorro as the new campus supervisor. You can catch Hartmann riding around campus on one of the golf carts. Finally, Principal Kim Diorio <a href=\"http:\/\/palyvoice.com\/2014\/03\/25\/principal-reaches-out-to-community-with-coffee-and-pizza\">reached out<\/a> to students in a whole new kind of way this semester: through pizza (and coffee for the parents). In an effort to reach out to the student and parent community, Diorio has installed a new series of lunch and morning meetings that will continue into next year.\r\n\r\n<strong>Sports <\/strong>\r\n\r\nSports this semester had many highs and lows, wins and losses and seasons ending and beginning. Winter sports seasons concluded on a bold note this semester, and spring sports began immediately after, with some spring seasons still underway.\r\n\r\nThe boys' basketball season ended in March with a 43-51 <a href=\"http:\/\/palyvoice.com\/2014\/03\/02\/boys-basketball-falls-to-m-a-in-ccs-quarter-finals-43-51\/\">loss<\/a> to Menlo-Atherton High School in the Central Coast Section quarterfinals. The team boasted a winning record, going 15-11 overall and 8-4 in league.\r\n\r\nThe girls' basketball team made a strong run in the CCS playoffs, <a href=\"http:\/\/palyvoice.com\/2014\/03\/04\/slideshow-girls-basketball-beats-mountain-view-in-ccs-thriller\/\">beating<\/a> Mountain View High School in a huge comeback to advance to the CCS semifinals, where it then <a href=\"http:\/\/palyvoice.com\/2014\/03\/05\/liveblog-girls-basketball-takes-on-north-salinas-in-ccs-semi-finals\/\">fell<\/a> to North Salinas High School. A highlight of the season came when the team <a href=\"http:\/\/palyvoice.com\/2014\/02\/03\/girls-basketball-triumphs-over-gunn-49-45\/\">beat<\/a> cross-town rival Gunn High School for the last time in the Big Gym before its planned demolition this summer. Gunn had beaten Paly twice the year before, so this close 49-45 win had even more meaning for the team.\r\n\r\nThe boys' soccer team ended its season with a 7-8-5 record, falling just short of qualifying for the CCS playoffs.\r\n\r\nThe girls' soccer team had a strong winning record of 11-5-5. The team's season ended in a 0-2 loss to Los Gatos High School in the CCS semifinals.\r\n\r\nThe wrestling team placed sixth place at the Santa Clara Valley Athletic League finals, allowing it to keep its spot in the De Anza League for next season.\r\n\r\nAs for the spring sports, the baseball team (15-14, 9-4) failed to capture a league title this year, but<a href=\"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/\"> looked to make a decisive run<\/a> in the SCVAL Playoffs, which began with a decisive 5-0 win over Wilcox High School. However, the Vikings lost a three-game league championship series to Saratoga High School after being down <a href=\"http:\/\/palyvoice.com\/2014\/05\/13\/pitchers-fail-to-hold-early-lead-vikings-fall-to-saratoga\/\">one game to none<\/a> to take second place in the SCVAL. The team then took  on Leland High School in the first round of CCS Playoffs yesterday, where it fell, 4-8.\r\n\r\nAfter moving down to the El Camino Division of SCVAL and hiring an ex-San Francisco Giant to coach, the softball team greatly improved upon last year’s overall record of 3-22 and is now 14-12 overall and 4-7 in league. The team honored its seniors on <a href=\"http:\/\/palyvoice.com\/2014\/05\/14\/slideshow-softball-trounces-fremont-on-senior-night\/\">Senior Night<\/a>, where the Lady Vikings dominated Fremont High School. The boys’ golf team had a successful season, capturing the SCVAL title for the second year in a row.\r\n\r\nThe boys’ swimming team placed first in the SCVAL championships as well, and both the girls’ and boys’ teams had <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/swimming-towards-ccs\/\">high expectations<\/a> to make a strong showing in the Central Coast Section Playoffs. The boys' swimming team fell short of these goals by barely losing in the CCS finals to the now 30-year reigning CCS champs Bellarmine High School last weekend.\r\n\r\nBoth the girls’ and boys’ track and field teams finished in the middle of the pack in terms of league standings, but competitors of individual events were <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/track-and-field-races-to-the-finish-line\/\">expected to do well<\/a> throughout the CCS playoffs. One such event was the 200 meters, for which senior Nick Sullivan and sophomore Eli Givens placed second and third respectively in the CCS finals yesterday.\r\n\r\nThe girls’ lacrosse team ended its season with a win by  beating Saratoga High School in the SCVAL championships. One highlight of the season came with a <a href=\"http:\/\/palyvoice.com\/2014\/05\/12\/slideshow-girls-lax-dominates-on-senior-night\/\">big win<\/a> over Los Gatos High School on Senior Night. Another was beating St. Francis High School during the season and also in the second round of SCVAL playoffs for redemption after St. Francis ended last year's Paly season in a triple-overtime thriller.\r\n\r\nThe boys’ lacrosse team recently defeated the previously undefeated Sacred Heart Preparatory, and advanced to the SCVAL semifinals where it<a href=\"http:\/\/palyvoice.com\/2014\/05\/18\/boys-lacrosse-season-ends-in-11-10-loss-to-m-a-in-scval-semifinal\/\"> lost to<\/a> Menlo-Atherton High School in a 10-11 nail-biter.\r\n\r\n<b>National Signing Day<\/b>\r\n\r\nIn early February, Paly hosted a <a href=\"http:\/\/palyvoice.com\/2014\/02\/06\/slideshow-senior-athletes-sign-national-letters-of-intent\/\">ceremony<\/a> for seniors signing their National Letters of Intent to play collegiate sports next year. The ceremony took place in the Big Gym and was led by Earl Hansen prior to his retirement. Eight seniors who will compete at both Division I and Division III levels attended the ceremony, although many other graduating students will also play varsity-level sports next year but did not attend. Approximately 30 Paly graduates will be participating in varsity collegiate athletics next year.\r\n\r\n<b>New ASB officers <\/b>\r\n\r\nAfter an exciting and close candidate race in March, the school elected the <a href=\"http:\/\/palyvoice.com\/2014\/03\/28\/brief-associated-student-body-election-results-annouced\/\">Associated Student Body Class of 2015<\/a>. Once the election was over, the new officers sat down with The Paly Voice to reveal some <a href=\"http:\/\/palyvoice.com\/2014\/04\/22\/fun-facts-of-future-asb-officers\/\">fun facts<\/a> about themselves. In April, ASB chose <a href=\"http:\/\/palyvoice.com\/2014\/04\/06\/liu-wins-asb-presidency-amid-higher-turnout\/\">next year’s group<\/a> of appointed officers.\r\n\r\n<b>Phil Winston<\/b>\r\n\r\nAfter former Paly principal Phil Winston mysteriously resigned last summer, students were left wondering what had happened. Part of the <a href=\"http:\/\/palyvoice.com\/2014\/04\/11\/former-principal-subject-to-disciplinary-action-according-to-pa-weekly-investigation\/\">answer<\/a> came in April, when Palo Alto Weekly published an <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">article<\/a> outlining the issues related to Winston’s resignation. The article spurred a whirl of controversy among the Paly community, leaving some students pleased and other disappointed. The event was a significant moment in Paly culture, and left a large impact among the student body.\r\n\r\n<b>Prom<\/b>\r\n\r\nThis year’s Prom was different than any other ever held before: not only was it held at a new and uncommon venue, but it was also the highest attended Prom in years. Prom was held at the San Francisco Exploratorium this year, at the museum’s new location on Pier 15. Although this venue choice <a href=\"http:\/\/palyvoice.com\/2014\/04\/08\/are-prom-tickets-more-expensive\/\">made Prom tickets more expensive,<\/a> it brought a unique experience to Paly Prom-goers. Presumably as a result of its location, this year’s Prom also brought about <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/asb-carries-out-last-minute-preparations-for-record-breaking-prom\">record-breaking tickets numbers<\/a>. With combined evidence from ticket numbers and <a href=\"http:\/\/palyvoice.com\/2014\/04\/21\/opinion-prahmm-2k14-in-review\">student surveys<\/a>, this year’s Prom was one of the most successful in Paly history.\r\n\r\n<strong>Construction<\/strong>\r\n\r\nAfter an extended construction period, the new two-story classroom building and the <a href=\"http:\/\/palyvoice.com\/2014\/01\/28\/slideshow-paly-media-arts-center\/\">Media Arts Center<\/a> finally were up and available for students to glimpse into after Spring Break. Although neither will officially open until the start of the 2014-2015 school year, students have been able to tour the buildings, and some Advanced Placement tests were taken in the new classroom building. The iconic Big Gym, which will be torn down this summer, was celebrated in a “Farewell Big Gym” <a href=\"http:\/\/palyvoice.com\/2014\/03\/25\/slideshow-farewell-big-gym-event-a-fitting-celebration\/\">event<\/a> in mid-March, honoring the 85 years it held athletic events, dances and more.\r\n\r\n<b>Powderpuff<\/b>\r\n\r\nThis year’s powderpuff competition saw many changes. The ASB class under Matt Hall and <a href=\"http:\/\/palyvoice.com\/2014\/03\/19\/breaking-news-admin-selects-new-athletic-director\/\">new athletic director<\/a> Jason Fung came together this year after complaints from previous years about team selections. This year was the first year a raffle system was implemented to select the teams as opposed to leaving the selection up to each class. This year, new rules prohibited the quarterback from running and required all players to wear mouthguards. In the <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/slideshow-underclassmen-dominate-powderpuff\/\">first round<\/a>, the seniors took on the freshmen. The seniors, seemingly frazzled by the new rules and new team, fell to the freshmen, 0-7. The sophomores and juniors then faced off, and the sophomore class proved victorious, 21-0. In the finals, which occurred during a long lunch thanks to a special schedule, the sophomores crushed the freshmen to take home the title. The powderpuff final half-time featured a celebration in honor of retiring physical education teacher, football coach and athletic director Earl Hansen and Sports Literature teacher and football announcer Mike McNulty.\r\n\r\n<b>NIOS <\/b>\r\n\r\nThis April, Not In Our School’s week came to a <a href=\"http:\/\/palyvoice.com\/2014\/04\/19\/paly-to-host-annual-not-in-our-schools-week\/\">much larger forefront<\/a> than in past years with daily lunchtime activities and performances. Each day had a color and a theme, such as <a href=\"http:\/\/palyvoice.com\/2014\/04\/24\/slideshow-nios-day-three\/\">Ability Awareness<\/a>, to go along with the activities.\r\n\r\n<b>Paly alumni<\/b>\r\n\r\nPaly alumnus of the Class of 2011 Davante Adams was <a href=\"http:\/\/palyvoice.com\/2014\/05\/10\/paly-alumnus-drafted-by-the-green-bay-packers\/\">drafted<\/a> by the Green Bay Packers in the second round of this year’s NFL draft. Adams was a member of the Paly State Championship team his senior year in high school. James Franco, a member of the Class of 1996, stars in his own movie titled “Palo Alto,” which was just released. His brother, Dave Franco, a member of the Class of 2003, will appear in “22 Jump Street” this June.\r\n\r\n<strong>Field Day<\/strong>\r\n\r\nField Day, which occurred just last Friday, gave students the chance to race through inflatable obstacle courses and bungee jump higher than the Tower Building while enjoying free food. Check out a Field Day slideshow <a href=\"http:\/\/palyvoice.com\/2014\/05\/20\/slideshow-annual-field-day-a-success\/\">here<\/a>.\r\n\r\n<b>Donald Sterling <\/b>\r\n\r\nAnd to finish it off with a little bit of pop culture, let's take a look at Mr. Donald Sterling. After a series of racist remarks surfaced the internet, the owner of the Clippers' basketball team was thrown into a fire of angry backlash. Paly students <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/voice-verbatim-what-are-your-opinions-on-the-los-angeles-clippers-owners-racist-remarks\/%20 \">shared their voices<\/a>, and so did others across the map. In the end, Sterling ended up being banned for life from the National Basketball Association, as NBA commissioner Adam Silver took a firm stance against racism and united the entire country against it as well. Sterling’s consequences were met with pleasure from mass audiences who feel that such radical statements have no place in our nation’s progress.","excerpt":"The school year is finally coming to a close, and among countless projects and finals The Paly Voice wanted to take a break and remember all that has happened this past semester at Palo Alto High School.","date":"2014-05-22 17:30:14","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg","categories":["Features"],"tags":{"8410":"Baseball","10098":"basketball","8644":"diorio","15675":"donald sterling","8704":"field day","14851":"fun","8738":"Golf","8836":"Lacrosse","11162":"media arts building","19409":"new classroom building","15846":"powderpuff","9016":"prom","9110":"Soccer","9241":"wrestling"}},{"id":72280,"title":"Vandalism incidents on newly-repainted Senior Deck cause stir","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/vandalism-incidents-on-newly-repainted-senior-deck-cause-stir\/","content":"[caption id=\"attachment_72328\" align=\"alignnone\" width=\"547\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png\"><img class=\"size-full wp-image-72328\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png\" alt=\"According to an anonymous trio of juniors, some members of the junior class painted over the '2014' on the Senior Deck Monday night in response to tension on Twitter between members of the junior and senior classes. The vandalism came the Monday after senior Hayley Tawzer organized an administration-approved class activity to paint the Senior Deck in a camouflage design as a class gift. Photo courtesy of Daniel Tachna-Fram.\" width=\"547\" height=\"353\" \/><\/a> Vandals painted over the '2014' on the Senior Deck Monday night in response to tension on Twitter between members of the junior and senior classes. The vandalism came the Monday after senior Hayley Tawzer organized an administration-approved class activity to paint the Senior Deck in a camouflage design as a class gift. Photo by Daniel Tachna-Fram.[\/caption]\r\n\r\nAfter a Palo Alto High School senior organized an administration-endorsed Class of 2014 project to paint the Senior Deck over the weekend, the deck has seen two counts of vandalism, the first incident discovered Monday evening and the second this morning.\r\n\r\nSenior Hayley Tawzer, who came up with the idea to paint the deck early on in the school year, said she felt disrespected by Monday’s vandalism, in which a ‘5’ was painted in yellow, the Spirit Week color for the junior class, over the ‘4’ in the ‘2014’ painted on the top of the deck.\r\n\r\n\"I felt very disrespected as an individual and as a member of the class of 2014,\" Tawzer said.\r\n\r\nAccording to a junior who witnessed the painting of the '5' in washable paint, the alleged vandals were trying to start a junior prank after engaging in a pointed Twitter discussion between seniors and juniors over the use of the Senior Deck.\r\n\r\nThe tension between the junior and senior classes appeared to begin when some juniors used the deck Monday, a day when most of the senior class did not show up to school in observance of an unofficial \"senior cut day\". According to senior Ethan Look, social media posts by the juniors of themselves enjoying the Senior Deck prompted him to tweet the following message:\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.33.48-PM.png\"><img class=\"alignnone size-full wp-image-72281\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.33.48-PM.png\" alt=\"\" width=\"615\" height=\"313\" \/><\/a>\r\n\r\nThe witness said that the consequent Twitter conversation, of which various Paly upperclassmen and alumni were contributors, sparked a group of juniors to form a plan to retaliate by painting over part of the deck.\r\n\r\n“A bunch of people  were fed up with how the seniors were being really rude to us [on Twitter],” the anonymous junior said.\r\n\r\nWhile Look said he did not intend for his tweet to be taken literally, he did agree that the Twitter conversations contributed to the motives for the vandalism.\r\n\r\n“I certainly do think the arguments on Twitter fueled the fire,” Look said. “With my first tweet, I had no intentions of making anybody mad. I strongly believe that the next senior class deserves to inherit the deck, but I wouldn’t be a senior if I didn’t defend my turf a little.”\r\n\r\n[caption id=\"attachment_72286\" align=\"alignleft\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo1.jpg\"><img class=\"wp-image-72286\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo1.jpg\" alt=\"Students gather on the Senior Deck during seventh period Wednesday afternoon. Senior Hayley Tawzer organized the painting of the deck in a camouflage pattern for her 20 Percent Project in Erin Angell's World Literature class. On Monday night, a group of juniors allegedly painted over the '4' in the '2014' with a yellow '5', using the junior class color and graduation year for the Class of 2015. Photo by Allison Cowie.\" width=\"400\" height=\"300\" \/><\/a> Students gather on the Senior Deck during seventh period Wednesday afternoon. Senior Hayley Tawzer organized the painting of the deck in a camouflage pattern for her 20 Percent Project in Erin Angell's World Literature class. On Monday night, a group of juniors allegedly painted over the '4' in the '2014' with a yellow '5', using the junior class color and graduation year for the Class of 2015. Photo by Allison Cowie.[\/caption]\r\n\r\nAccording to Tawzer, many students thought that the painting of the deck was a senior prank and were not aware that the activity was approved by the administration and funded by ASB.\r\n\r\n“This [the repainting] was not a senior prank, it was a senior project,” Tawzer said. “It’s part of a Twenty Percent Project for Ms. [Erin] Angell,” referring to the semester-long project in which Angell’s World Literature students spend 20 percent of their time devoted to the class designing and completing a project of their choice.\r\n\r\nMembers of the junior class expressed disappointment in the alleged actions of their classmates.\r\n\r\n“I wish they [the juniors] hadn’t painted the 5 on the deck,” junior Paloma Tracy said. “When the seniors painted the deck, it was a nice gesture for the school, and it should not have been disrespected like that.”\r\n\r\n“I think it just makes our class look bad,” junior Courtney Hartwell said. “It’s not our time yet to take over as seniors.”\r\n\r\nTawzer, along with senior Talia Brown, cleaned off the yellow paint from the '5' late Monday night, she said. The scrubbing process took around one-and-a-half hours.\r\n\r\nThe deck, now restored to its fresh paint job, features a camouflage-print background and '2014' written in large white numbers across its surface.\r\n\r\n“Since the first day of school this year, my friends and other people have been talking about painting the deck and making it better,” Tawzer said. “My hope of painting the deck was that the Class of 2014 would leave behind a new tradition or legacy to the other classes to come. I meant for this to be a fun, cool way for the senior classes to bond and add their own style and class spirit to the deck when their time came.\"\r\n\r\nAccording to the junior witness, who said she watched others paint the '5', the students who allegedly painted over the deck were not trying to be disrespectful.\r\n\r\n“We weren’t trying to be disrespectful at all,” the source said. “If we knew that it would hurt their feelings or that it had anything with them trying to give a gift to the school [we wouldn’t have done it].”\r\n\r\nA second junior who took part in the vandalism added that many juniors were not happy with the design of the deck because it clearly is associated with the Class of 2014.\r\n\r\n[caption id=\"attachment_72282\" align=\"alignright\" width=\"300\"]<img class=\"wp-image-72282\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.34.16-PM.png\" alt=\"Senior Ethan Look tweeted an edited picture of the deck vandalism, adding 'PALY' over the '2014' to encourage school unity, he said. Photo courtesy of Ethan Look.\" width=\"300\" height=\"374\" \/> Senior Ethan Look tweeted an edited picture of the deck vandalism, digitally adding 'PALY' over the '2014' and '2015' to encourage school unity, he said. Photo courtesy of Ethan Look.[\/caption]\r\n\r\n“They [the seniors] decided to paint the deck and they did an awesome job, but saying its a ‘present’ to us, with a big ‘2014’ on it isn’t something we really wanted,” she said. “This is high school, so there will always be rivalries and pranks pulled on different classes. That’s what keeps things interesting.”\r\n\r\nNow that the yellow paint has been washed off, seniors are enjoying their use of the redesigned deck.\r\n\r\n“[The deck] definitely looks good, it really shows all the school spirit that our class has and it really unifies us,” senior William Yang said. “It looks freakin’ awesome, I love it.\"\r\n\r\nLook, who later tweeted an edited picture of the deck with ‘PALY’ digitally painted over the ‘2014' and '2015', stressed the importance of school unity.\r\n\r\n“When it comes down to it, we all go to Paly, and we all want the same thing: an environment that can lead us to success in the future,” Look said. “That will not come about if there is hatred between classes, and no matter how fun it is to be on the deck and rub it in to the other grades, we can’t have people sneaking into Paly to paint the deck and bullying people on the Internet.”\r\n\r\n[caption id=\"attachment_72415\" align=\"alignnone\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_20140522_094155.jpg\"><img class=\"wp-image-72415\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_20140522_094155.jpg\" alt=\"Seniors lounge on the senior deck at brunch Thursday after a red '7' was painted over the new paint job, which restored the deck when a similar vandalism incident occurred Monday in which a yellow '5' was painted over the '4' in '2014'. Photo by Charles Yu.\" width=\"400\" height=\"300\" \/><\/a> Seniors lounge on the senior deck at brunch Thursday after a red '7' was painted over the new paint job, which restored the deck when a similar vandalism incident occurred Monday in which a yellow '5' was painted over the '4' in '2014'. Photo by Charles Yu.[\/caption]\r\n\r\n<em>UPDATE:<\/em> A red ‘7’ was found painted over the ‘4’ on the Senior Deck Thursday morning. As of lunch, the ‘4’ had been repainted but red paint remains on the camouflage design. The source of the vandalism is unknown at this time. <i>More information to come<\/i>.","excerpt":"Members of the junior class vandalized the newly-painted senior deck Monday night, according to three juniors who said they participated in the painting of a yellow '5' over the '2014' logo, which was part of an administration-endorsed senior project.","date":"2014-05-22 14:56:43","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png","categories":["News","Spotlight"],"tags":{"12701":"2014","19460":"2015","8496":"ASB","19457":"erin angell","15678":"ethan look","17779":"hayley tawzer","8944":"palo alto high school","19459":"senior deck","19458":"vandalism"}},{"id":70688,"title":"Where are they now: Henry Do Hyun Kwon","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/where-are-they-now-henry-do-hyun-kwon\/","content":"[caption id=\"attachment_71976\" align=\"alignright\" width=\"312\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10355956_624726057608857_1073301666_o.jpg\"><img class=\"wp-image-71976\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10355956_624726057608857_1073301666_o.jpg\" alt=\"Henry Do Hyun Kwon takes a picture from his new home in South Korea. Photo by Henry Do Hyun Kwon. \" width=\"312\" height=\"181\" \/><\/a> Henry Do Hyun Kwon takes a picture from his new home in South Korea. Photo by Henry Do Hyun Kwon.[\/caption]\r\n\r\n5,820 miles <span class=\"st\">—<\/span> this is the distance that former Palo Alto High School student Henry Do Hyun Kwon traveled when he moved moved back to his native country, South Korea, this winter. After first coming to Palo Alto in 2011, Kwon spent three years of school at Paly. While Kwon's time in Palo Alto was short-lived, he said that he really enjoyed his time living the \"California\" lifestyle and felt that Palo Alto was the best place in which he has ever lived.\r\n\r\nMost of all, Kwon enjoyed Palo Alto's \"great weather, great food and great people.\" During his time here, Kwon was an active, high-achieving student. Kwon played badminton and tennis, took \"inspirational\" adventures through state parks and made some of \"the best relationships [he] might ever make.\" Although Kwon was sad about losing his new friends in the move back to South Korea, he has been able to stay in touch through social media and believes that the friendships he made will last for a lifetime.\r\n\r\n<em>The Paly Voice<\/em> decided to catch up with Kwon via Facebook to find out more about the differences between life in Palo Alto and South Korea.\r\n\r\nThe Paly Voice: Why did you have to move between the U.S. and South Korea?\r\n\r\n<span class=\"Apple-style-span\">Henry Do Hyun Kwon: I went to the U.S. in February of 2011 due to my dad's job and left in January of 2014 for the same reason. <\/span>\r\n\r\nTPV: Where do you live in South Korea?\r\n\r\nHDHK: Now I live in Gangnam, which is a district of Seoul, the capital city of South Korea.\r\n\r\nTPV: Can you describe your typical day in South Korea?\r\n\r\n<span class=\"Apple-style-span\">HDHK: I wake up at 6:30 in the morning, wash up, eat breakfast and bike to school. School starts at 7:50 and ends at 4:10 everyday except Fridays, when school ends at 3:10. Most 11th and 12th graders in Korea are required to stay after school and study until night, but my school lets students go early because most students go to \"hagwons,\" after school private classes and tutoring sessions. As for me, I don't go to \"hagwons\" yet, but when I get home, I take online classes, which is another studying trend here in Korea. For free time, I usually play computer games. I eat dinner around 7:30 to 8 and go to sleep 12 [midnight] to 1 a.m. <\/span>\r\n\r\n[caption id=\"attachment_72465\" align=\"alignright\" width=\"478\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10384969_625200674228062_98041656_n.jpg\"><img class=\"wp-image-72465\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10384969_625200674228062_98041656_n.jpg\" alt=\"Henry Do Hyun Kwan, former Paly student, stands with his new class in South Korea. \" width=\"478\" height=\"269\" \/><\/a> Henry Do Hyun Kwan, former Paly student, stands with his new class in South Korea. Photo by Jung-Soo Lee.[\/caption]\r\n\r\nTPV: What are the academic differences between the U.S. and South Korea?\r\n\r\n<span class=\"Apple-style-span\">HDHK: School operates quite differently in Korea. First of all, the teachers are the ones moving around classrooms, not the students. Schedules are not adjustable. Students must decide on a curriculum track between the natural sciences and liberal arts. Also, Korean schools are greatly influenced by parents. Currently, many schools in Korea are either single-sex schools. My school has both sexes, but the classes are separated by gender. Korean schools have four big tests in a school year — a midterm and a final for each semester. Teachers in Korea like to make tests extremely hard, especially math teachers. The 11th grade average for the math midterm this year in my school is expected to be around 30%. Usually there's not too much school homework in my school, which is a decision regarding the homework from \"hagwons.\" Korean high school students lack time from the intense studying. A survey revealed that the average sleeping hours for Korean highschoolers is about five hours and 30 minutes. One positive thing here is that lunch is 70 minutes long. <\/span>\r\n\r\nTPV: How do students choose an academic path, and how does it affect their curriculum and future jobs?\r\n\r\nHDHK: Students decide their academic paths based on their future plans, their previous grades, interests, etcetera. And those who can't decide will take tests in order to find out which path they choose. Students usually make up their minds when they enter high school [entering 10th grade]. The curriculum gets divided in 11th grade. You aren't necessarily \"locked in\" to a specific career, but you pretty much get restrained in your future plans. For example when you choose the liberal arts curriculum, you are not very likely to choose a mathematic or scientific based major in college. Most importantly, students take different high school entrance exams based on what curriculum you were in, and the Korean high school entrance exam is the most common path students take to go to college.\r\n\r\n[caption id=\"attachment_72466\" align=\"alignleft\" width=\"419\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10388456_625200594228070_308612990_n.jpg\"><img class=\"wp-image-72466\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10388456_625200594228070_308612990_n.jpg\" alt=\"Henry Do Hyun Kwon poses for a pictures with two of his classmates in South Korea. \" width=\"419\" height=\"314\" \/><\/a> Henry Do Hyun Kwon poses for a pictures with two of his classmates in South Korea. Photo by Jung-Soo Lee.[\/caption]\r\n\r\nTPV: What are some social differences between the U.S. and South Korea?\r\n\r\n<span class=\"Apple-style-span\">HDHK: In America, everyone needs a car. We need to drive in order to dine out or go grocery shopping. But in Korea, my family doesn't even have a car yet. Daily life is possible without a car. Instead, public transportation is highly developed. Housing in Korea is mostly apartments. Wherever you go in Korea, you are bound to find apartments — from the little ones, five stories tall, to 40-story apartments. Some call Korea \"a forest of apartments.\" In Korea, delivery food is very developed. Most fast food restaurants deliver, including McDonald's and Dominoes. The most popular delivery food here is probably chicken.<\/span>\r\n\r\nTPV: What do you and your friends do for fun?\r\n\r\n<span class=\"Apple-style-span\">HDHK: Social life is not that different here in Korea. When we hang out, we can go to the theater or play games. The most popular thing is to go to \"PC cafes\" to play computer games. <\/span>\r\n\r\nTPV: What kind of music and movies are popular?\r\n\r\n<span class=\"Apple-style-span\">HDHK: Koreans love watching movies of different genres. Some popular foreign movies in Korea are \"Amazing Spiderman 2,\" \"Rio 2,\" \"Captain America: The Winter Soldier,\" \"Divergent\" and \"Mr. Peabody and Sherman\" — all in the top 10 movies currently. The music trend in Korea currently is dominated by \"Akdong Musician,\" a sibling duo who won the Korean audition show \"Kpop Star\" season two. Unlike the stereotype that Koreans only listen to pop, the \"Korean style ballad\" and R&amp;B music is also popular. And so is Disney music, such as \"Let It Go.\"<\/span>\r\n\r\nTPV: Would you consider moving back to California in the future?\r\n\r\nHDHK: <span style=\"color: #3e454c;\">I think I will definitely live in California in the future if I have the choice to do so, and it would be even better to study in the states as a college or graduate student.<\/span>","excerpt":"Find out about a former Paly student's life in South Korea. ","date":"2014-05-22 12:38:39","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10355956_624726057608857_1073301666_o.jpg","categories":["Features","Spotlight"],"tags":{"17805":"henry do hyun kwon","17806":"south korea"}}]