[{"id":76859,"title":"Opinion: Teachers, we&#8217;ve got spirit, how &#8217;bout you?","permalink":"http:\/\/palyvoice.com\/2014\/10\/21\/opinion-teachers-weve-got-spirit-how-bout-you\/","content":"[caption id=\"attachment_76861\" align=\"aligncenter\" width=\"642\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg\"><img class=\" wp-image-76861\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg\" alt=\"Decked out in her superhero attire from last year's Spirit Week, a Palo Alto High School junior expresses the workload she wishes she will not have during the week-long event. Photo by Jeanette Wong.\" width=\"642\" height=\"430\" \/><\/a> Decked out in her superhero attire from last year's Spirit Week, a Palo Alto High School junior expresses the workload she wishes she will not have during the week-long event. Photo by Jeanette Wong.[\/caption]\r\n\r\nTo-do list: Write an English essay. Hunt down Spirit Week outfit. Memorize Spanish vocabulary. Help with float building. Study for Monday morning math test. Sound familiar?\r\n\r\nThe combination of Spirit Week with the already present academic workload can make for an overwhelming experience.\r\n\r\nWhile I recognize the immense time and effort teachers put into creating lesson plans for us, I believe students should have a test-free, stress-free Spirit Week.\r\n\r\nSpirit Week is the one week that the entire student body (or the majority, at least) is involved in a single activity, and many can agree this event generates a sense of pride for both one’s respective class and Palo Alto High School itself. By drawing out the competitiveness in all of us, Spirit Week gets us involved and encourages us to work together towards the common goal of securing bragging rights for being Spirit Week champions. It’s a week for students to have fun and enjoy the high school experience.\r\n\r\nTests, projects, presentations and other major assignments can detach people from the full Spirit Week experience. Instead of being on the bleachers cheering for their class, some students may find themselves stressing over a test or scrambling to put the finishing touches on a project.\r\n\r\nOf course, wishing for a full week of school without any homework at all would be absurd. But in the spirit of Spirit Week, teachers should reserve the three class periods during that week for relatively less rigorous activities. By doing so, teachers will relieve students of the additional stress associated with tests and huge assignments.\r\n\r\nAs Pink Floyd sings, “Teachers, leave them kids alone” (at least during Spirit Week). Allow us to release our energy and scream our hearts out at the pep rallies without the thought of tests nagging at the back of our minds. With only four years at Paly, we should be able to optimize our time here by living it up during Spirit Week.\r\n\r\nSo I respectfully say, teachers, please show your Paly spirit by giving us space during Spirit Week.","excerpt":"Spirit Week generates a sense of pride for both one’s respective class and Palo Alto High School itself. Teachers should \"leave them kids alone,\" as Pink Floyd sings, and allow students to fully enjoy the event without worrying about tests and other major assignments.","date":"2014-10-21 18:56:27","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg","categories":["Opinion","Spotlight"],"tags":{"9119":"Spirit Week","9128":"Stress"}},{"id":76841,"title":"Injuries derail cross country teams&#8217; promising season","permalink":"http:\/\/palyvoice.com\/2014\/10\/21\/injuries-derail-cross-country-teams-promising-season\/","content":"Although injuries to key contributors have limited the performance of the Palo Alto high school’s boys’ and girls’ cross country teams, coaches say both are nearing full recovery and look to compete at full strength for next week’s match versus rival school Gunn.\r\n\r\nBoys’ cross country coach Kelsey Feeley says the team will be back to health soon.\r\n\r\n“Two of our returners from the top seven varsity squad have been out all season,” Feeley said. “One [Junior Samuel Desré] ran on Friday and did really well . He was given [physical] parameters [by his doctor], but still ran a great race, and our other one, [sophomore] Kent Slaney will be hopefully able to run next week.”\r\n\r\nAlthough the injuries have prevented the team from placing higher in meets, Feeley said she sees many improvements this season.\r\n“We’ve had some young and older kids step up across the board,” Feeley said. “Theres been a ton of improvement since the beginning of the season, and I am excited to see how the second half goes.”\r\n\r\nThe girls’ cross country team is also recovering currently, and reaping the positive effects of having healthy runners. Senior girls’ cross country runner Kylie Wilson thinks injuries have played a huge role in the both teams’ performance this season.\r\n\r\n“Because so many of the varsity runners are injured both boys’ and girls’ teams are not doing as well as we could be doing,” Wilson said. “But for so many people injured, we’re doing ok.”\r\n\r\n“We have everybody back and relative healthy,” girls’ cross country coach Paul Jones said. “We finished 6th out of 42 teams at our last meet at Toro Park.”\r\n\r\nJones has a positive outlook on the season, with high expectations for the Santa Clara Athletic Valley League and the Central Coast Selection.\r\n\r\n“We’ll finish in the top four or definitely should, which means we qualify for CCS as a team … We’ll probably have up to three all leaguers [at SCAVLS].”\r\n\r\nBoys’ and girls’ cross country will compete at 3 p.m. today at the Sunnyvale Baylands.","excerpt":"Although injuries to key contributors have limited the performance of the Palo Alto high school’s boys’ and girls’ cross country teams, coaches say both are <a href=\"http:\/\/palyvoice.com\/2014\/10\/21\/injuries-derail-cross-country-teams-promising-season\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-21 14:47:26","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photos.jpg","categories":["Sports"],"tags":[]},{"id":76504,"title":"Alumnus helps develop phone case to deter sexual assault","permalink":"http:\/\/palyvoice.com\/2014\/10\/20\/alumnus-helps-develop-phone-case-to-deter-sexual-assult\/","content":"[caption id=\"attachment_76505\" align=\"aligncenter\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/542db692af9e5c4227c9e0f0_Keychot-Render.62-1-clear.png\"><img class=\"wp-image-76505\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/542db692af9e5c4227c9e0f0_Keychot-Render.62-1-clear.png\" alt=\"The Whistl enables users to counter sexual offenders in three different modes: Check-in mode, Panic mode and Stealth mode. Photo courtesy of Lifeshel.com \" width=\"620\" height=\"321\" \/><\/a> The Whistl enables users to counter sexual offenders in three different modes: check-in mode, panic mode and stealth mode. Photo courtesy of Lifeshel.com[\/caption]\r\n\r\nA former Palo Alto High School student is involved in kickstarting his company Lifeshel's first product, Whistl: a smartphone case that aims to prevent sexual violence.\r\n\r\nWith a click of a button, the case allows the user to instantly notify the police through Bluetooth, activate a bright light and a very loud alarm, and record video and audio evidence.\r\n\r\nAlan Fu, Class of 2009, helped create Whistl. According to Fu, the case was developed to make assistance in preventing sexual assault more readily available.\r\n\r\n“We [Lifeshel] designed the Whistl alongside an advocacy group called Pittsburgh Action Against Rape,” Fu said. “As a teen, you may have trouble with confrontation. We prefer to talk it out over messengers, email, text. Sexual assault is a tough topic to be confrontational about. We want to engage your support network through the click of a button to make it easier for you to reach out and get the help you need right when you need it.”\r\n\r\nFu has played a crucial role in the success of Lifeshel and its product.\r\n\r\n“My role is technically Chief Operating Officer,” Fu said. “This means that I manage our teams to hit design deadlines and our ship date in July 2015. In addition to managing operations of the team, I also handle our finances, our intellectual property protection, as well as our corporate legal matters.”\r\n\r\nAccording to Fu, the <a href=\"https:\/\/www.kickstarter.com\/projects\/lifeshel\/whistl-a-smartphone-case-that-aims-to-deter-sexual?ref=nav_search\" target=\"_blank\">Kickstarter<\/a> campaign to raise enough money to launch the product has been successful so far, having raised over 50 percent of their goal of $70,000 in only a week.\r\n\r\n“We're hoping to drive momentum as more press is picking up our story,” Fu said.\r\n\r\nFu believes that the product can potentially benefit Paly students.\r\n\r\n“Paly students for the most part fortunately live in a very safe part of the country,” Fu said. “The Whistl helps both us and our parents feel safer about walking back home from school, going to parties and other aspects of life.”\r\n\r\nFu also says that his time at Paly has helped shape his early success.\r\n\r\n“At Paly, there's a distinct feeling that the people that go here can change the world,” Fu said. “We aren't afraid to talk about local, national or global issues. We don't hesitate to speak up and act. I think that's a unique facet of Paly culture that I'm proud of.”\r\n\r\nFor more information about the product, check out Lifeshel's <a href=\"http:\/\/lifeshel.com\/\">website<\/a>.","excerpt":"A former Palo Alto High School student is involved in the kickstarting of his company Lifeshel's first product, Whistl: a smartphone case that aims to prevent sexual violence.","date":"2014-10-20 21:01:24","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/542db692af9e5c4227c9e0f0_Keychot-Render.62-1-clear.png","categories":["News","Spotlight"],"tags":{"30319":"alan fu","29838":"alumnus","11978":"app","30322":"case","8793":"iphone","30321":"lifeshel","8944":"palo alto high school","8953":"paly","14283":"sexual assault","29623":"smartphone","30320":"whistl"}},{"id":76586,"title":"MAC grand opening day 1: Interviews","permalink":"http:\/\/palyvoice.com\/2014\/10\/19\/mac-grand-opening-day-1-interviews\/","content":"The Paly Voice interviewed attendees of day 1 of the grand opening of Palo Alto High School's Media Arts Center. The evening's event featured a speaker panel with the founder of The Huffington Post Arianna Huffington, founder of IDEO David Kelley and Vice Chairman of the Newseum Shelby Coffey. Kara Swisher, editor of technology news site Re\/code, moderated the panel.\r\n\r\nTo skip to a particular attendee's interview, Kara Swisher starts at 0:00; Alison Coffey, daughter of Shelby Coffey, and Palo Alto Weekly's Jay Thorwaldson at 1:17; Shelby Coffey at 2:52; David Harris, executive director of the <a href=\"http:\/\/palyvoice.com\/2014\/09\/25\/local-nonprofit-invites-community-to-step-out-of-your-world\/\" target=\"_blank\">Global Lives Project<\/a>, at 4:09; and Susan Wojcicki, CEO of YouTube, at 5:52.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/tFBH5fA0ydY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice interviewed attendees of day 1 of the grand opening of Palo Alto High School's Media Arts Center.","date":"2014-10-19 20:15:24","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-19-at-3.51.01-PM.png","categories":["Video"],"tags":{"30325":"alison coffey","29219":"david harris","29222":"global lives project","30326":"jay thorwaldson","30327":"kara swisher","18366":"mac","11127":"media arts center","30029":"Newseum","8944":"palo alto high school","8952":"palo alto weekly","30328":"recode","30324":"shelby coffey","30323":"shelby coffey iii","30329":"susan wojcicki","11976":"youtube"}},{"id":76739,"title":"PAUSD celebrating Unity Day on Oct. 23 for National Bullying Prevention Month","permalink":"http:\/\/palyvoice.com\/2014\/10\/19\/pausd-celebrating-unity-day-on-oct-23-for-national-bullying-prevention-month\/","content":"","excerpt":"","date":"2014-10-19 11:33:36","author":"Lizzie Chun","categories":["Ticker"],"tags":{"30528":"national bullying prevention month","9197":"unity day"}},{"id":76720,"title":"Fall concert is a &#8220;ritual&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/fall-concert-is-a-ritual\/","content":"Palo Alto High School's choir will be singing at 4 p.m. tomorrow at Grace Lutheran Church for the “Ritual” fall <a href=\"http:\/\/http:\/\/palychoirs.com\/events\/ritual-a-fall-concert-presented-by-the-palo-alto-high-school-choral-program\/\">concert.<\/a>\r\n\r\nThis fall’s theme includes songs from customs, ceremonies and spirituals according to choir director Michael Najar.\r\n\r\nMany different groups involved with Paly choir will sing tomorrow, including Madrigal Singers, Spectrum Singers, Beginning Choir, Men’s Chorus and a cappella groups.\r\n\r\n“Heartbeats is starting off the year by singing Mr. Sandman by the Chordettes,\" senior Claire Chevallier said. \"We chose this song because it sticks to our style, and we wanted to begin with a more traditional option. In concert choir, we're singing a variety of spirituals as well as some more contemporary songs.”\r\n\r\nChoir co-president Grant Smith is excited for the concert and thinks everyone will be able to enjoy it.\r\n\r\n\"T<span style=\"color: #3e454c;\">he concert is titled 'Ritual,' and all the songs we are singing were really important to a certain people at one point,\" Smith said. \"It's a really nice upbeat mix of spirituals, pop a cappella and just some just really beautiful a cappella the a cappella groups will be there to debut the stuff they've been working really hard on, too. I think it will be a really nice concert with something for everyone to enjoy.\"<\/span>\r\n\r\nThis will be the first Paly choir concert for the freshmen singers, and they are looking forward for it to all come together.\r\n\r\n“I'm so excited to hear how 'Soon Ah Will Be Done' is going to sound with the freshmen, especially with the great acoustics in the church,” sophomore Emily Read said.\r\n\r\nTickets are sold at the door: $10 for adults and $5 for students and seniors. Children under 12 get in for free.\r\n\r\n&nbsp;","excerpt":"Paly Choir's fall concert is tomorrow featuring music from customs and ceremonies that are famous and generally upbeat. Tickets are sold at the door at Grace Lutheran Church at 4 p.m.","date":"2014-10-18 22:10:27","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/14138647541_ddd91b8a4a_z.jpg","categories":["News"],"tags":{"8583":"choir","8613":"concert","8693":"Fall","30526":"najar","30527":"paly choirs","30525":"rituals"}},{"id":76711,"title":"MAC grand opening day 3: Exclusive interview with Betsy Franco","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-exclusive-interview-with-betsy-franco\/","content":"The Paly Voice interviewed Palo Alto High School alumnus James Franco's mother Betsy Franco, in a video exclusive below. Franco graduated from Paly in 1996 and featured his film adaptation of his poetry in a 50-minute video for the third day of the Media Arts Center grand opening.\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/mckl-jfarLI\" frameborder=\"0\" allowfullscreen><\/iframe>","excerpt":"The Paly Voice interviewed Palo Alto High School alumnus James Franco's mother Betsy Franco, in a video exclusive below. Franco graduated from Paly in 1996 and featured his film adaptation of his poetry in a 50-minute video for the third day of the Media Arts Center grand opening.","date":"2014-10-18 18:55:28","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-18-at-6.55.15-PM.png","categories":["Multimedia","Video"],"tags":{"30390":"betsy franco","8706":"film","8801":"james franco","18366":"mac","11127":"media arts center","8944":"palo alto high school","30391":"poetry"}},{"id":76485,"title":"Art Center to host Global Family Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/art-center-to-host-global-family-day\/","content":"[caption id=\"attachment_76600\" align=\"alignnone\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_20141017_165050.jpg\"><img class=\" wp-image-76600\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_20141017_165050.jpg\" alt=\"Global family day will take place at the Palo Alto Art Center on 1313 Newell Road from 2 p.m. to 5 p.m. tomorrow.  Admission is free.  Photo by Saba Moussavian.\" width=\"587\" height=\"440\" \/><\/a> Global family day will take place tomorrow at the Palo Alto Art Center on 1313 Newell Road. Admission is free. Photo by Saba Moussavian.[\/caption]\r\n\r\nThe Palo Alto Art Center will be hosting a free Global Family Day from 2 p.m. to 5 p.m. tomorrow.\r\n\r\nThe event will include art-making activities from 2 p.m. to 4 p.m. and dance performances from 4 p.m. to 5 p.m. by <a href=\"http:\/\/www.xpressionsdancemusic.com\/site\/home\/\">Xpressions<\/a>, an Indian dance group, and <a href=\"https:\/\/sites.google.com\/site\/folkloricdancetroop\/\">Raice De Mexico<\/a>, a Mexican folkloric dance group, according to the Art Center <a href=\"https:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/artcenter\/cals.asp?ViewBy=7&amp;CalDate=10\/19\/2014&amp;EventDateID=9617\">website<\/a>.\r\n\r\n[caption id=\"attachment_76598\" align=\"alignright\" width=\"369\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg\"><img class=\"wp-image-76598 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg\" alt=\"Indian dance group Xpressions performs at the reopening of the Palo Alto Art Center.  Xpressions along with Mexican folkloric dance group Raice De Mexico will perform at Global Family day on Sunday.  Photo courtesy of Palo Alto Art Center.\" width=\"369\" height=\"277\" \/><\/a> Indian dance group Xpressions performs at the reopening of the Palo Alto Art Center. Xpressions, along with Mexican folkloric dance group Raice De Mexico, will perform at Global Family Day on Sunday. Photo courtesy of Palo Alto Art Center.[\/caption]\r\n\r\nAlthough the Art Center has hosted fall festivals in the past, this is the first year that the event will have a world culture theme, according to Art Center Family Programming and Outreach Coordinator Tasmia Zahra Hussain.\r\n\r\n“We really wanted to think of ideas on how we can bring a more diverse audience to the Art Center and make it a more welcoming place for people from different cultures,” Hussain said. “We have art activities from all different cultures so people can kind of feel like they can relate.”\r\n\r\nThe dances are all performed by children and teens who dress up in costumes, according to Hussain.\r\n\r\n“It’s a great way to introduce all the different dances from the different parts of the world to our audience,” Hussain said. “It’s a wonderful experience for the whole family.”\r\n\r\nHussain says the activities are catered to all ages.\r\n\r\n“All the art activities are designed in a way where they can adapt to all different age groups,” Hussain said. “Young people can adapt to it just like the older people.”\r\n\r\nHussain says the Art Center is expecting a high turnout and that she is looking forward to tomorrow's event.\r\n\r\n“It’s a great way of spending an afternoon of just art making,” Hussain said. “I hope to see some Paly students there.”","excerpt":"The Palo Alto Art Center will be hosting a free Global Family Day from 2 p.m. to 5 p.m. tomorrow.","date":"2014-10-18 18:48:33","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg","categories":["News"],"tags":{"8626":"dance","30385":"global family day","8940":"palo alto art center","30387":"raice de mexico","30388":"tasmia zahra husssain","30386":"xpressions"}},{"id":76688,"title":"MAC grand opening day 3: Interviews","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-interviews\/","content":"The Paly Voice interviewed attendees in line for day 3 of the Media Arts Center grand opening today. The event featured introductions from The Campanile adviser Esther Wojcicki and James Franco, who graduated from Paly in 1996. Franco is currently showcasing an artistic short film he created.\r\n\r\nUpdate: The Paly Voice also interviewed Franco's mother, Betsy Franco, in a video exclusive <a href=\"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-exclusive-interview-with-betsy-franco\/\" target=\"_blank\">here<\/a>.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/Tbw5E9uA0P4?list=UUVOXMqsivga_Tqan2Iuqr6w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice interviewed attendees in line for day 3 of the Media Arts Center grand opening today. The event featured introductions from The Campanile adviser Esther Wojcicki and James Franco, who graduated in 1996.","date":"2014-10-18 18:21:50","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-18-at-6.19.32-PM.png","categories":["Spotlight","Video"],"tags":[]},{"id":76383,"title":"Livestream: MAC Grand Opening &#8211; Day 3","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/livestream-mac-grand-opening-day-3\/","content":"The final day of the MAC Grand Opening closes with guest speaker actor and Palo Alto High School alumnus James Franco. Franco will feature his artwork inspired by Paly yearbook photos at the event, as well as debuting his 50-minute music video.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/wCYevJNbtW0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The final day of the MAC Grand Opening closes with guest speaker actor and Palo Alto High School alumnus James Franco. Franco will feature his <a href=\"http:\/\/palyvoice.com\/2014\/10\/18\/livestream-mac-grand-opening-day-3\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-18 17:04:20","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg","categories":["Multimedia"],"tags":{"29994":"1993","30024":"3","8493":"art","8494":"arts","30014":"as","8570":"center","9679":"day","30012":"debut","29992":"franco","30010":"grand","30016":"happened","30015":"it","29991":"james","8801":"james franco","27721":"lifestream","27175":"live","27174":"livestream","18366":"mac","30011":"media","8904":"mural","8906":"music","9677":"opening","30013":"painting","8939":"palo alto","8953":"paly","29648":"show","9208":"video"}}]