[{"id":72649,"title":"Slideshow: Media Arts ribbon-cutting highlights annual school picnic","permalink":"http:\/\/palyvoice.com\/2014\/08\/23\/slideshow-media-arts-ribbon-cutting-highlights-annual-school-picnic\/","content":"The Palo Alto High School Parent Teacher Student Association hosted the annual Welcome-Back-to-School dinner on Thursday evening, featuring the ribbon-cutting ceremony for the new Media Arts Center, student performances and food trucks.\r\n\r\nPrincipal Kim Diorio, Paly journalism advisers Paul Kandell and Esther Wojcicki, former California State Senator Joe Simitian and Palo Alto Unified School District Board of Education President Barb Mitchell spoke during the ceremony.\r\n\r\nEach thanked the numerous people involved in the MAC project, including past Principal Jacqueline McEvoy, the boosters, previous advisers Ellen Austin and Mike McNulty, the Facilities Steering Committee, the school Board, Paly administration, the architects and various donors.\r\n\r\nAccording to Wojcicki, there will also be a three day-long grand opening of the MAC starting Oct 16.\r\n\r\nArianna Huffington, founder of The Huffington Post, will attend the event on Oct. 16, and Paly alumnus James Franco will be there on Oct. 18, according to Wojcicki.\r\n\r\nGlobal Voices, which \"curate[s], verif[ies] and translate[s] trending news and stories you might be missing on the Internet, from blogs, independent press and social media in 167 countries,\" <a title=\"Global Voices\" href=\"http:\/\/globalvoicesonline.org\/about\/\" target=\"_blank\">according to its website<\/a>, will be there for a week and will be featured on Oct. 17.\r\n\r\n[slideshow post_id=72649]","excerpt":"The Palo Alto High School Parent Teacher Student Association hosted the annual Welcome-Back-to-School dinner on Thursday evening, featuring the ribbon-cutting ceremony for the new Media Arts Center, student performances and food trucks.","date":"2014-08-23 10:16:26","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/DSC_0091.jpg","categories":["Slideshow","Spotlight"],"tags":{"22661":"back to school dinner","18366":"mac","11127":"media arts center","22663":"ribbon cutting","9107":"slideshow","22662":"welcome back to school"}},{"id":72651,"title":"Admin: Adam Paulson selected as new Dean of Students","permalink":"http:\/\/palyvoice.com\/2014\/08\/21\/admin-adam-paulson-selected-as-new-dean-of-students\/","content":"","excerpt":"","date":"2014-08-21 23:34:08","author":"Lizzie Chun","categories":["Ticker"],"tags":{"22665":"adam paulson","22666":"admin","22664":"dean of students","11237":"tosa"}},{"id":72640,"title":"Media Arts Center to receive grand opening","permalink":"http:\/\/palyvoice.com\/2014\/08\/21\/media-arts-center-to-receive-grand-opening\/","content":"[caption id=\"attachment_72645\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png\"><img class=\"size-full wp-image-72645\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png\" alt=\"A sign announcing the Welcome-Back-To-School Dinner hangs on a portable in the Quad. Photo by Emma Chiu.\" width=\"600\" height=\"318\" \/><\/a> A sign announcing the Welcome-Back-To-School Dinner hangs on a portable in the Quad. Photo by Emma Chiu.[\/caption]\r\n\r\nAfter about three years of construction, the grand opening of Palo Alto High School’s new Media Arts Center will be held late Thursday afternoon, before the annual Welcome-Back-to-School dinner.\r\n\r\nThe approximately 15-minute ceremony will begin at 5 p.m. at the MAC with an opening from Paly Principal Kim Diorio, followed by some words by Palo Alto Unified School District Board of Education President Barb Mitchell, according to head of Media Arts Boosters Debbie Crouch.\r\n\r\n“The Welcome-Back picnic is kind of what drove us to have the ribbon cutting at that time because we’d have a group of people on campus,” Crouch said.\r\n\r\nDiorio and Mitchell will thank members of the district office who were involved, the people who ran the construction project and the Brin-Wojcicki Foundation, which has <a title=\"Brin-Wojcicki Donation\" href=\"http:\/\/palyvoice.com\/2014\/03\/25\/foundation-donates-funds-for-media-arts-equipment\/\" target=\"_blank\">donated<\/a> around $80,000 for extra equipment in the building’s classrooms, computer lab, kitchen, atrium and more. The foundation’s donation was an icing on the cake to the $50,000 already raised by boosters, $10 million paid for by Measure A and a $2.7 million state Career-Technical Education grant the project won.\r\n\r\nAccording to Crouch, the ceremony will end with an official ribbon-cutting by Diorio, Crouch and others to officially complete the project that was kicked off by the passage of Measure A in June 2008. These representatives of the long-term project will even use official scissors for the occasion.\r\n\r\n“The boosters bought the big ceremonial scissors that are 38 inches tall so a lot of people can hold on to them,” Crouch said.\r\n\r\nAs an administrator who has been involved with the MAC project for quite some time, Diorio is enthusiastic about the opening of the building.\r\n\r\n“I’m really excited about this building and this space because I think it’s really innovative and creative in nature and in design,” Diorio said. “I think obviously it was built to showcase our media arts programs ... but I think it will be more than that. Not just a classroom space, but a space the whole school will benefit from because there’s a lot of smaller spaces within the building that people can go to [and] collaborate.”\r\n\r\nDiorio also anticipates the building to be used not just for classroom purposes, but for meetings and event hostings as well.\r\n\r\n“We’re gonna use it [the MAC] for staff meetings, [and] we’ll use that atrium area for a lot of events,” Diorio said. “I think the Media Arts boosters are working on lining up some different speakers. Because it can hold about 150-200 people, we can easily seat that, and that’s just on the ground floor.”\r\n\r\nTo continue the celebration of the MAC’s grand opening, the PTSA will be hosting the annual Welcome Back Dinner at the Quad. As a new experiment this year, the food will be provided entirely by food trucks.\r\n\r\n“We’ll cut the ribbon and then folks can do a couple of things,” said head of district public relations Tabitha Hurley Kappeler. “They can either go back over to the Quad where there will be the food trucks, or they can do tours [of the MAC].”\r\n\r\nAccording to Diorio, the event has used the same caterer for many years and the PTSA just wanted to do something a little different and a little more exciting.\r\n\r\n“She [ PTSA President Barb Schroeder] approached me back in the spring and said, ‘What if we did food trucks’ and I said ‘sure, let’s try it,’” Diorio said.\r\n\r\nAccording to the Paly Link bulletin email, the dinner will include Takoz Mod Mex-Mexican, Rice Rockit (Filipino\/Hawaiian Fusion) and Paddy Wagon Sliders. Lastly, Kona Ice-Shaved Ice will have a parking spot on the Quad to serve dessert.\r\n\r\nThe Welcome Back Dinner will also include a number of performances from student groups, including the dance and cheer teams, as well as Paly’s own band and choir.\r\n\r\n“Given the two new buildings being open and the food trucks and the student performances, it should be a fun night,” Dioro said.","excerpt":"After about three years of construction, the grand opening of Palo Alto High School’s new Media Arts Center will be held late Thursday afternoon, before <a href=\"http:\/\/palyvoice.com\/2014\/08\/21\/media-arts-center-to-receive-grand-opening\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-08-21 00:12:15","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/welcome-back-dinner-sign.png","categories":["News","Spotlight"],"tags":[]},{"id":72581,"title":"Construction limits space in Embarcadero lot","permalink":"http:\/\/palyvoice.com\/2014\/08\/20\/construction-limits-space-in-embarcadero-lot\/","content":"[caption id=\"attachment_72587\" align=\"alignright\" width=\"357\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-7.jpg\"><img class=\"wp-image-72587\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-7.jpg\" alt=\"Construction of the new building has taken over part of the previous Embarcadero lot. Photo by Maddy Jones.\" width=\"357\" height=\"267\" \/><\/a> Construction of the new Palo Alto High School Performing Arts Center has taken over part of the previous Embarcadero Road lot. Photo by Maddy Jones.[\/caption]\r\n\r\nPalo Alto High School students and faculty alike are learning to cope with the loss of parking space after construction on the new Performing Arts Center began over the summer, blocking off a portion of the Embarcadero Road parking lot.\r\n\r\nThe construction of the Performing Arts Center has taken up 107 parking spots from the Embarcadero lot, most of which were staff parking, and has caused the administration to paint 65 new staff parking spaces in the lot. Students have also gained 27 parking spaces to compensate for the loss of space in the Embarcadero Road lot; however, these spaces are on the other side of campus in the Churchill Avenue lot, where maintenance workers used to park. Once new construction for the Big Gym begins, 32 more spots will be lost from the Churchill parking lot. According to Assistant Principal Jerry Berskon, the combined construction of both the Big Gym and the Performing Arts Center will cause a net loss of 112 parking spaces.\r\n\r\nDue to the reduced number of spaces this year, parking permits will first be issued to seniors only. Seniors can pick up parking permit applications starting August 21 in the Auditor's Office, but it will be three weeks until enforcement of parking permits begins for the Paly lots, according to Berkson. The Associated Student Body, which decides the cost of a parking permit, has set the price for a parking permit at 120, as opposed to last year's price of 80 dollars.\r\n\r\n[caption id=\"attachment_72583\" align=\"alignleft\" width=\"229\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-3.jpg\"><img class=\"wp-image-72583\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-3.jpg\" alt=\"The gate to the bike path can be found behind the history 300 building. This can be used by students to access Town and Country across the street. Photo by Maddy Jones.\" width=\"229\" height=\"306\" \/><\/a> The gate to the bike path going along the train tracks can be found behind the 300 history building. This can be used by students to access Town and Country Village across the street. Photo by Maddy Jones.[\/caption]\r\n\r\n“It will be seniors only to start,\" Berkson said. \"If we figure out that there’s X amount left over, then we’ll probably have a lottery for juniors. Either that or other creative ideas: maybe there’s Monday-Wednesday-Friday and Tuesday-Thursday parking permits. We’re trying to be as fair as possible without it being crazy.”\r\n\r\nBerkson added that there will probably be 32 temporary parking permits handed out as well for spots that will be taken away once the Big Gym project begins during winter break.\r\n\r\nWithin the first week of school the limited number of spots has inconvenienced many driving-aged Paly students, like senior Megan Valencia. Since enforcement of parking permits has not begun, the imbalance between the greater number of students who wish to park and parking spaces has created competition for spaces.\r\n\r\n\"I've had to change my route and go to the Churchill parking lot instead of the Embarcadero parking lot,\" Valencia said. \"Since they aren't enforcing parking permits yet, anyone can park there [in the Embarcadero parking lot] and there aren't any spots.\"\r\n\r\nConstruction for the Performing Arts Center is expected to last 18 months, which would make it end in the middle of the 2015-16 school year. Until construction is over, it is expected that parking permits will continue to be issued with senior priority, according to Berkson.\r\n\r\n[caption id=\"attachment_72595\" align=\"alignright\" width=\"234\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-8.jpg\"><img class=\"wp-image-72595\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-8.jpg\" alt=\"New walkways have been set up to accommodate expected pedestrians and bikes coming through the parking lot. Photo by Maddy Jones. \" width=\"234\" height=\"312\" \/><\/a> New walkways have been set up to accommodate expected pedestrians and bikes coming through the parking lot. Photo by Maddy Jones.[\/caption]\r\n\r\nOnce construction for the Performing Arts Center is complete, it is expected that 47 new student spots in the main Embarcadero lot will open up and that 25 spots will open up in the parking lot behind the Media Arts Center. Additionally, Berkson said that the senior-priority for parking will be dropped.\r\n\r\nIn addition to a lack of parking, the construction is also blocking off the path to the crosswalk leading to Town and Country Village. There are now two ways for students to get to the popular lunchtime destination. One alternative  is located behind the 300 building where there is a gate that leads to the bike path that connects over to Town and Country, and the other option is to go up to the main crosswalk at the Embarcadero-El Camino intersection.\r\n\r\n[caption id=\"attachment_72585\" align=\"alignleft\" width=\"322\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-5.jpg\"><img class=\"wp-image-72585\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-5.jpg\" alt=\"A new bike rack has been set up between the administration building and the Embarcadero parking lot. Photo by Maddy Jones.\" width=\"322\" height=\"241\" \/><\/a> A new bike rack has been set up between the Tower Building and the Embarcadero parking lot. Photo by Maddy Jones.[\/caption]\r\n\r\nThere are also new bike paths and pedestrian paths set up in place along the construction site to allow for better ease in getting students from Embarcadero Road onto campus. At the end of these walkways and bikeways, two new bike racks have been added near the Tower Building.\r\n\r\n“This has become more of a bike commute area than before, so they put the bike racks in there [by the Tower Building],” Berkson said.\r\n\r\nWith all the new additions, Berkson stresses the importance of being alert and staying safe.\r\n\r\n“If you are going to drive, be careful because it is a whole different configuration now,\" Berkson said. \"Even if you’re paying attention, that doesn’t mean the other people driving around are paying attention, so pay attention.\"","excerpt":"Palo Alto High School students and faculty alike are learning to cope with the loss of parking space after construction on the new Performing Arts Center began over the summer, blocking off a portion of the Embarcadero Road parking lot.","date":"2014-08-20 17:49:21","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/08\/photo-7.jpg","categories":["News","Spotlight"],"tags":{"8616":"construction","8690":"facilities","20206":"new theater","20205":"parking lot","20204":"parking spaces"}},{"id":72561,"title":"Freshman orientation to start at 4 p.m. on Aug. 14 in the small gym","permalink":"http:\/\/palyvoice.com\/2014\/07\/07\/freshman-orientation-to-start-at-4-p-m-on-aug-14-in-the-small-gym\/","content":"","excerpt":"","date":"2014-07-07 21:24:30","author":"Lizzie Chun","categories":["Ticker"],"tags":{"20198":"freshman orientation"}},{"id":72564,"title":"School photos for sophomores, juniors and seniors to be taken on Aug. 15","permalink":"http:\/\/palyvoice.com\/2014\/07\/07\/school-photos-for-sophomores-juniors-and-seniors-to-be-taken-on-aug-15\/","content":"","excerpt":"","date":"2014-07-07 21:24:09","author":"Lizzie Chun","categories":["Ticker"],"tags":{"20200":"id","20199":"school photos"}},{"id":72510,"title":"Slideshow: Graduation 2014","permalink":"http:\/\/palyvoice.com\/2014\/06\/02\/slideshow-graduation-2014\/","content":"The Class of 2014 graduated from Palo Alto High School Wednesday from the Quad, girls donned in white and boys in green. Events included a singing of \"Onward Paly,\" three student speeches, three musical performances by graduates, an awarding of the Viking Award to this year's graduate Kate Marinkovich and the presentation of the Class of 2014.\r\n\r\n[slideshow post_id=72510]","excerpt":"The Class of 2014 graduated from Palo Alto High School Wednesday from the Quad, girls donned in white and boys in green.","date":"2014-06-02 22:45:49","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/339.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"12701":"2014","8591":"class of 2014","8742":"graduation","8944":"palo alto high school","8953":"paly"}},{"id":72493,"title":"The speeches that didn&#8217;t make it, Class of 2014","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014\/","content":"[caption id=\"attachment_72507\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg\"><img class=\"wp-image-72507\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg\" alt=\"Students of the graduating class of 2014 toss their caps into the air after the graduation ceremony Wednesday afternoon. Photo by Molly Fogarty.\" width=\"800\" height=\"600\" \/><\/a> Students of the graduating class of 2014 toss their caps into the air after the graduation ceremony Wednesday afternoon. Photo by Molly Fogarty.[\/caption]\r\n\r\n<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-i\/\">Jack Hansen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-ii\/\">Travis Chen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iii\/\">Yumi Temple<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iv\/\">Becca Althoff<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-v\/\">Jackie Sun<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/\">Maya Kitayama<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Hillel Zand<\/a>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Paly Voice acquired the following speeches from their authors, who wrote the speeches with the intention of delivering them at graduation, but were not selected to present. Read on to view speeches from the Class of 2014 that could have been given.","date":"2014-05-28 19:42:14","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg","categories":["Features","Spotlight"],"tags":[]},{"id":72381,"title":"The speeches that didn’t make it, Class of 2014: Part VII","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice,<\/em> nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Hillel Zand\r\n\r\nLadies and gentlemen, graduates of the class of 2014:\r\n\r\nI would like to start off by talking about where you are sitting. Welcome, one and all, to the Palo Alto High School Quad. The Quad is resilient. It is the hub of campus, a staple of daily life. But to me, what the Quad really represents is learning; it is where we as students learn to be social.\r\n\r\nI’ve learned quite a bit about human interaction in high school classrooms. I’ve learned about humans being social creatures, about how methods of communication have changed, about social tendencies. But let’s be real here: in 10 years, we’re only going to remember a fraction of what we’ve learned in the classroom. Learning really happens outside the classroom, places like the Quad — at parties, at friends’ houses, on meaningless car rides.\r\n\r\nJust as much as the Quad facilitates, it also depreciates. As hard as I try, I will rarely stand out from my peers on this patch of grass. There is little to differentiate one Viking from the other. So I began to wonder: Why is it so hard to stand out?\r\n\r\nConformity. In order to appease others’ needs, we conform. The boys and girls we were on the first day of freshman year are long-lost from the young men and women we are today. For better or worse, we’ve developed new habits, met new people and changed our lifestyles.\r\n\r\nOn the Quad, we conform. So today, I ask you this: On your last day at Paly, what have you done to be noticed?\r\n\r\nBoth inside and outside the classroom, it takes more effort to stand out than to go along with what everyone else is doing. And when we try to be different, we often fail. Thus, I have learned these four years that the answer to “What can I do to stand out” is just that: make mistakes.\r\n\r\nI hate mistakes. I hate them with all my power, and you probably do too, but we have to respect them.\r\n\r\nLet me tell you about a mistake I made:\r\n\r\nOn the very first day of senior year, on this very Quad, I made the mistake of taking off my clothes and running — ever so slowly — across the grass you sit on. Sure, it’ll be a good story to tell my grandchildren one day, but it was in the heat of the moment, a moment of deindividuation.\r\n\r\nAs I dealt with a two-day suspension, I realized that I had a choice. I could choose how I wanted to be different. Two roads diverged in a wood, and I decided to take the one less traveled by. When I returned to school, I made sure that I did not let that incident define me. I made the conscious decision to stand out by building relationships with the administration, fostering conversation and — with the support of Ms. Diorio — helping usher in a new wave of senior legacy.\r\n\r\nTo me, standing out means accepting the learning potential that comes with the inevitable mistakes we have made and will make. It's not the mistake itself that makes us stand out, it's the process of making sense of the past in a way that provides true learning and growth that makes us stand out.\r\n\r\nAs we begin a new chapter in our lives, we must not be afraid to make mistakes, but more importantly, we must not be afraid to learn from them. Most will conform to the stigma that their mistake binds them to. Most will be afraid of standing out.\r\n\r\nClass of 2014: In order to differentiate ourselves, we must make mistakes. Be the one to fail. In fact, I challenge you to fail. Learn from such mistakes. Defy societal expectations and stand out for the right reasons: for being innovative, for being witty, for not conforming.\r\n\r\nConformity squanders potential. Embrace the accidental potential that lies within each of us.\r\n\r\nThank you, good night and good luck.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:21:02","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72367,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part VI","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Maya Kitayama\r\n\r\nFour years ago, I would not have pictured myself standing here, speaking at graduation. When I started as a freshman on this campus, I immediately designated myself as a quiet, reserved, and semi-awkward adolescent who really liked to dance. I carried this identity as a shield, keeping myself restricted and closed off from other opportunities. All around me, I saw my class as a collection of labels. And I began to grow a hatred for the institution of high school, a school of classifications.\r\n\r\nFor a long time, I believed high school was about immediately identifying yourself and sticking to the hasty decision for the next four years. I never even bothered to consider that there could be more to the high school experience besides getting through as fast as possible. Rather, I’ve managed to morph into a person that my freshman year self wouldn’t recognize.\r\n\r\nAs a freshman, no one knew who I was. As a senior, people still don’t really know who I am, but I’m okay with that. It’s taken me four years, but I’ve come out on the other side without the label I placed on myself, alongside a class who has defied every preconceived notion I’ve had of them.\r\n\r\nLet’s face it, Paly is tough. And there’s nothing wrong with that. This school pushes us academically and forces us to work tirelessly in order to thrive. But Paly, whether we’re aware of it or not, also shows us what we’re truly capable of. This is the school that tests the limits and pushes boundaries, but ultimately turns out a graduating class each year bursting with capability, passion, anticipation, and the assurance that they are ready to take on the world. The class of 2014 is no exception. I am honored to graduate with a group of so many amazing individuals. Granted, I don’t know all of you, and to be quite honest, I don’t know if I like all of you either. But regardless of my personal preference, this is a class completely capable of taking on the next stage in life. And we all have this school to thank.\r\n\r\nOne of the stereotypes of being a teenager is the idea that we think we’re all free and invincible. And, in some cases, we prove this to be true. But an equally significant part of being a teenager is self-doubt. The unanswered question of whether or not the person I am is the person I’m supposed to be.\r\n\r\nI’d like to think I’m no longer the quiet freshman I thought I was supposed to be. Sure, I’m still semi-awkward, and yes, I still like to dance. But Paly has allowed me to find a greater version of myself. Someone not afraid to yell, throw out my opinion, and tackle a challenge. Someone who can stand before you all today and sincerely say she owes it to this school for helping her get here. Thank you.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:20:20","author":"Noa Braun","categories":["Uncategorized"],"tags":[]}]