[{"id":79445,"title":"Slideshow: Students showcase their talents at Open Mic","permalink":"http:\/\/palyvoice.com\/2014\/11\/26\/slideshow-students-showcase-their-talents-at-open-mic\/","content":"The Palo Alto Teen Arts Council hosted its second Open Mic of the school year at 7:30 p.m. on Nov. 21 at the Palo Alto Children's Theatre. Many Palo Alto High School students were given the opportunity to sing, improvise scenes, read poems, dance or act in front of an audience.\r\n\r\n[slideshow post_id=79445]","excerpt":"Palo Alto High School students perform at the Teen Arts Council's second Open Mic of the school year.","date":"2014-11-26 20:52:36","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/IMG_0116.jpg","categories":["Slideshow"],"tags":{"29694":"chris hinstorff","33472":"fabo garduno","33474":"gabe galang","33473":"jess feeman","33461":"joey kelisson lynn","29734":"laura maystead","27178":"open mic","29376":"paper islands","33460":"paul bleich","29378":"sally wang","9107":"slideshow","33459":"sophie swezey","33475":"sylvia targ","27176":"teen arts council"}},{"id":79519,"title":"Storify: Paly perspective of Thanksgiving 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/26\/storify-paly-perspective-of-thanksgiving-2014\/","content":"Follow this year's Thanksgiving as seen through the eyes of the Palo Alto community. Use #palythanks to be featured below.\r\n<div class=\"storify\"><iframe src=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014\/embed?header=false&amp;border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014.js?header=false&amp;border=false\"><\/script>\r\n<noscript>[<a href=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014\" target=\"_blank\">View the story \"Thanksgiving 2014\" on Storify<\/a>]<\/noscript>","excerpt":"Follow this year's Thanksgiving as seen through the eyes of the Palo Alto community with #palythanks.","date":"2014-11-26 17:08:34","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/IMG_9747.jpg","categories":["Multimedia"],"tags":{"33480":"#palythanks","8713":"Food","8944":"palo alto high school","8953":"paly","33481":"paly thanks","30934":"storify","10166":"thanksgiving"}},{"id":79501,"title":"Students and staff react to Darren Wilson ruling","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/students-and-staff-react-to-darren-wilson-ruling\/","content":"Following the recent decision to not hold a trial for the State of Missouri v. Darren Wilson case, Palo Alto High School students and the Palo Alto community are expressing their opinions on the issues presented by the case.\r\n\r\nA grand jury announced its decision not to indict police officer Darren Wilson yesterday. Wilson will not be charged for the shooting of 18-year-old Michael Brown that occurred on Aug. 9 of this year.\r\n\r\nPaly United States Government teacher Steven Foug said the case emphasizes the issues of racism and inequality that the U.S. has and continues to experience.\r\n\r\n“It’s tapping into a larger issue that seems to keep coming up again and again and again,” Foug said.  “There were issues about police violence in neighborhoods and inner cities 50 years ago that [people reacted] to, and then what happens is that broad statements or broad assumptions are put into place.”\r\n\r\nJunior Gabi Rossner stated her disagreement with the grand jury’s announcement.\r\n\r\n“I was disgusted and still am disgusted,\" Rossner said. \"I really do think that there should’ve been an indictment. The [facts are] that this was the 0.1 percent of the time that it [the indictment] didn’t go through with a mostly white jury in a black municipality and ... that the person organizing the jury is a famous pro-police lawyer.”\r\n\r\nSophomore Edward Park echoed these sentiments, focusing on the ethnic makeup of the grand jury which was 75 percent white.\r\n\r\n“Ferguson is actually predominately non-white,\" Park said. \"Juries should be based off of the population.\"\r\n\r\nSupporting the grand jury’s decision, junior Alfredo Gonzalez encourages Paly students to read the <a href=\"http:\/\/http:\/\/www.nytimes.com\/interactive\/2014\/11\/25\/us\/evidence-released-in-michael-brown-case.html?_r=0\">report<\/a> presented by the jury on Monday.\r\n\r\n“I think that they [Paly students] need to read the actual report and see why the jury had their verdict,\" Gonzalez said. \"That they weren’t racist, that the physical evidence and that ... black witnesses also were on the side of the cop.”\r\n\r\nIn regards to how students in Palo Alto should react to the recent issue, junior Dami Bolarinwa says that students should talk to one another about the topic.\r\n\r\n“I feel for everyone in Ferguson, and I hope things like this don’t happen,” Bolarinwa said. “Talk about it. The best way to deal with someone is to talk and get other people involved. It’s a democracy we live in, so we can ultimately change things. If we feel really strongly about it, we should talk to people and get people to rally up and voice our opinions.”\r\n\r\nFor more information on the recent peaceful protest that occurred this afternoon in front of Palo Alto's City Hall, click <a href=\"http:\/\/http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/\">here<\/a>.\r\n\r\n<i>Staff writer <a href=\"palyvoice.com\/author\/amleung16\" target=\"_blank\">Amy Leung<\/a> also contributed to this story.<\/i>","excerpt":"Following the recent decision to not hold a trial for the State of Missouri v. Darren Wilson case, Palo Alto High School students and the Palo Alto community are expressing their opinions on the issues presented by the case.","date":"2014-11-25 16:00:49","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0283.jpg","categories":["News"],"tags":{"33471":"#blacklivesmatter","33477":"#siliconshutdown","33479":"darren wilson","33464":"ferguson","33462":"michael brown","8944":"palo alto high school","33478":"student reactions","33476":"studentreactions"}},{"id":79488,"title":"Ferguson protesters gather at Palo Alto City Hall","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/","content":"[caption id=\"attachment_79494\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg\"><img class=\"size-full wp-image-79494\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg\" alt=\"A peaceful protestor looks on somberly as another protester shares her thoughts. She carries a sign that says, &quot;No Justice in AmeriKKKa.&quot; Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> A peaceful protestor looks on somberly as another protester shares her thoughts during a peaceful gathering this afternoon at Palo Alto City Hall. Roughly 50 people were present at 1:30 p.m. to listen to others talk about their responses to the decision not to indict Officer Darren Wilson in Ferguson, Mo. Photo by Amy Leung.[\/caption]\r\n\r\nAbout 50 Palo Alto residents and Stanford students congregated this afternoon in front of Palo Alto City Hall to peacefully protest a Missouri grand jury's decision not to pursue a trial for an officer who shot an unarmed resident in Ferguson, Mo. earlier this year.\r\n\r\nOriginally starting at the plaza by Pizza My Heart, the protesters relocated to City Hall. The protest was peaceful, with people holding cardboard signs with sayings such as \"#blacklivesmatter\" and \"No Justice in AmeriKKKa.\"\r\n\r\n[caption id=\"attachment_79493\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0271.jpg\"><img class=\"size-full wp-image-79493\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0271.jpg\" alt=\"A crowd of peaceful protesters listens to one protestor as he talks about the brutality of racism. Police lights shine in the background as the Palo Alto Police Department blocks off the street for the protest. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> A crowd of peaceful protesters listens to one protestor as he talks about the brutality of racism. Police lights shine in the background as the Palo Alto Police Department blocks off the street for the protest. Photo by Amy Leung.[\/caption]\r\n\r\nVolunteers took turns stepping into the middle of the circle to relate their personal stories and opinions on the Ferguson decision.\r\n\r\nA Stanford student studying the Program in African and African American Studies, Tianay Pulphus, elicited murmurs of agreement from the crowd when she said, \"Do not be afraid when people say do not assemble. Do not be afraid when people say do not organize.\"\r\n\r\nAnother protester, Angel Santuario, originally came to videotape the protest, but ended up speaking to the crowd.\r\n\r\n\"It's not the system that failed us,\" Santuario said sarcastically. \"The system worked perfectly.\"","excerpt":"About 50 Palo Alto residents and Stanford students congregated this afternoon in front of Palo Alto City Hall to peacefully protest a Missouri grand jury's decision not to pursue a trial for an officer who shot an unarmed resident in Ferguson, Mo. earlier this year.","date":"2014-11-25 15:13:24","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg","categories":["News","Spotlight"],"tags":{"33471":"#blacklivesmatter","33469":"city hall","8653":"downtown","33464":"ferguson","33465":"indictment","33462":"michael brown","33463":"officer darren wilson","8939":"palo alto","33468":"peaceful","33466":"pizza my heart","33467":"protest","33470":"racism"}},{"id":79186,"title":"Students place in the Siemens Competition","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/students-place-in-the-siemens-competition\/","content":"Five high school students in Palo Alto are finalists and semifinalists in this year's Siemens Competition in Math, Science and Technology, according to announcements on the Siemens Foundation <a href=\"http:\/\/www.siemens-foundation.org\/en\/\">website<\/a> in early Novemeber.\r\n\r\n[caption id=\"attachment_79199\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-20-at-9.03.41-PM1.png\"><img class=\"size-full wp-image-79199\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-20-at-9.03.41-PM1.png\" alt=\"Paly and Gunn students speak about their submissions to the Siemens Competition. Photo courtesy of Simon Bloch.\" width=\"600\" height=\"449\" \/><\/a> Paly and Gunn students speak about their submissions to the Siemens Competition. Superintendent McGee praised each student for their hard work, and was impressed that they wrote 18-page papers. Photo courtesy of Simon Bloch.[\/caption]\r\n\r\nTwo Palo Alto High School students, junior Adele Bloch and senior Richard Cao; two Castilleja students, Kelsey Auyeung and Kris Auyeung; and one Gunn High School student, Joy Jin, are semifinalists of the national competition. One Gunn student, Sharon Chen, and one Castilleja student, Lea Sparkman, are finalists.\r\n\r\nAccording to the Siemens Competition website, the participants could present either individual or group projects for the competition, which is restricted to students attending high school in the U.S. and is funded by the Siemens Foundation. The foundation provides more than $7 million annually in the funding of educational initiatives like the Siemens Competition and The Siemens We Can Change the World Challenge, a program that develops solutions for environmental issues.\r\n\r\n[caption id=\"attachment_79371\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n1.jpg\"><img class=\"size-full wp-image-79371\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n1.jpg\" alt=\"Superintendent Max McGee commends students on their hard work for the Siemens Competition. Photo courtesy of Simon Bloch.\" width=\"600\" height=\"450\" \/><\/a> Superintendent Max McGee commends students on their hard work for the Siemens Competition. During the meeting he also discussed the value of innovation, and asked students about their projects. Photo courtesy of Simon Bloch.[\/caption]\r\n\r\nSparkman, a junior, had an internship over the summer that became the inspiration for the paper she submitted to the Siemens Competition.\r\n\r\n“It [the competition] is almost like an internship,” Sparkman said. “It really requires you to understand what you learned over the summer really deeply and know why you did everything and I think it really just solidifies your understanding.”\r\n\r\n“The project that I worked on dealt with globular clusters and … galaxies,\" Sparkman said. \"So it was an astronomy project … We were comparing the chemical composition of the centers of the … galaxies and the globular clusters, which are basically clusters of stars that are orbiting around these galaxies.”\r\n\r\nAccording to Sparkman, she was not expecting to be a finalist of the Siemens Competition.\r\n\r\n“The most exciting and rewarding part was submitting the paper because … I had never written an 18-page paper before … and then when we won I didn’t expect it and it was very surprising, pleasantly surprising, and so now we go on to Nationals and I am excited for that,” Sparkman said.\r\n\r\n[caption id=\"attachment_79192\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Lea.jpg\"><img class=\"size-full wp-image-79192\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Lea.jpg\" alt=\"Castilleja junior Lea Sportsman is a finalist of the Siemens competition thanks to her analysis of the composition of galaxies and globular clusters. Photo by Ana Caklovic.\" width=\"450\" height=\"600\" \/><\/a> Sparkman is a finalist of the Siemens competition for her analysis of the composition of galaxies and globular clusters. Photo by Ana Caklovic.[\/caption]\r\n\r\nCao, a senior, also used his learning from a summer internship at Stanford University as the basis of his paper. Cao’s paper was about “using DNA sequencing to obtain autoantibodies” and the possible medical treatments that could be created from the sequencing, Cao said.\r\n\r\nThe competition required a thorough report, according to Cao.\r\n\r\n“It was an 18-page report. You needed an abstract, an introduction, methods, conclusions, summary and you needed a bunch of pictures. The hardest part was getting the abstract done,” Cao said.\r\n\r\nCao said that the competition process was simple and mostly internet-based.\r\n\r\n“You put your report in, you have to mail some basic safety regulations if you do biology, like I did. You need to get approval from your mentor if you have one, but to make semifinals there’s no person to person action,” Cao said.\r\n\r\n[caption id=\"attachment_79193\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Richard.jpg\"><img class=\"size-full wp-image-79193\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Richard.jpg\" alt=\"Senior Richard Cao is a semifinalist for his work with antibodies in a Stanford lab this summer. Photo by Ana Caklovic.\" width=\"450\" height=\"600\" \/><\/a> Cao is a semifinalist for his work with antibodies in a Stanford lab this summer. Photo by Ana Caklovic.[\/caption]\r\n\r\nThe Paly, Gunn and Castilleja finalists and semifinalists were awarded their trophies by the Palo Alto District School Board members at the School Board District meeting on Tuesday.","excerpt":"Several high school students in Palo Alto are finalists and semifinalists of the Siemens Competition in Math, Science and Technology. ","date":"2014-11-25 13:34:50","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n.jpg","categories":["Features","Spotlight","Uncategorized"],"tags":{"33408":"adele bloch","33407":"finalist","33410":"lea sparksman","33409":"richard cao","9072":"science","33406":"semifinalist","33405":"siemens competition 2014"}},{"id":79073,"title":"Teachers pilot homework passes","permalink":"http:\/\/palyvoice.com\/2014\/11\/24\/teachers-pilot-homework-passes\/","content":"[caption id=\"attachment_79457\" align=\"alignright\" width=\"405\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-24-at-7.27.01-PM.png\"><img class=\"wp-image-79457 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-24-at-7.27.01-PM.png\" alt=\"Students must explain on the pass why they could not complete the homework assignment. Some students cite lack of sleep or extracurricular responsibilities. Eric Bloom, teacher on special assignment for school culture, offered the passes in his class after attending the Stanford event. A large portion of students welcome the chance to use the homework pass in trade for a teacher-student conversation, according to Bloom. Photo by Chloe Fishman.\" width=\"405\" height=\"305\" \/><\/a> Students must explain on the pass why they could not complete the homework assignment. Some students cite lack of sleep or extracurricular responsibilities. Eric Bloom,<a href=\"http:\/\/palyvoice.com\/2013\/12\/20\/school-climate-teacher-to-start-2nd-semester\/\"> teacher on special assignment for school culture<\/a>, offered the passes in his class after attending the Stanford event. A large portion of students welcome the chance to use the homework pass in trade for a teacher-student conversation, according to Bloom. Photo by Chloe Fishman.[\/caption]\r\n\r\nCertain teachers at Palo Alto High School began offering Homework Passes for assignments last week in order to encourage conversation between teachers and students about homework, life outside of school and more. If results of the pilot are positive with high student interest and constructive feedback, the Homework Pass could become a widespread option at Paly.\r\n\r\nStudents were allowed to use the pass to extend or excuse an assignment. However, the student was required to have lunch with the teacher who assigned the homework to have a follow-up conversation about why the assignment was not completed or why the student needed more time.\r\n\r\n[caption id=\"attachment_79378\" align=\"alignright\" width=\"409\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10816154_10152812158352332_854375129_n.jpg\"><img class=\"wp-image-79378\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10816154_10152812158352332_854375129_n.jpg\" alt=\"(Left to right) Junior Reid Walters, Principal Kim Diorio, junior Emma Hammerson and social studies teacher Alexander Davis crowd around a whiteboard at the Stanford School of Design. They are brainstorming ideas on how to &quot;hack&quot; school culture, eventually coming up with the idea of the homework pass. Photo by Emma Chiu. \" width=\"409\" height=\"306\" \/><\/a> (Left to right) Junior Reid Walters, Principal Kim Diorio, junior Emma Hammerson and social studies teacher Alexander Davis crowd around a whiteboard at the Stanford School of Design. They are brainstorming ideas on how to \"hack\" school culture, eventually coming up with the idea of the homework pass. Photo by Emma Chiu.[\/caption]\r\n\r\nThe idea resulted from an event hosted by the Stanford <a href=\"http:\/\/dschool.stanford.edu\/fellowships\/2014\/10\/31\/d-school-about-town-school-culture-hack-a-thon-innovation-at-work-more\/\">School of Design<\/a>, at which administrators, teachers and students focused on how to \"hack\" and improve school culture.\r\n\r\nPrincipal Kim Diorio, who took part in the Stanford event, thinks the homework passes provide great opportunities for students to have honest discussions with their teachers.\r\n\r\n\"We hear that students can't speak up, because they're worried a teacher will retaliate and take it out on their grade,\" Diorio said. \"For some students, it would provide an opportunity to have an honest conversation with their teacher without that fear of their teacher thinking something bad about them.\"\r\n\r\nDiorio hopes that teachers will learn more about students' school and extracurricular schedules.\r\n\r\n\"It's the empathy piece,\" Diorio said. \"How can we, as the adults on this campus, empathize with the students and understand what their experience is like? And then take that information and change teachers' practices and ways they assign work.\"\r\n\r\nTeachers formulated a list of questions to ask students and collect data points, according to Diorio. These questions include, how much homework do you have per night? How do you think the homework assigned could better benefit you? What other activities are you involved in that limit your time?\r\n\r\nSenior Zoe Tierney is excited about the passes and used it this week.\r\n\r\n\"As a senior, it can be really challenging to keep up with college apps, homework and production for publications,\" Tierney said. \"I don't mind having homework as long as it's meaningful and is helping me practice the material.\"\r\n\r\nAs a pilot, the homework pass was only available last week by certain teachers to test levels of student interest and its effectiveness at sparking helpful conversations.\r\n\r\nThis is just the first of many steps in improving school culture. If this homework pass system was effective, Diorio hopes to continue implementing it.\r\n\r\n\"Maybe we can expand on this,\" Diorio said. \"The goal is to get more teachers involved and do it on a bigger level.\"\r\n\r\n&nbsp;","excerpt":"Certain teachers at Palo Alto High School offered a Homework Pass for assignments last week in attempt to encourage conversation between teachers and students.","date":"2014-11-24 19:25:21","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-24-at-7.27.01-PM.png","categories":["News","Spotlight"],"tags":{"11236":"eric bloom","33423":"homework pass","8834":"Kim Diorio","33424":"school culture","33425":"stanford school of design","11237":"tosa"}},{"id":79399,"title":"ASB blood drive to happen next Friday","permalink":"http:\/\/palyvoice.com\/2014\/11\/23\/asb-blood-drive-to-happen-next-friday\/","content":"Palo Alto High School's Associated Student Body will host an annual blood drive on Dec. 5 in the Social Studies Resource Center.\r\n\r\nASB will continue to have an available booth on the Quad for sign-ups Monday and Tuesday. Additionally, a packet will be handed out with information regarding health concerns, eligibility and how to approach taking a blood test.\r\n\r\nThe American Red Cross Foundation requires that donors' must be 16 years of age and must have a parent or guardian signature if the donor is under 18 years old. All donations will go to the American Red Cross.\r\n\r\nThis will be many students' first time being eligible to donate blood. ASB secretary junior Joseph Kao says that it is a great opportunity for students to make a difference.\r\n\r\n\"Students should donate blood because it's a good cause, and any amount of blood helps individuals all around the world who [are] in need of the blood,\" Kao said.\r\n\r\nJunior Christina Park is looking forward to making her first blood donation.\r\n\r\n\"It [donating blood] was something that I'd always thought about [doing] when the Red Cross came to Paly,\" Park said. \"I think that it's something small that you should do if you're able to... that could potentially help someone in need.\"\r\n\r\nThe last chance to sign up will be Monday and Tuesday during lunch.\r\n\r\nFor more information on donating blood call 1-800-RED-CROSS or visit their website at <a href=\"http:\/\/http:\/\/www.redcrossblood.org\">www.redcrossblood.org.<\/a>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Students will be able to donate blood on Dec. 5 in the SSRC. Blood will be donated to the American Red Cross Foundation. Last day to register is Tuesday Nov. 25. ","date":"2014-11-23 23:37:10","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/poster1-310x231.jpg","categories":["News","Spotlight"],"tags":{"33433":"american red cross foundation","8496":"ASB","12353":"blood drive","33431":"donate","8944":"palo alto high school","33432":"redcross"}},{"id":79146,"title":"Review: &#8220;Mockingjay – Part 1&#8243; flies past expectations","permalink":"http:\/\/palyvoice.com\/2014\/11\/23\/review-mockingjay-part-1-flies-past-expectations\/","content":"[caption id=\"attachment_79215\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/5cd28244-653c-11e4-9039-bc764e11a0bc.jpg\"><img class=\"size-full wp-image-79215\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/5cd28244-653c-11e4-9039-bc764e11a0bc.jpg\" alt=\"Katniss (Jennifer Lawrence) and Gale (Liam Hemsworth) sprint to escape falling rubble while visiting District 8. Photo courtesy of Lionsgate Entertainment.\" width=\"600\" height=\"400\" \/><\/a> Katniss (Jennifer Lawrence) and Gale (Liam Hemsworth) sprint to escape falling rubble while visiting District 8. Photo courtesy of Lionsgate Entertainment.[\/caption]\r\n\r\nThe third installment in the captivating worldwide franchise \"The Hunger Games: Mockingjay, Part 1\" closely follows the book's plot as it picks up where \"Catching Fire\" left off, following the traumatized Katniss Everdeen (Jennifer Lawrence) as she becomes the rebel's symbol: the mockingjay.\r\n\r\n[caption id=\"attachment_79223\" align=\"alignleft\" width=\"200\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/9b2f63cc-48ea-11e4-ab33-bc764e11a0bc.jpg\"><img class=\"wp-image-79223 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/9b2f63cc-48ea-11e4-ab33-bc764e11a0bc.jpg\" alt=\"No longer the sweet baker boy we remember, Peeta returns as a pawn for the capitol. President Snow tortures him until he voices anti-rebellion sentiments in to all of Panem. \" width=\"200\" height=\"237\" \/><\/a> No longer the sweet baker boy we remember, Peeta returns as a pawn for the capitol. President Snow tortures him until he voices anti-rebellion sentiments to all of Panem.[\/caption]\r\n\r\nThe storyline revolves around Katniss in the forgotten-yet-rebellious District 13, as she makes trips to other districts to create propaganda videos as the mockingjay. Her role as the mockingjay is to be the face of the rebellion against the capitol during the revolution. Reunited with her childhood friend Gale Hawthorne (Liam Hemsworth), Katniss is reluctant to make any commitments to him because she is conflicted about her feelings for Peeta Mellark (Josh Hutcherson), her star-crossed lover and male District 12 tribute. Before the Hunger Games, a happy life with Gale was what Katniss always wanted, yet now she questions whether she really loves Peeta as he undergoes a transformation into President Snow's (Donald Sutherland) puppet.\r\n\r\nLawrence's emotional performance accurately portrays the traumatized Katniss and her reactions as they were in the books the \"Hunger Games\" movies are based on. Other characters also remain true to their developments in \"Mockingjay\" by Suzanne Collins. Such as in the case of Gale, where more of his relationship with Katniss is highlighted, and of Finnick Odair (Sam Clafin), who has the largest transformation: swaying far from his over-confident and womanizing ways in the capital as observed in \"Catching Fire,\" to living a depressing life in District 13.\r\n\r\nHaymitch Abernathy (Woody Harrelson) and Effie  Trinket (Elizabeth Banks) remain a dynamic duo, bringing laughs to the rather somber and violent plot. We see Haymitch in complete withdrawal due to President Coin's (Julianne Moore) prohibition laws in District 13. Katniss's escort Effie loses some of her sparkle in her institutionalized military attire, yet remains her quirky self at heart. Without her elaborate makeup, wigs or highfalutin lifestyle, she makes the best of accessorizing what she does have.\r\n\r\nMoving away from the arena setting in which the first two movies in the series take place, the storyline unveils new sides of the story's protagonists as the uprising takes off. Exploring the revolts within the districts puts faces to the uprising's cause and casualties, which connects the audience to each character and allows us to understand Panem, the futuristic, dystopian world of the novels, better.\r\n\r\n\"Mockingjay\" captures the spirit of the beginning of an uprising by offering a more somber tone. The film's mood is particularly captured in the haunting ballad, \"The Hanging Tree,\" sung by Jennifer Lawrence as Katniss, which echoes the sadness of the loss of so many of Panem. These emotional moments tug at the audience's heartstrings, but the mood is often lightened by comedic breaks from fan-favorite characters Haymitch and Effie.\r\n\r\nThe choice to split the book into two movies pays off as audiences are able to get an in-depth look into Panem's districts and the supporting characters, which can be particularly appreciated by fans of the series. Some characters such as Gale, who were hardly developed in previous films, are able to show more layers of their personalities and win over the audience's hearts.\r\n\r\n[caption id=\"attachment_79224\" align=\"alignright\" width=\"206\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Effie-Stylin-in-13.jpg\"><img class=\" wp-image-79224\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Effie-Stylin-in-13.jpg\" alt=\"Effie (Elizabeth Banks), Katniss' escort from the capitol, goes through a makeup and wig withdrawal while living in militaristic District 13. However, she is is still able to keep a few accessories from her past as well as her lofty attitude. Photo courtesy of Lionsgate Entertainment.\" width=\"206\" height=\"180\" \/><\/a> Effie Trinket (Elizabeth Banks), Katniss' escort from the capitol, goes through a makeup and wig withdrawal while living in militaristic District 13. However, she is is still able to keep a few accessories from her past as well as her lofty attitude. Photo courtesy of Lionsgate Entertainment.[\/caption]\r\n\r\nWhile the film does delve deeply into the characters and the world of Panem, it also features action-packed combat and mission sequences, which kept us on the edge of our seats.\r\n\r\nThe graphic representations of District 13 really bring the book to life while remaining realistic. The lavish Capitol parties, clothing and food are replaced by drab military barracks, gray jumpsuits and cafeteria rations.\r\n\r\nThough the ending does seem slightly abrupt, we left with an overall excitement to await the final installment in the Hunger Games series as \"Mockingjay– Part 2\" is scheduled to be released on Nov. 20, 2015.\r\n\r\n<em><strong>The Hunger Games: Mockingjay – Part 1<\/strong><\/em>\r\n\r\n<em><strong>123 minutes<\/strong><\/em> <em><strong>Release Date: Nov. 21, 2014<\/strong><\/em>\r\n\r\n<em><strong>Rated: PG-13 for intense sequences of violence and action, some disturbing images and thematic material <\/strong><\/em>\r\n\r\n<em><strong>Directed by Francis Lawrence <\/strong><\/em>\r\n\r\n<em><strong>Starring: Jennifer Lawrence, Liam Hemsworth, Josh Hutcherson, Phillip Seymour-Hoffman and Elizabeth Banks <\/strong><\/em>\r\n\r\n&nbsp;","excerpt":"The third installment in the captivating worldwide franchise The Hunger Games, \"Mockingjay – Part 1\" closely follows the book's plot that it is adapted from as it picks up where \"Catching Fire\" left off, following the traumatized Katniss Everdeen (Jennifer Lawrence) as she becomes the rebel's symbol: the mockingjay. ","date":"2014-11-23 17:10:24","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/5cd28244-653c-11e4-9039-bc764e11a0bc.jpg","categories":["Entertainment","Spotlight"],"tags":{"33194":"district 13","10092":"hunger games","33193":"hunger games part 1","33195":"katniss","8900":"movie review"}},{"id":79304,"title":"New library furniture temporarily inhibits computer access","permalink":"http:\/\/palyvoice.com\/2014\/11\/23\/new-library-furniture-temporarily-inhibits-computer-access\/","content":"The Palo Alto High School library will receive new furniture this Monday and Tuesday, impeding students' access to computers for those two days.\r\n\r\nThis new furniture was donated by the same private donator who donated <a href=\"http:\/\/palyvoice.com\/2014\/09\/29\/new-furniture-compensates-for-postponement-of-library-remodel\/\">other new library furniture <\/a>earlier this year, according to librarian Rachel Kellerman.\r\n\r\n[caption id=\"attachment_79364\" align=\"alignright\" width=\"468\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/library-furniture-featured-image.jpg\"><img class=\"wp-image-79364\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/library-furniture-featured-image.jpg\" alt=\"The computers and furniture in the library have been removed in preparation for the arrival of new furniture on Monday. Photo by Maddy Jones.\" width=\"468\" height=\"351\" \/><\/a> Signs telling students to use the computers in the Computer Labs are in place next to the tape and computer cords that remain in the Palo Alto High School library after the computers and some furniture were removed at the end of last week. The library was partially cleared in preparation for the arrival of new furniture on Monday. Photo by Maddy Jones.[\/caption]\r\n\r\nKellerman said the library will receive new computer tables and chairs that are similar in style to those found in the Media Arts Center as part of the ongoing process of refurbishing the Paly campus.\r\n\r\n“The existing tables were scavenged by me from the district warehouse eight years ago, as there was no budget for computer furniture,” Kellerman said. “It’s well past time for our students to have computer furniture that functions well, is flexible and looks nice.”\r\n\r\nLike the furniture in the MAC, the new furniture will be able to adjust to different heights. Kellerman added that the library will also be getting a charging station for phones and more comfortable chairs.\r\n\r\n“All of this furniture will be able to move into the new library once it is remodeled,” Kellerman said. “The library remodel will be begin once the gym complex is finished.”\r\n\r\nAs the furniture is coming in during the school week, library computers will be unavailable this coming Monday and Tuesday, according to Kellerman. The library will have a computer cart instead, and students can use Computer Lab 1 and 2 to print.\r\n\r\n“The Monday and Tuesday before a holiday tend to have fewer students at school, so we thought this would be a good time to install the new furniture before the rush of final projects and finals are upon us,” Kellerman said.\r\n\r\nThe new furniture in the library is part of the school’s gradual shift towards more collaborative, ergonomic furniture. The English Department will also receive new furniture soon, according to English Instructional Supervisor Shirley Tokheim.\r\n\r\n“A generous donor has purchased all new modern furniture for every English Department classroom,” Tokheim said. “The new furniture will support the collaborative nature of our teaching, so forming groups with other students will be easier and more efficient.”\r\n\r\nSenior Carol Hung said she thinks the new furniture may make the library more of a hub for students.\r\n\r\n“I think the MAC is a lot more inviting [due to the new furniture],” Hung said. “So if the library gets the newer furniture, people may be more motivated to go the library and study.”","excerpt":"The Palo Alto High School library will receive new furniture this Monday and Tuesday, inhibiting students' access to computers for those two days.","date":"2014-11-23 16:44:52","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/library-furniture-featured-image.jpg","categories":["News","Spotlight"],"tags":{"33413":"carol hung","8616":"construction","11645":"english department","11130":"furniture","8847":"librarian","8848":"Library","18366":"mac","33411":"new furniture","9025":"rachel kellerman","33412":"shirley tokheim"}},{"id":79086,"title":"Review: The Evolution of Taylor Swift","permalink":"http:\/\/palyvoice.com\/2014\/11\/23\/review-the-evolution-of-taylor-swift\/","content":"[caption id=\"attachment_79237\" align=\"aligncenter\" width=\"568\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/11.jpg\"><img class=\" wp-image-79237\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/11.jpg\" alt=\"Singer-songwriter Taylor Swift and fellow friend and musician Ed Sheeran sing “Everything Has Changed” to a crowd of 17,000 in Sacramento, California during the 2013 Red Tour. Sheeran, an opening act on the North American leg of Swift’s tour, makes a guest appearance during Swift’s set at every show to perform their duet. “We [Sheeran and I] became pals right away,” Swift said in an interview with Capital FM. “We write songs the same way and we have a similar sense of humor.” Photo by Jeanette Wong.\" width=\"568\" height=\"465\" \/><\/a> Singer-songwriter Taylor Swift and fellow friend and musician Ed Sheeran sing “Everything Has Changed” to a crowd of 17,000 in Sacramento during the 2013 Red Tour. Sheeran, an opening act on the North American leg of Swift’s tour, made a guest appearance during Swift’s set to perform the duet. “I'm a fan of Taylor's, not just her work but her ethics and that she writes her hits herself,” Sheeran said in an interview with Billboard. \"It's a very cool thing.\" Photo by Jeanette Wong.[\/caption]Taylor Swift is confronting the haters with her latest album titled “1989.” Laced with synthpop songs touching on a variety of topics,“1989” showcases her growth both lyrically and musically. With this album, Swift is breaking free from her past image and is unveiling yet another layer of her talent, proving to the world that she is more than just a country girl in love with the idea of being in love.\r\n\r\nThe release of “1989” on Oct. 27 raised controversy due to her change in sound and appearance. Since entering the music industry at age 16, Swift has captivated her audiences with her charming and hopeful lyrics. In her first couple albums, she based her love songs largely on the ecstasy and heartbreak of puppy love. She channeled such emotions to create songs like “Love Story,” a track capturing the famous Romeo-and-Juliet story but with a happy ending, and “Teardrops on My Guitar,” in which she addresses the sorrow of unrequited love. As she grew older and matured, so did the scope of her songwriting. Her more recent love songs resemble thoughtful reflections of her relationships rather than diary-esque ballads.\r\n\r\n[caption id=\"attachment_79238\" align=\"alignright\" width=\"365\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image-1.jpeg\"><img class=\" wp-image-79238\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image-1.jpeg\" alt=\"Swift’s fifth studio album cover features a solemn, seagull sweater-wearing, half-covered Taylor Swift. “Every single element of this album has been called into question [by my label and management team],” Swift said last week in an interview with TIME Magazine. “I’ve had to say “No, this is how we’re doing it.” … You have no idea how relieved I was [when the album sales numbers came out], because it was all on me if this didn’t work.” Photo by George Lu.\" width=\"365\" height=\"243\" \/><\/a> Swift’s fifth studio album cover features a solemn, seagull sweater-wearing, half-covered Taylor Swift. “Every single element of this album has been called into question,” Swift said last week in an interview with TIME Magazine. “I’ve had to say “No, this is how we’re doing it.” … You have no idea how relieved I was [when the album sales numbers came out], because it was all on me if this didn’t work.” Photo by George Lu.[\/caption] “In the past, I’ve written mostly about heartbreak or pain that was caused by someone else and felt by me,” Swift said in <a href=\"http:\/\/www.npr.org\/2014\/10\/31\/359827368\/anything-that-connects-a-conversation-with-taylor-swift\" target=\"_blank\">an interview with NPR<\/a>. “On this album [\"1989\"], I’m writing about more complex relationships, where the blame is kind of split 50-50. I’m writing about falling in love with a city, falling in love with a feeling rather than a person. [I’ve learned that] lots of things are gray areas and complicated situations.”\r\n\r\nHer song “Wildest Dreams” on “1989,” for example, describes her new approach towards love: Instead of throwing everything she has into a relationship, she acknowledges how it is likely that the relationship will eventually end and that when it does, she hopes he’ll remember her well. She notes that this mindset is “not anything close to the way I used to think about relationships.”\r\n\r\nMusically, Swift has undergone a complete transition from country to pop. The country twang once evident in her older songs is nowhere to be found on the new album. Her change didn't come as a complete surprise. Songs like “I Knew You Were Trouble” and “We Are Never Ever Getting Back Together” from her last album foreshadowed her eventual departure from country music. This is a significant transformation for her, in what she regards as her “first documented official pop album.\"\r\n\r\nAt first, we were unsure of her change in genres — Swift has done so well for so long within the country\/country-pop scene. Indeed, we still get nostalgic hearing her beautifully crafted songs about her past loves like “Back to December” or sweet tones like “Our Song,” but after hearing “Shake it Off” the first time on the radio we realized that she is doing something greater. It is a movement that you don’t need to rely on someone else for happiness or love, as she says. Although her country tunes will remain forever in our hearts — and trust us, they will never leave — we believe she has made the best possible choice for herself and for her listeners. Her sound has always been something genuine, something that comes straight from her (there isn’t a single Taylor Swift song that she hasn’t written or co-written). By staying true to herself and the direction she wants for her own music, Swift maintains the connection she’s always had with her fans and opens the door for new fans.\r\n\r\n[soundcloud url=\"https:\/\/api.soundcloud.com\/tracks\/104181511\" params=\"auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\" width=\"100%\" height=\"450\" iframe=\"true\" \/]\r\n\r\n<em>“Our Song,” the third single from Swift’s eponymous debut album “Taylor Swift,” displays her country style of music.<\/em>\r\n\r\nHer classic country-pop songs have won her many Country Music Awards, including Entertainer of the Year (for both 2009 and 2011) and the prestigious Pinnacle Award. But now, as she matures and continues to succeed, her choice to escape the pigeonhole and expand her work beyond country music is appropriate and understandable.\r\n\r\nWith this information as a backdrop, our favorite songs featured on the “1989” album include the album’s second single titled “Blank Space” and “Wildest Dreams.” Her satirical approach to the media’s perception of her in “Blank Space” serves as an emblem of this new era — one that is self-confident, liberating and fearless. She blatantly embraces her ‘reputation’ of being a serial dater and transforms it into her ninth No. 1 single, according to Billboard’s Digital Songs chart. In the song and its music video, she assumes the role of her perceived persona and amplifies it with lyrics like “Got a long list of ex-lovers\/They’ll tell you I’m insane.” Lyrically, her songs are edgier, bolder, deeper, and arguably, better than ever.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/e-ORhEE9VVg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<em>Taylor Swift plays the role of a psychotic, boy-crazy person in the music video for her latest single \"Blank Space.\" \"I try to stay pretty self-aware about who I actually am and also what the media's depiction of me is,\" Swift said in the behind-the-scenes footage of the shoot. \"I was thinking a lot about that and I just thought 'You know what? What if I was that girl, what song would I write? And so I wrote \"Blank Space.\"\"<\/em>\r\n\r\nIn direct contrast, “Wildest Dreams” shows a more vulnerable side of her new sound. Its Lana Del Rey-esque vibe and mesmerizingly bewitching vocals entice listeners and may appeal to music lovers of many genres; It’s a perfect hybrid of Lorde’s “Royals,” John Legend’s “All of Me” and Calvin Harris’s “Summer.” Despite Swift’s grand entrance into the pop music scene, she still manages to distinguish herself from mainstream trends, creating not only a sound of her own but also reviving elements of '80s music. This unique spin catapulted her songs to the top of the charts once again.\r\n\r\n[caption id=\"attachment_79246\" align=\"aligncenter\" width=\"629\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image.jpeg\"><img class=\" wp-image-79246\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image.jpeg\" alt=\"The physical copy of deluxe version of Swift’s “1989”, sold exclusively at Target, comes with 13 polaroids. There are five different sets, for a total of 65 different polaroids in all. Photo by George Lu. \" width=\"629\" height=\"419\" \/><\/a> The physical copy of deluxe version of Swift’s “1989”, sold exclusively at Target, comes with 13 polaroids. There are five different sets, for a total of 65 different polaroids in all. Photo by George Lu.[\/caption]\r\n\r\nAny doubt or hesitation of her new direction of music should be wiped away. With that, we leave you with this final word, the last lines of the foreword in the “1989” booklet.\r\n\r\n“From the girl who said she would never cut her hair or move to New York or find happiness in a world where she is not in love….\r\n\r\nlove,\r\ntaylor\"","excerpt":"Taylor Swift is confronting the haters with her latest album titled “1989.” Read on to discover her new image.","date":"2014-11-23 14:53:58","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/sadffdg.jpg","categories":["Editor's Pick","Reviews"],"tags":{"33428":"1989","33429":"blank space","8906":"music","9045":"review","11514":"taylor swift"}}]