[{"id":70324,"title":"Student arrest publicity brings petition, mixed reactions","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/student-arrest-publicity-brings-petition-mixed-reactions\/","content":"[caption id=\"attachment_70402\" align=\"aligncenter\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg\"><img class=\" wp-image-70402  \" alt=\"The petition created by a Paly student on change.org requests the PAPD stop posting pictures of arrested offenders on Facebook and Twitter. Photo by Emma Chiu.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg\" width=\"587\" height=\"440\" \/><\/a> The petition created by a Paly student on change.org requests the PAPD stop posting pictures of arrested offenders on Facebook and Twitter. Photo by Emma Chiu.[\/caption]\r\n<p dir=\"ltr\">After the Palo Alto Police Department posted on its social media feeds the press release of the arrest of a Palo Alto High School student, members of the Paly community have responded with various reactions, including a petition.<\/p>\r\n<p dir=\"ltr\">The <a title=\"Press Release\" href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1051\">press release<\/a> was posted not only on the City of Palo Alto’s website, but also on the PAPD’s <a title=\"PAPD Facebook Page\" href=\"https:\/\/www.facebook.com\/PaloAltoPolice\">Facebook<\/a> and <a title=\"PAPD Twitter Page\" href=\"https:\/\/twitter.com\/PaloAltoPolice\">Twitter<\/a> pages. The direct inclusion of the student’s photo and full name (released because the student is 18 years old) sparked the creation of a petition Sunday night to “stop posting pictures of arrested offenders on Facebook and Twitter.” An excerpt from the description of the <a title=\"Stop posting pictures of arrested offenders on Facebook and Twitter\" href=\"http:\/\/www.change.org\/petitions\/palo-alto-police-department-stop-posting-pictures-of-arrested-offenders-on-facebook-and-twitter?share_id=svJHNAsBnd&amp;utm_campaign=autopublish&amp;utm_medium=facebook&amp;utm_source=share_petition&amp;v=control&amp;x=~open_graph_autopublish_experiment\">petition<\/a>, which had over 250 signatures as of this afternoon, reads as follows:<\/p>\r\n<p dir=\"ltr\"><em>The Press Releases should be kept only on the PAPD website and off social media sites. … The PAPD should continue to post Press Releases, but in the form of short, summarized posts. A link to the full Press Release in the post should be provided to those who want to learn more about the incident. This allows the PAPD to alert the community on incidents without posting distressing pictures, but still allowing for the interested to learn more.<\/em><\/p>\r\n<p dir=\"ltr\">According to the petition creator, Paly junior Fabian Garduño, the appeal was created after the recent Paly arrest out of concerns for psychological health effects of arrested offenders.<\/p>\r\n<p dir=\"ltr\">“There are people behind these photos that have their lives totally changed when these photos are put up because everyone sees them,” senior Will Hare said.<\/p>\r\n<p dir=\"ltr\">The general reaction Garduño has received regarding the petition has \"been mostly positive,\" Garduño said. \"A lot of people have signed it, and I'm hoping I can get above 500 signatures.\"<\/p>\r\n<p dir=\"ltr\">While students feel concern for the emotional well-being of their peers, many hold differing opinions on how the PAPD should maintain a consistency with the law.<\/p>\r\n<p dir=\"ltr\">“It’s just unfortunate that he [the arrested student] is still in high school, and since high school kids can be very judgmental, it's definitely disappointing,” junior Kelly Swanson said. “But ... you can’t really distinguish between what can and can’t be posted, so I think it is fair that if you are over 18, it [the offender’s information] is public and can be posted on Facebook.”<\/p>\r\n<p dir=\"ltr\">Junior Eliza Ackroyd also voiced her own sentiments on how to maintain a balance with social media.<\/p>\r\n<p dir=\"ltr\">“They [the PAPD] want their actions to be very transparent with the community, but I also think it’s important to preserve his [the arrested student's] privacy,\" Ackroyd said. \"I think it’s not fair for him to face the repercussions ... from the community … and publicizing the incident isn’t necessarily a good thing.”<\/p>\r\n<p dir=\"ltr\">Many students, including junior Seth Alston and sophomore Molly Kraus, agree that instead of having the PAPD completely cut off social media posts of criminals, alternative solutions can be found.<\/p>\r\n<p dir=\"ltr\">“If he was a suspect and people still needed to look out for someone who was still at large, I think that’s different,” Alston said. “But once it all happens and he’s already booked, I think it should be pretty much internal.”<\/p>\r\n<p dir=\"ltr\">Alternatively, Kraus believes that stories on arrested students should still be posted, as long as certain information is withheld.<\/p>\r\n<p dir=\"ltr\">“I think that both the public and the police have the right to understand the information given to them,” Kraus said. “At the same time, I think that because he [the arrested student] is still a student, they [the PAPD] should hold his name and possibly just discuss the charges and the fact there was a student at Palo Alto High School who did this.”<\/p>\r\n<p dir=\"ltr\">[poll id=\"2\"]<\/p>","excerpt":"After the Palo Alto Police Department (PAPD) posted on its social media feeds the press release of the arrest of a Palo Alto High School student, members of the Paly community have responded with various reactions including a petition.","date":"2014-04-10 20:59:40","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg","categories":["News","Spotlight"],"tags":{"13028":"daiki minaki","13034":"eliza ackroyd","13032":"fabian garduno","13031":"kelly swanson","13035":"molly kraus","8944":"palo alto high school","10178":"palo alto police","8953":"paly","13029":"paly student arrest","13030":"PAPD","13033":"petition"}},{"id":70462,"title":"Administration implements new system for teacher adviser selections","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/administration-implements-new-system-for-teacher-adviser-selections\/","content":"<p dir=\"ltr\" id=\"docs-internal-guid-28df9e87-4d7b-ab08-e2e2-93910ff67bd3\">Palo Alto High School freshmen will be the first to partake in a newly implemented selection process for their sophomore-to-senior-year teacher advisers on April 17 during advisory.<\/p>\r\n<p dir=\"ltr\">According to Assistant Principal Kathleen Laurence, the new system strives to better pair students with TAs through computer-conducted surveys that will match similar interests of students and advisers.<\/p>\r\n<p dir=\"ltr\"> \"The ninth grade students grade students will take a survey, and the TAs will take a survey. ... That [the result of the survey] is what we will base the system off of,” Laurence said.<\/p>\r\n<p dir=\"ltr\">The administration has been discussing the plans for a new selection process for two years in an effort to accommodate growing class sizes, according to Laurence.<\/p>\r\n<p dir=\"ltr\">“The school’s getting a lot bigger,\" Laurence said. \"We're finding that we’re not being able to give students their first choice, and this seemed like a much more efficient way for students.”<\/p>\r\n<p dir=\"ltr\">This system is also aimed to better match students with their advisers, adviser and English teacher Julia Taylor said.<\/p>\r\n<p dir=\"ltr\">“[The new system is] responding to student requests to have a TA that shares their interests, so that was why the change came about,” Taylor said. “A lot of freshmen often said that when they were choosing from just the picture and little paragraph that they didn’t really know anything about that person.”<\/p>\r\n<p dir=\"ltr\">According to Laurence, while changes are being put in place for the selection of  10th to 12th grade TAs, the random lottery selection for freshmen TAs will remain the same as it is now.<\/p>\r\n<p dir=\"ltr\">According to the handout given to freshmen during advisory today, students will be notified of their newly matched advisers at the beginning of next school year when their course schedules are also released.<\/p>\r\n<p dir=\"ltr\">The 10th to 12th grade advisers were also asked about their interests for the selection process, according to Taylor.<\/p>\r\n<p dir=\"ltr\">“We [10th to 12th grade TAs] answered one question that had a number of options on it about what kind of things we’re interested in,” Taylor said.<\/p>\r\n<p dir=\"ltr\">Taylor said that she thinks the system will work well.<\/p>\r\n<p dir=\"ltr\">“I think it [the switch to the new system] will be great,” Taylor said. \"[Students will be able] to pick a TA that has similar interests.\"<\/p>\r\n<p dir=\"ltr\">Junior Eric Lu has a more skeptical view of the new system.<\/p>\r\n<p dir=\"ltr\">“I think that people are going to try to game the system to get the advisers they want, and it won’t work out to their [the students'] advantage,” Lu said.<\/p>","excerpt":"Students of the Palo Alto High School freshmen class of 2017 will be the first to partake in a newly implemented selection process for their sophomore-to-senior-year teacher advisers on April 17 during advisory.","date":"2014-04-10 18:41:52","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo.jpg","categories":["News"],"tags":{"8721":"freshmen","13292":"new system","13290":"tas","13291":"teacher adviser"}},{"id":70420,"title":"ASB carries out last-minute preparations for record-breaking Prom","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/asb-carries-out-last-minute-preparations-for-record-breaking-prom\/","content":"[caption id=\"attachment_70429\" align=\"alignright\" width=\"423\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg\"><img class=\" wp-image-70429\" alt=\"image\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg\" width=\"423\" height=\"317\" \/><\/a> A banner promoting Prom with an image of the venue hangs on a fence at the Churchill parking lot on the Palo Alto High School campus. Photo by Takaaki Sagawa[\/caption]\r\n<p dir=\"ltr\">The Associated Student Body is working on final preparations for Prom, which will be  8 p.m. to 12 p.m. Saturday at the Exploratorium in San Francisco. According to ASB adviser Matt Hall, Prom ticket sales have reached the maximum number of 750, and the wait-list is growing.<\/p>\r\n<p dir=\"ltr\">ASB is currently making sure that the event preparations are proportional to the number of students attending the event, according to Hall.<\/p>\r\n<p dir=\"ltr\">“We’ve been talking with our event planner,” Hall said. “We have to keep them up to date so they can prepare enough food for 750 people … As the numbers change, the calculations change so to speak.”<\/p>\r\n<p dir=\"ltr\">There may be a chance for an increase in the maximum limit of attendees, however there is no guarantee or confirmation yet, according to Hall.<\/p>\r\n<p dir=\"ltr\">“It pretty much depends on the buses and the venue [capacity],” Hall said. “There are several kind of things that must fall in alignment and that determines our overall number of people who may attend prom.”<\/p>\r\nFor students attending Prom, Hall emphasizes that they remind themselves to arrive promptly to prevent any delay.\r\n\r\n“Main thing is time, make sure you get there,” Hall said. “We want them to be there no later than 5:45 p.m. If they want to take pictures with Lifetouch, they want to be there earlier, probably 5:30 p.m. or so because the photographers will be there from 5:30 p.m. to 6 p.m. and we’ll start loading the buses precisely at around 6 p.m. to 6:15 p.m.”\r\n\r\nMore information, including a map of the parking lot for students to find their bus, will be posted on the <a href=\"https:\/\/www.facebook.com\/palyasb\">ASB Facebook page<\/a>.","excerpt":"The Associated Student Body is working on final preparations for Prom, which will be  8 p.m. to 12 p.m. Saturday at the Exploratorium in San Francisco. ","date":"2014-04-10 14:33:22","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","9016":"prom","13286":"sold out","9163":"ticket","13287":"wait-list"}},{"id":69653,"title":"Feature: What is Smash Bro club?","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/feature-what-is-smash-bro-club\/","content":"Ever seen a sign during Club Day that captures your interest enough to wonder what the club might be up to, but never had the time to find out? This is the story for you.\r\n\r\n[caption id=\"attachment_69737\" align=\"alignright\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg\"><img class=\" wp-image-69737 \" alt=\"&quot;Super Smash Bros. Brawl&quot; by HeyGabe WW is licensed under CC BY 2.0.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg\" width=\"450\" height=\"253\" \/><\/a> \"Super Smash Bros. Brawl\" by HeyGabe WW is licensed under CC BY 2.0.[\/caption]\r\n\r\nPalo Alto High School sophomore Andy Kotik started the Smash Bro Club this year with Andrew Baer to get together and appreciate the Nintendo game <em>Super Smash Bros Brawl<\/em>.\r\n\r\n\"I hope to use this game [and] bring people together and have a good time,\" Kotic said.\r\n\r\nIt started off as a fun competition between the two friends, but ended up creating a club where people could play and share the joy together, according to Andy.\r\n\r\n\"It can create a little bit of tension, but most players don't let it get to them,\" Kotic said.\r\n\r\nVice president Baer agrees that competition is great.\r\n\r\n\"The players are really eager to play their tournament games and keep checking the brackets as it gets updated,\" Baer said.\r\n\r\n\"The competition really seems to help people connect and get to know each other,\" Baer said. \"Regardless of any trash talk we might spew out in the middle of the match\".\r\n\r\nIt is not all about playing together and the club is set to compete in mid-April against Los Altos High School in a crew battle according to Baer.\r\n\r\nThe game itself is a fighting game where various Nintendo characters come to fight it out, according to Kotic.\r\n\r\nKotic admits to being influenced by his older brother who founded a similar club two years ago.\r\n\r\n\"However, the idea didn't start developing until I saw a sign advertising Club Day II,\" Kotic said.\r\n\r\nThe game was released in 2008 and Andy got it the day of, he said.\r\n\r\nThe club meets on Wednesdays at lunch in room 204 and even people not necessarily interested in Super Smash Bros are welcome to come.\r\n\r\n\"We're an open, friendly community of people passionate about video games,\" Baer said.","excerpt":"Ever seen a sign during Club Day that captures your interest enough to wonder what the club might be up to, but never had the <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/feature-what-is-smash-bro-club\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-04-10 13:29:15","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg","categories":["Features"],"tags":[]},{"id":70349,"title":"Robotics team places 22nd out of 58 at Silicon Valley Regional","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/robotics-team-places-22nd-out-of-58-at-silicon-valley-regional\/","content":"[caption id=\"attachment_70354\" align=\"aligncenter\" width=\"501\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg\"><img class=\"wp-image-70354   \" alt=\"The Palo Alto High School robotics team robot rolls onto the competition arena. At the Silicon Valley Regionals, the team placed 22nd out of 59 teams.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg\" width=\"501\" height=\"333\" \/><\/a> The Palo Alto High School robotics team robot rolls onto the competition arena. At the Silicon Valley Regional, the team placed 22nd out of 58 teams. Photo by Chris Linn.[\/caption]\r\n<p dir=\"ltr\">The Palo Alto High School robotics team ranked 22nd out of 58 teams at the Silicon Valley Regional over Spring Break in its final competition of the school year and is now preparing for next year's program.<\/p>\r\n<p dir=\"ltr\">At its <a href=\"http:\/\/palyvoice.com\/2014\/03\/13\/robotics-falls-short-in-first-competition\/\">previous tournament<\/a>, the Central Valley Regional, the team placed 44th out of 45 teams. Following the Silicon Valley Regional, the team is happy to have improved its ranking, according to senior co-captain Freddy Kellison-Linn.<\/p>\r\n<p dir=\"ltr\">“Generally the top 24 is where you want to be,” Kellison-Linn said. “We didn’t get picked for elimination rounds but given how we performed at the previous competition everyone was very happy with how we did and it was a good end to the season.”<\/p>\r\n<p dir=\"ltr\">Kokontis said the team came across a few obstacles, including a part of the robot that was scratching the ball, the object that the robot was meant to shoot into baskets, throughout the competition.<\/p>\r\n<p dir=\"ltr\">However, it faced fewer problems than it did the last tournament, according to sophomore Claire Kokontis.<\/p>\r\n<p dir=\"ltr\">“For a couple of members it was less stressful for us because there was less to fix so we got more time to just hang out with each other,” Kokontis said.<\/p>\r\n<p dir=\"ltr\">Kellison-Linn mirrors Kokontis’ sentiments, stating that the Silicon Valley Regional ran significantly smoother than the Central Valley Regional tournament for the team.<\/p>\r\n<p dir=\"ltr\">“We had an issue in Madera where we couldn’t get the shooter working until the very end, but for this competition we had our shooting working and we did significantly better than we did in Madera,” Kellison-Linn said.<\/p>\r\n<p dir=\"ltr\">The Paly robotics team is proud that its robot is built almost entirely by students, without much mentor help, according to Kokontis.<\/p>\r\n“It was really surprising for people at the competition to see this robot that had been mainly built by students,” Kokontis said. “That’s something that makes Paly robotics unique and that’s something that we’re proud of.”\r\n\r\nThis is the final tournament for the Paly robotics team during this school year, but the team has much in store for the future including a summer camp program, teaching robotics to younger children and getting ready for the Cal Games tournament during the fall.","excerpt":"The Palo Alto High School robotics team ranked 22nd out of 58 teams at the Silicon Valley Regional over Spring Break in its final competition of the school year and is now preparing for next year's program.","date":"2014-04-10 13:08:30","author":"Addie McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg","categories":["News","Spotlight"],"tags":[]},{"id":70352,"title":"Preview: Boys’ lacrosse to face off against Sacred Heart","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/preview-boys-lacrosse-to-face-off-against-sacred-heart\/","content":"The Palo Alto High School boys’ lacrosse team (6-3, 3-1) will play the Sacred Heart Preparatory team (7-3, 5-0), the first-place seed in the De Anza League, at 4 p.m. today at Sacred Heart.\r\n\r\nThe Paly Vikings lost to the Gators earlier this season, and were knocked out of the Santa Clara Valley Athletic League playoffs in the semi-finals by the Gators last year.\r\n\r\nSenior midfielder Zach Rizk, however, expects Paly to play well at the upcoming game.\r\n\r\n“Obviously, we’ve lost to Sacred Heart six times in a row now,” Rizk said. “We’d like to break that streak today. They have some great shooters, but we have a really balanced team. I think we have a better defense this year, and we’re looking to beat them this year.\"\r\n\r\nSophomore attack Matthew Seligson echoes Rizk's optimism.\r\n\r\n“We expect to win,” Seligson said. “They [Scared Heart] have got two great players, but we’re deep all around.”\r\n\r\nCurrently, Sacred Heart is ranked third in SCVAL and first in the De Anza League, while Paly is is ranked sixth in SCVAL and third in the De Anza League.  Both teams are expected to qualify for the playoffs.\r\n\r\n“We’re looking to go for number two seed at least, if not the number one seed,” Rizk said. “We’re on track for that right now with one loss.”\r\n\r\nThe Vikings will kick off against the Gators at 4 p.m. today at Sacred Heart.","excerpt":"The Palo Alto High School boys’ lacrosse team (6-3, 3-1) will play the first place De Anza League Sacred Heart Preparatory team (7-3, 5-0) at 4 p.m. today at Sacred Heart.","date":"2014-04-08 14:09:46","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_1.jpeg","categories":["Sports"],"tags":{"12015":"boys lacrosse","8836":"Lacrosse","8944":"palo alto high school","12968":"sacred heart preparatory","9120":"sports"}},{"id":69922,"title":"Opinion: My last farewell to the Big Gym","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/opinion-my-last-farewell-to-the-big-gym\/","content":"It has been exactly 21 days since I last exited the locker room of the Big Gym in a Palo Alto High School uniform and walked onto the court for what could be the last basketball game of my life.\r\n\r\nMany young children dream of playing professional sports, but my dream was different.\r\n\r\nMy dream was to play basketball for Paly in the same gym that hosted countless numbers of students and players before me.\r\n\r\nBeing raised in Palo Alto my entire life, the one thing I wanted to do before I left for college was to make that walk.  The first time I ever stepped foot onto the Big Gym floor, I was an elementary school student playing for a National Junior Basketball team.  The last time I ever stepped, and will ever step, on that floor was as a senior starter who had already been admitted to college.\r\n\r\nI mention this because the Paly gym has played such a crucial role in my development not only as a basketball player, but also as a person.\r\n\r\nPlaying basketball in the gym hasn't just been about winning games.  It's been about building character and learning determination.\r\n\r\nI had my fair share of moments when I wanted to quit playing, but every time I had a doubt in my mind I thought back to the day when I first shot a basketball into the south-facing hoop and dreamed of the day I would get to do it again in a varsity uniform.  Whether it was barely making the freshman team in ninth grade and doubting I could earn playing time or sitting on the bench my entire junior season, the dream of playing in the gym gave me the mental toughness that I needed to succeed not only on the hardwood, but in life.\r\n\r\nThe seemingly endless practices and film sessions my junior year preparing for games that I wouldn't play in taught me to be patient, trust in the process and wait for my time.\r\n\r\nIt took me awhile to realize that I had achieved my childhood dream.\r\n\r\nI walked out to a gymnasium full of people and we beat our crosstown rival, Gunn High School.\r\n\r\nI was a Viking, representing my school and community, every time I stepped foot on the court.\r\n\r\nThe night before my last home game, I sat in bed unable to sleep and thought about everything that the gym had given me: It gave me a space to clear my mind when I was having a bad day, it gave me something to look forward to, and it fostered friendships that I will cherish for the rest of my life.\r\n\r\nWhen the gym comes down in May, I will be losing a building that holds a special place in my heart, but I will never lose the memories, friendships and values that came with my time playing for Paly under its roof.\r\n\r\nI would like to thank the Big Gym for everything it provided, and all of the people who supported me in my last four years at Paly.  I am truly grateful for the opportunity I had to play in front of my fellow students and community members.","excerpt":"A student says goodbye to the Big Gym.","date":"2014-04-08 12:49:36","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/voice-paly-gym-pc-jack-shapiro-e1362286588480.jpg","categories":["Opinion","Sports","Spotlight"],"tags":{"11286":"big gym","12969":"paly gym"}},{"id":68502,"title":"Are prom tickets more expensive?","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/are-prom-tickets-more-expensive\/","content":"Tickets to Palo Alto High School's Prom are on sale now, and speculations have been made to whether prices have continued to rise each year.\r\n\r\n[caption id=\"attachment_69789\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg\"><img class=\" wp-image-69789 \" alt=\"&quot;Exploratorium 14&quot; by Tom Hilton is licensed under CC By 2.0. \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg\" width=\"400\" height=\"265\" \/><\/a> \"Exploratorium 14\" by Tom Hilton is licensed under CC By 2.0.[\/caption]\r\n\r\nThe current prices are $110 with an Associated Student Body sticker and $120 without. On March 18 the ticket prices will go up to $120 with an ASB sticker and $130 without. Tickets are on sale at the <a href=\"http:\/\/webstores.activenetwork.com\/school-software\/palo_alto_senior_hig\/index.php?l=product_detail&amp;p=463#.Uw-p747ko6p\">Paly webstore<\/a>.\r\n\r\nThere has been talk about Prom tickets being more expensive this year than in previous years, but that may not necessarily be the case, according to Student Activities Director Matt Hall.\r\n\r\n\"Five years ago at Paly the price was $130, and then it went down,\" Hall said.\r\n\r\nThe last three years, however, the prices have fluctuated at both Paly and Gunn High School, but \"[prom tickets] have not risen by any consistent,\" Hall said.\r\n\r\n\"ASB is subsidizing Prom significantly to bring down the per-person price,\" Hall said.\r\n\r\nAt a minimum, the price tag per person this year will be $150, according to Hall.\r\n\r\nThe reason for this year's somewhat more expensive price tag is mainly due to the location chosen by ASB at the Exploratorium on Pier 15 in San Francisco, according to Hall.\r\n\r\n\"This year's ASB officers have moved heaven and earth to put together what I think is going to be an excellent, great-value-for-the-money prom,\" Hall said.\r\n\r\nThe total cost of this year's prom is $129,000 with estimated price of bus rental around $14,000, catering and site rental at $112,000, and DJ around $3,000, according to Hall.\r\n\r\nASB has been working hard to make prom fun while keeping the costs manageable to everyone. To lower ticket prices, ASB has taken away some of the extra specialties of prom, according to Hall.\r\n\r\n\"There isn't a traditional dinner but there will be plenty of food to fill everyone up,\" senior class president Audrey DeBruine said. \"It's basically dinner without tables. There will be sliders, salads, snacks, and more, and unlike in the past, the caterers are in-house, so the food is being made in the Exploratorium's kitchen.\"","excerpt":"Tickets to Palo Alto High School's Prom are on sale now, and speculations have been made to whether prices have continued to rise each year.","date":"2014-04-08 12:49:01","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg","categories":["News","Spotlight"],"tags":{"12859":"exploratorium","8944":"palo alto high school","8953":"paly","12857":"paly prom","12860":"pier 15","12858":"prom 2014"}},{"id":70296,"title":"Liu wins ASB presidency amid higher turnout","permalink":"http:\/\/palyvoice.com\/2014\/04\/06\/liu-wins-asb-presidency-amid-higher-turnout\/","content":"[caption id=\"attachment_70299\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg\"><img class=\" wp-image-70299 \" alt=\"&quot;Vote&quot; poster and smartphone QR code outside the Student Activities Office. Voter turnout in the 2014 election sharply increased from previous years. Photo by Drew Keller.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg\" width=\"600\" height=\"450\" \/><\/a> \"Vote\" poster and smartphone QR code outside the Student Activities Office. Voter turnout in the 2014 election sharply increased from previous years. Photo by Drew Keller.[\/caption]\r\n<p dir=\"ltr\">Palo Alto High School's student government officers for the 2014-15 school year, including future ASB President Claire Liu, have been chosen in an Associated Student Body (ASB) election marked by the highest voter turnout in years.<\/p>\r\n<p dir=\"ltr\">According to Student Activities Director Matt Hall, 34 percent of all Paly students voted over the course of the weeklong election period, a significant rise from last year’s 28 percent and the previous year’s 18 percent.<\/p>\r\n<p dir=\"ltr\">Hall attributed the increase to better accessibility: it was possible to vote not just at the school’s voting station, but also online at home or on students’ mobile devices by using QR codes posted around the school.<\/p>\r\n<p dir=\"ltr\">“We've had a nice steady rise [in student voting rates],” Hall said. “And we had some good races.”<\/p>\r\n<p dir=\"ltr\">According to Hall, the actual participation rate was higher than the gross percentage suggests because the gross figure includes seniors, who cannot vote for next year's officers. Discounting these students, 43 percent of those eligible to vote did so, a rate that surpassed Hall's goal of 40 percent. However, according to Hall, rates are still much lower than at Gunn High School, where close to 80 percent of eligible voters participate.<\/p>\r\n<p dir=\"ltr\">Liu, who will serve as next year’s ASB President after winning an uncontested election, expressed optimism about the increased turnout.<\/p>\r\n<p dir=\"ltr\">“This [the increase] is super exciting, obviously, because it means more Paly students are coming out to cast their ballots and make their voices heard,” Liu said. “It's a sign that the student body is taking ASB elections more seriously and expressing interest and concern in who they want to select to lead the school and to serve as a voice of the Paly student community.”<\/p>\r\n<p dir=\"ltr\">Liu highlighted one-candidate races, such as hers, as one of the negative aspects of the election.<\/p>\r\n<p dir=\"ltr\">“For many of the positions, there seemed to be a lot of intense competition because each candidate was so strong,” Liu said. “[But] For some positions, there was only one person running – for example, mine. This is something I'd like to work on changing in the future. Having lots of people running for a position gives the student body more people to choose from.”<\/p>\r\n<p dir=\"ltr\">This year, four of the twelve total positions were won by an uncontested candidate: ASB President by Liu, ASB Treasurer by junior Courtney Hull, Senior President by junior Maya Ben-Efraim, and Sophomore President by freshman Noa Ben-Efraim. However, there were also two three-way races for Senior Vice President and Sophomore Vice President, won by Olivia Scola and Anmol Nagar, respectively.<\/p>\r\n<p dir=\"ltr\">Due to the election of current sophomores Joseph Kao and Reid Walters, two of the four schoolwide positions will be held by juniors next year. Kao will take the position of ASB Secretary while Walters will serve as ASB Vice President.<\/p>\r\n<p dir=\"ltr\">“I'm excited to work with the whole school and a variety of grade levels,” Walters said. “This upcoming year as ASB Vice President I'll mainly be working with clubs and will be the connection between them and ASB. This will be different from the role that I played in ASB this year as a class officer where I worked mainly with my grade.”<\/p>\r\n<p dir=\"ltr\">Like Walters, Liu looks forward to playing an important role at Paly next year.<\/p>\r\n<p dir=\"ltr\">“I'm really excited about ASB next year,” Liu said. “I'm looking forward to serving as a voice for Paly's student body and focusing on social climate at school, meaning issues of stress, tolerance, [and] bullying.”<\/p>\r\n<p dir=\"ltr\"><strong>Election Results:<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB President: junior Claire Liu<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Vice President: sophomore Reid Walters<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Treasurer: junior Courtney Hull<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Secretary: sophomore Joseph Kao<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Senior President: Maya Ben-Efraim<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Senior Vice President: Olivia Scola<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Junior President: William Zhou<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Junior Vice President: Eli Friedlander<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Sophomore President: Noa Ben-Efraim<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Sophomore Vice President: Anmol Nagar<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Freshman President and Vice President: to be elected in fall 2014.<\/strong><\/p>","excerpt":"Palo Alto High School's student government officers for the 2014-2015 school year have been chosen in an Associated Student Body (ASB) election marked by the highest voter turnout in years.","date":"2014-04-06 21:36:22","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg","categories":["News"],"tags":{"12855":"ASB election 2014","8666":"election","8873":"Matt Hall","8953":"paly","8955":"paly asb","12856":"student government"}},{"id":70178,"title":"Robotics team in tournament over Spring Break","permalink":"http:\/\/palyvoice.com\/2014\/04\/01\/robotics-team-in-tournament-over-spring-break\/","content":"[caption id=\"attachment_70242\" align=\"alignright\" width=\"432\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg\"><img class=\" wp-image-70242  \" alt=\"The Palo Alto High School's (((School)))robotics team's robot is putting the exercise ball into one of the goals to score a point. The robotics team is competing in a tournament over Spring Break. Photo by Chris Linn.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg\" width=\"432\" height=\"287\" \/><\/a> The Palo Alto High School robotics team's robot puts the exercise ball into one of the goals to score a point. The robotics team is competing in a tournament over Spring Break. Photo by Chris Linn.[\/caption]\n\nWhile everybody else is sleeping during Spring Break next week, the Palo Alto High School robotics team will be up early competing in its second robotics tournament of the year. The regional tournament will be held from next Thursday until next Saturday at San Jose State University.\n\nThe upcoming challenge for the tournament is called \"Aerial Assist.\" The goal for the team is for its robot to pick up two-foot diameter exercise balls and put them through goals. The more goals the robots gets, the more points that are scored, according to sophomore Claire Kokontis.\n\nIn this competition, there is more teamwork among the different schools  than usual, according to Kokontis.\n\n\"There's a lot of teamwork among other teams from different schools which is different from past years,\" Kokontis said. \"Usually it's individual teams who are trying to shoot points for their alliance but now we have to work together.\"\n\nPalo Alto High School is competing in the Silicon Valley Regional with over 50 teams, including Castilleja School, Gunn High School, Los Altos High School and many more.\n\nThe team had its <a href=\"http:\/\/palyvoice.com\/2014\/03\/13\/robotics-falls-short-in-first-competition\/\">first tournament<\/a> a few weeks ago from March 7-9 in Madera in which the bumper of the team's robot stopped working. The team was able to fix their robot by the end of the competition but the robot was not as effective, according Kokontis.\n\n\"We worked through it and the team worked really, really hard,\" Kokontis said. \"We have a working robot with our bumper now so we're really excited for this coming competition.\"\n\nThe robotics team meets every Thursday for a general meeting and during the weekends. To prepare for the competition, the team spent roughly six weeks building and perfecting the robot so it will be successful during the tournament.\n\nAs the competition draws closer, the team has high hopes and is looking forward to spending time together and bonding, according to Kokontis.\n\n\"I think we have a good chance of doing well,\" Kokontis said. \"Last competition there was a lot of team building and everybody got closer so this should be fun.\"\n\nFor more information about the competition, click <a href=\"http:\/\/www.firstsv.org\/\">here<\/a>.","excerpt":"While everybody else is sleeping during Spring Break next week, the Palo Alto High School robotics team will be up early competing in its second robotics tournament of the year. The regional tournament will be held from next Thursday until next Saturday at San Jose State University.","date":"2014-04-01 08:03:52","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg","categories":["News"],"tags":{"12849":"claire kokontis","12848":"competition","12847":"robot","9049":"robotics","10117":"san jose","12846":"spring break","9175":"tournament"}}]