[{"id":72461,"title":"Breaking: Glenn “Max” McGee to succeed Kevin Skelly as PAUSD superintendent","permalink":"http:\/\/palyvoice.com\/2014\/05\/23\/breaking-glenn-max-mcgee-to-succeed-kevin-skelly-as-pausd-superintendent\/","content":"","excerpt":"","date":"2014-05-23 20:56:02","author":"Charles Yu","categories":["Ticker"],"tags":[]},{"id":72358,"title":"Award-winning historian David M. Kennedy visits Paly","permalink":"http:\/\/palyvoice.com\/2014\/05\/23\/award-winning-historian-david-m-kennedy-visits-paly\/","content":"[caption id=\"attachment_72400\" align=\"alignnone\" width=\"533\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg\"><img class=\"wp-image-72400\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg\" alt=\"David M. Kennedy and history teacher Jack Bungarden pose for a picture with Paly students. Form left to right is Hannah Zhang, Hannah Nguyen, David Kennedy, Jack Bungarden, Lizzy Chen, and Johnny Lee. Photo By Claire Liu.\" width=\"533\" height=\"400\" \/><\/a> David M. Kennedy and history teacher Jack Bungarden pose for a picture with Paly students. From left to right is junior Hannah Zhang, junior Hannah Nguyen, Kennedy, Bungarden, junior Lizzie Chun and junior Johnny Lee. Photo By Claire Liu.[\/caption]\r\n\r\nStanford professor and Pulitzer prize-winning historian David M. Kennedy spoke to Palo Alto High School students in Advanced Placement United States History and answered their questions on Tuesday during Tutorial. He is most widely known among Paly students as the author of <em>The American Pageant<\/em>, the main text used in the APUSH course.\r\n\r\n\"I thought it was really interesting,\" junior Guive Assadi said. \"[Kennedy] mostly didn't talk about specific history. He talked about historiography, and I think that's really cool.\"\r\n\r\nKennedy started the session by reading a comical essay that was composed of funny mistakes by college students. He then talked about the importance of studying history and how it helps us understand ourselves, and ended the afternoon by fielding questions from students answering a few questions. \r\n\r\nJunior Will Kast thought the session was both interesting and entertaining.\r\n\r\n\"The essay made from a complication of student written essays was my favorite part,\" Kast said. \"I thought it was absolutely hilarious.\"\r\n\r\nFor Kast, it was a great way to wrap up the year.\r\n\r\n\"Sometimes when a class is as exhausting as APUSH, you forget why studying is so important,\" Kast said. \"Hearing Dr. Kennedy speak was a good reminder of why it's so important to study history.\"\r\n\r\nAssadi also viewed the experience as a great way to cap off his time studying American history at Paly.\r\n\r\n\"We read Kennedy's book, but we never get to hear his methodology,\" Assadi said. \"I think it's a great thing to participate in at the end of the year to reflect on the class, but also on the various techniques he employs in our book.\"\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n","excerpt":"Stanford professor and Pulitzer prize-winning historian David M. Kennedy spoke to Palo Alto High School students in Advanced Placement United States History and answered their questions on Tuesday during Tutorial","date":"2014-05-23 20:55:29","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10379136_10204334570508740_539540057_n.jpg","categories":["News"],"tags":{"8490":"apush","19629":"bungarden","11617":"history","8829":"kennedy"}},{"id":72442,"title":"Graduation at 5 p.m. on May 28 on the Quad","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/graduation-at-5-p-m-on-may-28-on-the-quad-2\/","content":"","excerpt":"","date":"2014-05-22 20:55:13","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8742":"graduation"}},{"id":72406,"title":"Voice Video: Field Day 2014","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/voice-video-field-day-2014\/","content":"<iframe width=\"560\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/DP8qQi-XW88\" frameborder=\"0\" allowfullscreen><\/iframe>","excerpt":"The Paly Voice films Field Day 2014 with a GoPro.","date":"2014-05-22 18:30:04","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-3.jpg","categories":["Multimedia","Video"],"tags":{"8704":"field day","8953":"paly"}},{"id":71426,"title":"2014: Spring semester in review","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/2014-spring-semester-in-review\/","content":"[caption id=\"attachment_72249\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg\"><img class=\"size-full wp-image-72249\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg\" alt=\"One of the many highlights of this semester was Field Day, during which bungee jumping was been offered as an activity for the first time. Photo by Amanda Carlsson.\" width=\"800\" height=\"600\" \/><\/a> One of the many highlights of this semester at Palo Alto High School was Field Day last Friday, during which bungee jumping was offered as an activity for the first time. Photo by Amanda Carlsson.[\/caption]\r\n\r\nThe school year is finally coming to a close and among countless projects and finals, The Paly Voice wanted to take a break and remember all that has happened this past semester at Palo Alto High School and within the Paly community. Despite controversial news surrounding old Paly administration dominating the community, these past months have also been filled with fun and success. Before we all throw our books in the air and head into summer, we want to take a moment to reflect upon the last five months:\r\n\r\n<b>Clubs <\/b>\r\n\r\nClubs continued to be active on campus this semester in lunchtime performances, competitions and events. A highlight for clubs this spring semester came when the Science Olympiad team placed first in regionals to advance to the Northern California state competition, where it came in <a href=\"http:\/\/palyvoice.com\/2014\/04\/17\/science-olympiad-places-second-at-state-competition\/\">second place<\/a>. The Robotics team came in <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/robotics-team-places-22nd-out-of-58-at-silicon-valley-regional\/\">22nd<\/a> out of 58 teams in the Silicon Valley Regional competition to conclude its season. The club’s robot is built entirely by students, with little help from adult mentors. Additionally, The Best Buddies club was <a href=\"http:\/\/palyvoice.com\/2014\/05\/21\/palys-best-buddies-chapter-awarded-outstanding-high-school-chapter-of-the-year\/\">honored<\/a> as an “Outstanding High School Chapter of the Year” for the second year in a row.\r\n\r\n<b>Administration <\/b>\r\n\r\nThis semester saw not only changes in staff, but a change in administration attitudes. The administration selected Earl Hansen’s replacement: <a href=\"http:\/\/palyvoice.com\/2014\/03\/19\/breaking-news-admin-selects-new-athletic-director\/%20\">Jason Fung<\/a>. Not only is he a Paly graduate (‘92), but he has been actively involved in multiple sports programs at Paly since 2008. Next, the administration selected <a href=\"http:\/\/palyvoice.com\/2014\/03\/04\/meet-chase-palys-new-campus-supervisor\/%20 \">Chase Hartmann<\/a> to replace Mary Puorro as the new campus supervisor. You can catch Hartmann riding around campus on one of the golf carts. Finally, Principal Kim Diorio <a href=\"http:\/\/palyvoice.com\/2014\/03\/25\/principal-reaches-out-to-community-with-coffee-and-pizza\">reached out<\/a> to students in a whole new kind of way this semester: through pizza (and coffee for the parents). In an effort to reach out to the student and parent community, Diorio has installed a new series of lunch and morning meetings that will continue into next year.\r\n\r\n<strong>Sports <\/strong>\r\n\r\nSports this semester had many highs and lows, wins and losses and seasons ending and beginning. Winter sports seasons concluded on a bold note this semester, and spring sports began immediately after, with some spring seasons still underway.\r\n\r\nThe boys' basketball season ended in March with a 43-51 <a href=\"http:\/\/palyvoice.com\/2014\/03\/02\/boys-basketball-falls-to-m-a-in-ccs-quarter-finals-43-51\/\">loss<\/a> to Menlo-Atherton High School in the Central Coast Section quarterfinals. The team boasted a winning record, going 15-11 overall and 8-4 in league.\r\n\r\nThe girls' basketball team made a strong run in the CCS playoffs, <a href=\"http:\/\/palyvoice.com\/2014\/03\/04\/slideshow-girls-basketball-beats-mountain-view-in-ccs-thriller\/\">beating<\/a> Mountain View High School in a huge comeback to advance to the CCS semifinals, where it then <a href=\"http:\/\/palyvoice.com\/2014\/03\/05\/liveblog-girls-basketball-takes-on-north-salinas-in-ccs-semi-finals\/\">fell<\/a> to North Salinas High School. A highlight of the season came when the team <a href=\"http:\/\/palyvoice.com\/2014\/02\/03\/girls-basketball-triumphs-over-gunn-49-45\/\">beat<\/a> cross-town rival Gunn High School for the last time in the Big Gym before its planned demolition this summer. Gunn had beaten Paly twice the year before, so this close 49-45 win had even more meaning for the team.\r\n\r\nThe boys' soccer team ended its season with a 7-8-5 record, falling just short of qualifying for the CCS playoffs.\r\n\r\nThe girls' soccer team had a strong winning record of 11-5-5. The team's season ended in a 0-2 loss to Los Gatos High School in the CCS semifinals.\r\n\r\nThe wrestling team placed sixth place at the Santa Clara Valley Athletic League finals, allowing it to keep its spot in the De Anza League for next season.\r\n\r\nAs for the spring sports, the baseball team (15-14, 9-4) failed to capture a league title this year, but<a href=\"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/\"> looked to make a decisive run<\/a> in the SCVAL Playoffs, which began with a decisive 5-0 win over Wilcox High School. However, the Vikings lost a three-game league championship series to Saratoga High School after being down <a href=\"http:\/\/palyvoice.com\/2014\/05\/13\/pitchers-fail-to-hold-early-lead-vikings-fall-to-saratoga\/\">one game to none<\/a> to take second place in the SCVAL. The team then took  on Leland High School in the first round of CCS Playoffs yesterday, where it fell, 4-8.\r\n\r\nAfter moving down to the El Camino Division of SCVAL and hiring an ex-San Francisco Giant to coach, the softball team greatly improved upon last year’s overall record of 3-22 and is now 14-12 overall and 4-7 in league. The team honored its seniors on <a href=\"http:\/\/palyvoice.com\/2014\/05\/14\/slideshow-softball-trounces-fremont-on-senior-night\/\">Senior Night<\/a>, where the Lady Vikings dominated Fremont High School. The boys’ golf team had a successful season, capturing the SCVAL title for the second year in a row.\r\n\r\nThe boys’ swimming team placed first in the SCVAL championships as well, and both the girls’ and boys’ teams had <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/swimming-towards-ccs\/\">high expectations<\/a> to make a strong showing in the Central Coast Section Playoffs. The boys' swimming team fell short of these goals by barely losing in the CCS finals to the now 30-year reigning CCS champs Bellarmine High School last weekend.\r\n\r\nBoth the girls’ and boys’ track and field teams finished in the middle of the pack in terms of league standings, but competitors of individual events were <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/track-and-field-races-to-the-finish-line\/\">expected to do well<\/a> throughout the CCS playoffs. One such event was the 200 meters, for which senior Nick Sullivan and sophomore Eli Givens placed second and third respectively in the CCS finals yesterday.\r\n\r\nThe girls’ lacrosse team ended its season with a win by  beating Saratoga High School in the SCVAL championships. One highlight of the season came with a <a href=\"http:\/\/palyvoice.com\/2014\/05\/12\/slideshow-girls-lax-dominates-on-senior-night\/\">big win<\/a> over Los Gatos High School on Senior Night. Another was beating St. Francis High School during the season and also in the second round of SCVAL playoffs for redemption after St. Francis ended last year's Paly season in a triple-overtime thriller.\r\n\r\nThe boys’ lacrosse team recently defeated the previously undefeated Sacred Heart Preparatory, and advanced to the SCVAL semifinals where it<a href=\"http:\/\/palyvoice.com\/2014\/05\/18\/boys-lacrosse-season-ends-in-11-10-loss-to-m-a-in-scval-semifinal\/\"> lost to<\/a> Menlo-Atherton High School in a 10-11 nail-biter.\r\n\r\n<b>National Signing Day<\/b>\r\n\r\nIn early February, Paly hosted a <a href=\"http:\/\/palyvoice.com\/2014\/02\/06\/slideshow-senior-athletes-sign-national-letters-of-intent\/\">ceremony<\/a> for seniors signing their National Letters of Intent to play collegiate sports next year. The ceremony took place in the Big Gym and was led by Earl Hansen prior to his retirement. Eight seniors who will compete at both Division I and Division III levels attended the ceremony, although many other graduating students will also play varsity-level sports next year but did not attend. Approximately 30 Paly graduates will be participating in varsity collegiate athletics next year.\r\n\r\n<b>New ASB officers <\/b>\r\n\r\nAfter an exciting and close candidate race in March, the school elected the <a href=\"http:\/\/palyvoice.com\/2014\/03\/28\/brief-associated-student-body-election-results-annouced\/\">Associated Student Body Class of 2015<\/a>. Once the election was over, the new officers sat down with The Paly Voice to reveal some <a href=\"http:\/\/palyvoice.com\/2014\/04\/22\/fun-facts-of-future-asb-officers\/\">fun facts<\/a> about themselves. In April, ASB chose <a href=\"http:\/\/palyvoice.com\/2014\/04\/06\/liu-wins-asb-presidency-amid-higher-turnout\/\">next year’s group<\/a> of appointed officers.\r\n\r\n<b>Phil Winston<\/b>\r\n\r\nAfter former Paly principal Phil Winston mysteriously resigned last summer, students were left wondering what had happened. Part of the <a href=\"http:\/\/palyvoice.com\/2014\/04\/11\/former-principal-subject-to-disciplinary-action-according-to-pa-weekly-investigation\/\">answer<\/a> came in April, when Palo Alto Weekly published an <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">article<\/a> outlining the issues related to Winston’s resignation. The article spurred a whirl of controversy among the Paly community, leaving some students pleased and other disappointed. The event was a significant moment in Paly culture, and left a large impact among the student body.\r\n\r\n<b>Prom<\/b>\r\n\r\nThis year’s Prom was different than any other ever held before: not only was it held at a new and uncommon venue, but it was also the highest attended Prom in years. Prom was held at the San Francisco Exploratorium this year, at the museum’s new location on Pier 15. Although this venue choice <a href=\"http:\/\/palyvoice.com\/2014\/04\/08\/are-prom-tickets-more-expensive\/\">made Prom tickets more expensive,<\/a> it brought a unique experience to Paly Prom-goers. Presumably as a result of its location, this year’s Prom also brought about <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/asb-carries-out-last-minute-preparations-for-record-breaking-prom\">record-breaking tickets numbers<\/a>. With combined evidence from ticket numbers and <a href=\"http:\/\/palyvoice.com\/2014\/04\/21\/opinion-prahmm-2k14-in-review\">student surveys<\/a>, this year’s Prom was one of the most successful in Paly history.\r\n\r\n<strong>Construction<\/strong>\r\n\r\nAfter an extended construction period, the new two-story classroom building and the <a href=\"http:\/\/palyvoice.com\/2014\/01\/28\/slideshow-paly-media-arts-center\/\">Media Arts Center<\/a> finally were up and available for students to glimpse into after Spring Break. Although neither will officially open until the start of the 2014-2015 school year, students have been able to tour the buildings, and some Advanced Placement tests were taken in the new classroom building. The iconic Big Gym, which will be torn down this summer, was celebrated in a “Farewell Big Gym” <a href=\"http:\/\/palyvoice.com\/2014\/03\/25\/slideshow-farewell-big-gym-event-a-fitting-celebration\/\">event<\/a> in mid-March, honoring the 85 years it held athletic events, dances and more.\r\n\r\n<b>Powderpuff<\/b>\r\n\r\nThis year’s powderpuff competition saw many changes. The ASB class under Matt Hall and <a href=\"http:\/\/palyvoice.com\/2014\/03\/19\/breaking-news-admin-selects-new-athletic-director\/\">new athletic director<\/a> Jason Fung came together this year after complaints from previous years about team selections. This year was the first year a raffle system was implemented to select the teams as opposed to leaving the selection up to each class. This year, new rules prohibited the quarterback from running and required all players to wear mouthguards. In the <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/slideshow-underclassmen-dominate-powderpuff\/\">first round<\/a>, the seniors took on the freshmen. The seniors, seemingly frazzled by the new rules and new team, fell to the freshmen, 0-7. The sophomores and juniors then faced off, and the sophomore class proved victorious, 21-0. In the finals, which occurred during a long lunch thanks to a special schedule, the sophomores crushed the freshmen to take home the title. The powderpuff final half-time featured a celebration in honor of retiring physical education teacher, football coach and athletic director Earl Hansen and Sports Literature teacher and football announcer Mike McNulty.\r\n\r\n<b>NIOS <\/b>\r\n\r\nThis April, Not In Our School’s week came to a <a href=\"http:\/\/palyvoice.com\/2014\/04\/19\/paly-to-host-annual-not-in-our-schools-week\/\">much larger forefront<\/a> than in past years with daily lunchtime activities and performances. Each day had a color and a theme, such as <a href=\"http:\/\/palyvoice.com\/2014\/04\/24\/slideshow-nios-day-three\/\">Ability Awareness<\/a>, to go along with the activities.\r\n\r\n<b>Paly alumni<\/b>\r\n\r\nPaly alumnus of the Class of 2011 Davante Adams was <a href=\"http:\/\/palyvoice.com\/2014\/05\/10\/paly-alumnus-drafted-by-the-green-bay-packers\/\">drafted<\/a> by the Green Bay Packers in the second round of this year’s NFL draft. Adams was a member of the Paly State Championship team his senior year in high school. James Franco, a member of the Class of 1996, stars in his own movie titled “Palo Alto,” which was just released. His brother, Dave Franco, a member of the Class of 2003, will appear in “22 Jump Street” this June.\r\n\r\n<strong>Field Day<\/strong>\r\n\r\nField Day, which occurred just last Friday, gave students the chance to race through inflatable obstacle courses and bungee jump higher than the Tower Building while enjoying free food. Check out a Field Day slideshow <a href=\"http:\/\/palyvoice.com\/2014\/05\/20\/slideshow-annual-field-day-a-success\/\">here<\/a>.\r\n\r\n<b>Donald Sterling <\/b>\r\n\r\nAnd to finish it off with a little bit of pop culture, let's take a look at Mr. Donald Sterling. After a series of racist remarks surfaced the internet, the owner of the Clippers' basketball team was thrown into a fire of angry backlash. Paly students <a href=\"http:\/\/palyvoice.com\/2014\/05\/01\/voice-verbatim-what-are-your-opinions-on-the-los-angeles-clippers-owners-racist-remarks\/%20 \">shared their voices<\/a>, and so did others across the map. In the end, Sterling ended up being banned for life from the National Basketball Association, as NBA commissioner Adam Silver took a firm stance against racism and united the entire country against it as well. Sterling’s consequences were met with pleasure from mass audiences who feel that such radical statements have no place in our nation’s progress.","excerpt":"The school year is finally coming to a close, and among countless projects and finals The Paly Voice wanted to take a break and remember all that has happened this past semester at Palo Alto High School.","date":"2014-05-22 17:30:14","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_photo-2-copy.jpg","categories":["Features"],"tags":{"8410":"Baseball","10098":"basketball","8644":"diorio","15675":"donald sterling","8704":"field day","14851":"fun","8738":"Golf","8836":"Lacrosse","11162":"media arts building","19409":"new classroom building","15846":"powderpuff","9016":"prom","9110":"Soccer","9241":"wrestling"}},{"id":72280,"title":"Vandalism incidents on newly-repainted Senior Deck cause stir","permalink":"http:\/\/palyvoice.com\/2014\/05\/22\/vandalism-incidents-on-newly-repainted-senior-deck-cause-stir\/","content":"[caption id=\"attachment_72328\" align=\"alignnone\" width=\"547\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png\"><img class=\"size-full wp-image-72328\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png\" alt=\"According to an anonymous trio of juniors, some members of the junior class painted over the '2014' on the Senior Deck Monday night in response to tension on Twitter between members of the junior and senior classes. The vandalism came the Monday after senior Hayley Tawzer organized an administration-approved class activity to paint the Senior Deck in a camouflage design as a class gift. Photo courtesy of Daniel Tachna-Fram.\" width=\"547\" height=\"353\" \/><\/a> Vandals painted over the '2014' on the Senior Deck Monday night in response to tension on Twitter between members of the junior and senior classes. The vandalism came the Monday after senior Hayley Tawzer organized an administration-approved class activity to paint the Senior Deck in a camouflage design as a class gift. Photo by Daniel Tachna-Fram.[\/caption]\r\n\r\nAfter a Palo Alto High School senior organized an administration-endorsed Class of 2014 project to paint the Senior Deck over the weekend, the deck has seen two counts of vandalism, the first incident discovered Monday evening and the second this morning.\r\n\r\nSenior Hayley Tawzer, who came up with the idea to paint the deck early on in the school year, said she felt disrespected by Monday’s vandalism, in which a ‘5’ was painted in yellow, the Spirit Week color for the junior class, over the ‘4’ in the ‘2014’ painted on the top of the deck.\r\n\r\n\"I felt very disrespected as an individual and as a member of the class of 2014,\" Tawzer said.\r\n\r\nAccording to a junior who witnessed the painting of the '5' in washable paint, the alleged vandals were trying to start a junior prank after engaging in a pointed Twitter discussion between seniors and juniors over the use of the Senior Deck.\r\n\r\nThe tension between the junior and senior classes appeared to begin when some juniors used the deck Monday, a day when most of the senior class did not show up to school in observance of an unofficial \"senior cut day\". According to senior Ethan Look, social media posts by the juniors of themselves enjoying the Senior Deck prompted him to tweet the following message:\r\n\r\n<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.33.48-PM.png\"><img class=\"alignnone size-full wp-image-72281\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.33.48-PM.png\" alt=\"\" width=\"615\" height=\"313\" \/><\/a>\r\n\r\nThe witness said that the consequent Twitter conversation, of which various Paly upperclassmen and alumni were contributors, sparked a group of juniors to form a plan to retaliate by painting over part of the deck.\r\n\r\n“A bunch of people  were fed up with how the seniors were being really rude to us [on Twitter],” the anonymous junior said.\r\n\r\nWhile Look said he did not intend for his tweet to be taken literally, he did agree that the Twitter conversations contributed to the motives for the vandalism.\r\n\r\n“I certainly do think the arguments on Twitter fueled the fire,” Look said. “With my first tweet, I had no intentions of making anybody mad. I strongly believe that the next senior class deserves to inherit the deck, but I wouldn’t be a senior if I didn’t defend my turf a little.”\r\n\r\n[caption id=\"attachment_72286\" align=\"alignleft\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo1.jpg\"><img class=\"wp-image-72286\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo1.jpg\" alt=\"Students gather on the Senior Deck during seventh period Wednesday afternoon. Senior Hayley Tawzer organized the painting of the deck in a camouflage pattern for her 20 Percent Project in Erin Angell's World Literature class. On Monday night, a group of juniors allegedly painted over the '4' in the '2014' with a yellow '5', using the junior class color and graduation year for the Class of 2015. Photo by Allison Cowie.\" width=\"400\" height=\"300\" \/><\/a> Students gather on the Senior Deck during seventh period Wednesday afternoon. Senior Hayley Tawzer organized the painting of the deck in a camouflage pattern for her 20 Percent Project in Erin Angell's World Literature class. On Monday night, a group of juniors allegedly painted over the '4' in the '2014' with a yellow '5', using the junior class color and graduation year for the Class of 2015. Photo by Allison Cowie.[\/caption]\r\n\r\nAccording to Tawzer, many students thought that the painting of the deck was a senior prank and were not aware that the activity was approved by the administration and funded by ASB.\r\n\r\n“This [the repainting] was not a senior prank, it was a senior project,” Tawzer said. “It’s part of a Twenty Percent Project for Ms. [Erin] Angell,” referring to the semester-long project in which Angell’s World Literature students spend 20 percent of their time devoted to the class designing and completing a project of their choice.\r\n\r\nMembers of the junior class expressed disappointment in the alleged actions of their classmates.\r\n\r\n“I wish they [the juniors] hadn’t painted the 5 on the deck,” junior Paloma Tracy said. “When the seniors painted the deck, it was a nice gesture for the school, and it should not have been disrespected like that.”\r\n\r\n“I think it just makes our class look bad,” junior Courtney Hartwell said. “It’s not our time yet to take over as seniors.”\r\n\r\nTawzer, along with senior Talia Brown, cleaned off the yellow paint from the '5' late Monday night, she said. The scrubbing process took around one-and-a-half hours.\r\n\r\nThe deck, now restored to its fresh paint job, features a camouflage-print background and '2014' written in large white numbers across its surface.\r\n\r\n“Since the first day of school this year, my friends and other people have been talking about painting the deck and making it better,” Tawzer said. “My hope of painting the deck was that the Class of 2014 would leave behind a new tradition or legacy to the other classes to come. I meant for this to be a fun, cool way for the senior classes to bond and add their own style and class spirit to the deck when their time came.\"\r\n\r\nAccording to the junior witness, who said she watched others paint the '5', the students who allegedly painted over the deck were not trying to be disrespectful.\r\n\r\n“We weren’t trying to be disrespectful at all,” the source said. “If we knew that it would hurt their feelings or that it had anything with them trying to give a gift to the school [we wouldn’t have done it].”\r\n\r\nA second junior who took part in the vandalism added that many juniors were not happy with the design of the deck because it clearly is associated with the Class of 2014.\r\n\r\n[caption id=\"attachment_72282\" align=\"alignright\" width=\"300\"]<img class=\"wp-image-72282\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-4.34.16-PM.png\" alt=\"Senior Ethan Look tweeted an edited picture of the deck vandalism, adding 'PALY' over the '2014' to encourage school unity, he said. Photo courtesy of Ethan Look.\" width=\"300\" height=\"374\" \/> Senior Ethan Look tweeted an edited picture of the deck vandalism, digitally adding 'PALY' over the '2014' and '2015' to encourage school unity, he said. Photo courtesy of Ethan Look.[\/caption]\r\n\r\n“They [the seniors] decided to paint the deck and they did an awesome job, but saying its a ‘present’ to us, with a big ‘2014’ on it isn’t something we really wanted,” she said. “This is high school, so there will always be rivalries and pranks pulled on different classes. That’s what keeps things interesting.”\r\n\r\nNow that the yellow paint has been washed off, seniors are enjoying their use of the redesigned deck.\r\n\r\n“[The deck] definitely looks good, it really shows all the school spirit that our class has and it really unifies us,” senior William Yang said. “It looks freakin’ awesome, I love it.\"\r\n\r\nLook, who later tweeted an edited picture of the deck with ‘PALY’ digitally painted over the ‘2014' and '2015', stressed the importance of school unity.\r\n\r\n“When it comes down to it, we all go to Paly, and we all want the same thing: an environment that can lead us to success in the future,” Look said. “That will not come about if there is hatred between classes, and no matter how fun it is to be on the deck and rub it in to the other grades, we can’t have people sneaking into Paly to paint the deck and bullying people on the Internet.”\r\n\r\n[caption id=\"attachment_72415\" align=\"alignnone\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_20140522_094155.jpg\"><img class=\"wp-image-72415\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_20140522_094155.jpg\" alt=\"Seniors lounge on the senior deck at brunch Thursday after a red '7' was painted over the new paint job, which restored the deck when a similar vandalism incident occurred Monday in which a yellow '5' was painted over the '4' in '2014'. Photo by Charles Yu.\" width=\"400\" height=\"300\" \/><\/a> Seniors lounge on the senior deck at brunch Thursday after a red '7' was painted over the new paint job, which restored the deck when a similar vandalism incident occurred Monday in which a yellow '5' was painted over the '4' in '2014'. Photo by Charles Yu.[\/caption]\r\n\r\n<em>UPDATE:<\/em> A red ‘7’ was found painted over the ‘4’ on the Senior Deck Thursday morning. As of lunch, the ‘4’ had been repainted but red paint remains on the camouflage design. The source of the vandalism is unknown at this time. <i>More information to come<\/i>.","excerpt":"Members of the junior class vandalized the newly-painted senior deck Monday night, according to three juniors who said they participated in the painting of a yellow '5' over the '2014' logo, which was part of an administration-endorsed senior project.","date":"2014-05-22 14:56:43","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-21-at-8.27.00-PM.png","categories":["News","Spotlight"],"tags":{"12701":"2014","19460":"2015","8496":"ASB","19457":"erin angell","15678":"ethan look","17779":"hayley tawzer","8944":"palo alto high school","19459":"senior deck","19458":"vandalism"}},{"id":71422,"title":"Paly&#8217;s Best Buddies chapter awarded &#8220;Outstanding High School Chapter of the Year&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/05\/21\/palys-best-buddies-chapter-awarded-outstanding-high-school-chapter-of-the-year\/","content":"[caption id=\"attachment_72243\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_img_2226.jpg\"><img class=\"wp-image-72243\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_img_2226.jpg\" alt=\"Best Buddies Club President Kate Marinkovich and club member Rachel _____ lead a booth on &quot;Ability Awareness&quot; day of Not in Our Schools week. Photo by Becca Raffel.\" width=\"650\" height=\"433\" \/><\/a> Best Buddies Club President Kate Marinkovich and club member Rachel Marcotte lead a booth on \"Ability Awareness\" day of Not in Our Schools week. Photo by Becca Raffel.[\/caption]\r\n\r\nPalo Alto High School's Best Buddies chapter received the \"Outstanding High School Chapter of the Year\" award by the Best Buddies Organization last month, making the chapter a two-time consecutive recipient of the award.\r\n\r\nBest Buddies is an international organization whose high school programs aim to establish friendships between students with and without intellectual and developmental disabilities (IDD), according to its <a href=\"http:\/\/www.bestbuddies.org\/our-programs\">website<\/a>.\r\n\r\nKristen Reeves, the San Francisco Bay Area Best Buddies Program Manager, addressed why Paly deserved this award.\r\n\r\n\"Paly was selected for this award because they emulate our ultimate vision, which is to put ourselves (Best Buddies) out of business,\" Reeves wrote in an e-mail. \"Best Buddies strives to have equality between those with and without Intellectual and Developmental disabilities [so] that programs won’t be necessary to forge inclusion.\"\r\n\r\nThe Paly Best Buddies Club is headed by senior Club President Kate Marinkovich and sophomore Vice President Griffin Carlson. Special Education Teacher Erika Magagna is the club adviser.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2013\/05\/05\/best-buddies-named-the-best-of-the-buddies\/\">Last year,<\/a> the Paly chapter won this award for the first time, and Marinkovich and her sophomore buddy Diya Rao also won Outstanding Buddy Pair of the Year.\r\n\r\nMagagna credits Marinkovich with playing a large role in helping the Paly chapter stand out.\r\n\r\n\"Our chapter president Kate Marinkovich has been super, super awesome,\" Magagna said. \"Just her personality \u001f– people can talk to her, she's outgoing and positive ... she brings that positive energy, so it makes our events more fun. Her commitment has really, really helped. The relationships she's got with her buddy has helped others see how it can be, then others follow her example.\"\r\n\r\nThe Paly chapter's strong commitment to the club by individual members is another contributing factor to the chapter's success, according to Magagna.\r\n\r\n\"We just have really, really awesome kids,\" Magagna said. \"There's Griffin [Carlson] and his sister [sophomore] Brin [Carlson] and just a lot of peer buddies with really good kids who sign up for it because they are genuinely interested in it, so then their commitment really shines through. [Senior] Jack Paladin has also been a great buddy and role model. His commitment has been exceptional.\"\r\n\r\nThe quality of the friendships created through the Paly Best Buddies chapter sets a good example for others to follow, according to Reeves.\r\n\r\n\"I started working for Best Buddies last October, and since then, I have been told that Palo Alto is the example for what Best Buddies chapters should be,\" Reeves said. \"Their friendships go beyond the classroom and are integrated into the daily lives of all the participants.\"\r\n\r\nThe friendships are enjoyable for the club members, which makes it fun for them to meet their commitments, Magagna said.\r\n\r\n\"Our students really meet their commitments: they're hanging out with their buddies for lunch at school at least once a week and then they have two outside of school events that everyone's required to do,\" Magagna said. \"Everyone has just got good friendships, so it's fun for them to go ice skating or go to Great America or whatever.\"\r\n\r\nThe future for the Paly Best Buddies chapter is bright, Reeves said.\r\n\r\n\"Paly is well on its way to creating an environment of pure equality, inclusion and opportunity for those with IDD and that is why they were selected to be our Outstanding High School Chapter,\" Reeves said.","excerpt":"The Palo Alto High School Best Buddies chapter received the \"Outstanding High School Chapter of the Year\" award by the Best Buddies Organization last month.","date":"2014-05-21 22:04:57","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/rsz_img_2226.jpg","categories":["News"],"tags":{"19410":"best buddies","8822":"kate marinkovich","19411":"magagna","19413":"outstanding chapter of the year award","19412":"reeves"}},{"id":72299,"title":"Track and field prepares for CCS meet","permalink":"http:\/\/palyvoice.com\/2014\/05\/21\/track-and-field-prepares-for-ccs-meet\/","content":"<p style=\"color: #000000;\">The Palo Alto High School track and field teams are looking forward to the Central Coast Section Semi Finals Saturday at San Jose City College.<\/p>\r\n<p style=\"color: #000000;\">The Paly boys finished the league season (2-4) and placed second in the Santa Clara Valley Athletic League meet May 16th at Santa Clara High School, while the girls finished up with a record of 4-2 in the league and placed sixth at the league meet.<\/p>\r\nBoth teams will send their 1600-meter and 400-meter relay teams to the meet, along with several individual qualifiers.\r\n<p style=\"color: #000000;\">Senior sprinter Nick Sullivan is looking forward to facing new competition at the meet.<\/p>\r\n<p style=\"color: #000000;\">\"I've been looking forward to this for a long time,\" Sullivan said. \"I'm probably most excited just to have some competition in the 400 meter dash. I haven't really had any in our league all year.\"<\/p>\r\n<p style=\"color: #000000;\">Sullivan is coming off of a record setting performance at the SCVAL meet, running a 21.72 in the 200 meter dash and breaking a meet record previously held by Paly alumnus E.J. Floreal ('13). However, Sullivan knows there is still room for improvement.<\/p>\r\n<p style=\"color: #000000;\">\"My goals are to just get a personal record in all my events,\" Sullivan said. \"I'm going all out and we will see what I can do.\"<\/p>\r\n<p style=\"color: #000000;\">The boys' team has had to rely on a young team this year led by Sophomore sprinter Eli Givens who believes he has a good chance to win the 100 meter dash.<\/p>\r\n<p style=\"color: #000000;\">\"I think I can win the one,\" Givens said. \"I just have to have a good race and get out of my blocks fast and with that, I should have a pretty good chance to win the race.\"<\/p>\r\n<p style=\"color: #000000;\">According to Senior sprinter Jessica Branson, the girls' team is very excited to be running against top competition in the championship meet.<\/p>\r\n<p style=\"color: #000000;\">\"Our favorite thing about CCS is that there are so many talented athletes there to watch,\" Branson said. \"It's fun to race against them. Track can be a team sport or an individual sport, and that is why it's super cool.\"<\/p>\r\n<p style=\"color: #000000;\">Branson is excited for an opportunity for the team to improve on its results from last year.<\/p>\r\n<p style=\"color: #000000;\">\"I'm looking forward to hopefully beating our current record in the 400- meter relay which is 49.34 seconds,\" Branson said. \"We also want to try and place higher than we finished last year.\"<\/p>\r\nThe meet will start at 2 p.m. on Saturday at San Jose City College. The finals for CCS will be held at 4 p.m. next Friday at San Jose City College.","excerpt":"The Palo Alto High School track and field teams are looking forward to the Central Coast Section Semi Finals Saturday at San Jose City College. <a href=\"http:\/\/palyvoice.com\/2014\/05\/21\/track-and-field-prepares-for-ccs-meet\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-21 21:21:43","author":"Malcolm Davis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/real-track-resized.jpg","categories":["Sports"],"tags":{"8568":"CCS","9656":"eli givens","19484":"jess branson","8917":"nick sullivan","19485":"sprinters","9181":"track","9183":"track and field"}},{"id":72132,"title":"Gunn senior to compete on MasterChef","permalink":"http:\/\/palyvoice.com\/2014\/05\/21\/gunn-senior-to-compete-on-masterchef\/","content":"[caption id=\"attachment_72186\" align=\"alignleft\" width=\"145\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/JPEG-Ahran-Edited-145x300.jpg\"><img class=\"size-full wp-image-72186\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/JPEG-Ahran-Edited-145x300.jpg\" alt=\"Gunn High School senior Ahran Cho will compete on the season premiere of MasterChef May 26.  Photo courtesy of Ahran Cho. \" width=\"145\" height=\"300\" \/><\/a> Gunn High School senior Ahran Cho will compete on the season premiere of MasterChef May 26. Photo courtesy of Ahran Cho.[\/caption]\r\n\r\nA Gunn High School senior will compete on the reality television show MasterChef for its fifth season later this month.\r\n\r\nMasterChef judges selected Ahran Cho into the Top 30 chefs after first round of auditions, according to Cho. Cho said she was completely surprised when she found out she was chosen.\r\n\r\n“It was weird to think that out of all the tens of thousands of people who had auditioned, I had been chosen,” Cho said in an email. “Initially, I was in disbelief. But then I realized that my hard work had paid off and I had made it.”\r\n\r\nCho, who has been watching cooking shows since she was a young child, first thought about auditioning for MasterChef after seeing the message at the end of an old episode.\r\n\r\n“I was watching re-runs of Season Four, and during the finale, Chef [Gordon] Ramsay tells the viewers to apply and audition for Season Five,” she said. “Upon watching this, I kind of felt super-intrigued and wanted to look at the guidelines.”\r\n\r\nAfter Cho did some initial research, she realized that an audition might be the perfect opportunity to grow her culinary talents. Serendipitously, she was just qualified for audition eligibility, turning 18 years old two weeks before the January 1, 2014 requirement.\r\n\r\n“You also had to be an American citizen,” she said. “I had just received my American citizenship like five months before, too. I felt like it was kind of fate.”\r\n\r\nAlthough Cho will get the chance to compete under the world’s spotlight on MasterChef, she has been showcasing her talents for others since a young age after being inspired by the chefs she saw on television, she said.\r\n\r\n“Ever since I was young, I’ve been a fan of watching cooking shows on TV,” she said. “I learned a lot of fancy terms and cooking techniques by watching my favorite chefs on television, and I started filming my own shows at age 9.”\r\n\r\nSince then, Cho has steadily expanded her culinary skills. In addition to working at various restaurants, she spent a summer at a cooking school in South Korea as a 14-year-old. According to Cho, her youth, especially in comparison to her fellow adult-aged students, made the schooling experience more difficult.\r\n\r\n“Since I was by far the youngest ... the assistant kind of ignored me, especially since I was from America, and she assumed my Korean wasn't very good,” Cho said. “On one of the days ... she threw the soup I had spent two hours on down the drain, and I spent the whole night crying over it.”\r\n\r\nWhile her 14-year-old self struggled to stay positive, Cho said that the experience has made her more resilient.\r\n\r\n“I think the fact that she looked down on me really motivated me to push back and work harder in my cooking,” she said.\r\n\r\nThis time, Cho has received nothing but encouragement.\r\n\r\n“My parents were … super supportive [of my audition],” she said. “I didn't expect them to encourage me, but their support really made me want to audition and succeed even more.“\r\n\r\nCho, who will attend the University of Nevada, Las Vegas in the fall, does not plan to study culinary arts in college. However, both her plan to major in Hotel Administration and, especially, her school's location will give her opportunities to continue her growth as a chef.\r\n\r\n“Since there are so many great restaurants and hotels on the [Las Vegas] Strip, I feel like it would be great exposure for me [to go to UNLV],” she said. “I want to get out in the field and really work hands-on. I think after I get a regular college degree, I will consider going to culinary school, but for now, I want a normal college experience.”\r\n\r\nViewers can see Cho compete in the season premiere of MasterChef at 8 p.m. May 26 on FOX. Check out this <a title=\"MasterChef Season 5 Trailer\" href=\"http:\/\/www.fox.com\/watch\/241086019788?cmp=user_post\">trailer<\/a> for a sneak peak.","excerpt":"MasterChef judges selected Ahran Cho, a senior at Gunn High School, into the Top 30 after she auditioned along with tens of thousands of other contestants.","date":"2014-05-21 18:57:57","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-20-at-1.15.14-PM.png","categories":["Editor's Pick","Features"],"tags":{"19309":"ahran cho","19311":"ahran cho masterchef","19312":"gordon ramsay","8752":"gunn high school","19310":"masterchef"}},{"id":72072,"title":"Slideshow: Boys&#8217; lacrosse falls to M-A in SCVAL semifinal","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/slideshow-boys-lacrosse-falls-to-m-a-in-scval-semifinal\/","content":"Palo Alto High School boys' lacrosse (13-7, 9-5) team ended its season on Wednesday May 14 following an 11-10 loss to the Menlo-Atherton Bears (13-11, 9-5) at Paly in the Santa Clara Valley Athletic League semifinal.\r\n\r\n[slideshow post_id=72072]","excerpt":"Palo Alto High School boys' lacrosse (13-7, 9-5) team ended its season on Wednesday May 14 following an 11-10 loss to the Menlo-Atherton Bears (13-11, 9-5) at Paly in the Santa Clara Valley Athletic League semifinal.","date":"2014-05-20 13:39:29","author":"Phoebe So","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5298.jpg","categories":["Slideshow","Sports"],"tags":{"12015":"boys lacrosse","8811":"jordan gans","17799":"josh stern","8836":"Lacrosse","10306":"menlo-atherton","12172":"owen staiger"}}]