[{"id":78216,"title":"Fall sports: up-and-coming JV athletes","permalink":"http:\/\/palyvoice.com\/2014\/11\/16\/fall-sports-up-and-coming-jv-athletes\/","content":"Some may wonder where impressive varsity players gain their talent and attitude. Often the answer lies in the overlooked junior varsity teams, where athletes are able to develop and improve their skills.\r\n\r\nHere are just a few of the promising fall JV athletes that will be essential to the future of Palo Alto High School athletics.\r\n\r\nClick on the photo to navigate.\r\n<div align=\"center\">\r\n<div class=\"stlr-embed-container embed-large\" data-type=\"compact\" data-story-id=\"385041202812028798\"><script src=\"http:\/\/steller.co\/js\/steller.js\"><\/script>","excerpt":"Here are just a few of the promising JV athletes that will be essential to the future of Palo Alto High School athletics.","date":"2014-11-16 22:16:29","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-16-at-10.13.24-PM.png","categories":["Sports","Spotlight"],"tags":{"32738":"alex beaudry","32741":"cassie fong","8620":"cross country","8693":"Fall","8714":"football","32742":"maya rebitzer","32739":"molly wietzman","32740":"paul jackson","32743":"reed foster","9120":"sports","9216":"volleyball","9846":"water polo"}},{"id":78691,"title":"Spring musical auditions: not to be slept through","permalink":"http:\/\/palyvoice.com\/2014\/11\/16\/spring-musical-auditions-not-to-be-slept-through\/","content":"With the end of the Palo Alto High School's fall show, \"Server of Two Masters,\" on Saturday, comes auditions for the spring musical \"The Drowsy Chaperone.\"\r\n\r\n[caption id=\"attachment_79056\" align=\"aligncenter\" width=\"570\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/6-L.jpg\"><img class=\"wp-image-79056\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/6-L.jpg\" alt=\"\" width=\"570\" height=\"380\" \/><\/a> Seniors Oskar Soderberg and Will Kast finished up as leads in \"Server of Two Masters.\" Both will be attending \"The Drowsy Chaperone\" auditions which begin Tuesday. Photo courtesy of Paly Theatre.[\/caption]\r\n\r\n“'The Drowsy Chaperone' is an inherently hilarious show because it parodies all of the crazy and ridiculous things that happen in other musicals,” senior stage manager Hannah Nguyen said.\r\n\r\nAuditions begin 2:30 p.m. Tuesday, Nov. 18, in the Haymarket Theater and will continue to the end of the week with each day dedicated to a certain aspect of the audition process. Everyday students will be asked to wear appropriate, comfortable clothing and be on time, according to Director Kathleen Woods.\r\n\r\n“The auditions are open and then the director, Kathleen Woods, in consultation with musical director, Michael Najar, conducts callbacks, where they see how well an auditioner fits a specific role,” Nguyen said.\r\n\r\nTuesday is dedicated to vocal auditions. Any student who auditions for the musical must audition with 16 bars of a traditional musical theater song. Music Director Michael Najar is available to help students choose and rehearse songs. There will be an accompanist available.\r\n\r\nWednesday will be a dance audition day. Students who have tap dance shoes are asked to bring them, according to Kathleen Woods. Additionally, stage movement specialist Kim Saunders will help with the auditions.\r\n\r\n“She [Saunders] will probably teach a combination and then we [auditioners] will do them in small groups,” senior Jamie Garcia said.\r\n\r\nThursday will be focused on acting. There will be a variety of parts for auditioners to read from, and people may be asked to read more than once.\r\n\r\n“They [students] will be given a 'side,' also known as a scene, to read as their audition,\" junior Clara Baker said. \"They will have time to practice before going up. When it is time for their audition, they should hand their forms to the auditioners and then walk onto the stage, state their name and the character they are reading for, take a moment and then begin. Don't forget to say thank you at the end.\"\r\n\r\nOn Friday, the callback list will be posted <a href=\"http:\/\/www.palytheatre.com\">online<\/a> and on the Haymarket doors. Even if students are not called back, there is a high likelihood that they can still be cast in the show. The official list will be posted on Sunday, Nov. 23.\r\n\r\nThere are 12 major parts, and Woods hopes to have an ensemble of 20 to 40 students. The official rehearsal schedule has not yet been released but can be found <a href=\"http:\/\/www.palytheatre.com\/calendar\/\">here<\/a>. The shows will be held on March 6-8 and 12-14.\r\n\r\nWoods is very excited to hold auditions and see the play come together.\r\n\r\n“The show is just so fun and everyone can participate,” Woods said.\r\n\r\n&nbsp;","excerpt":"The spring musical, The Drowsy Chaperone, will hold auditions November 18-21. The musical hopes to have a cast of around 50 students and include all aspects of song, dance and acting. The performances are in March 2015. See Kathleen Woods in the theatre for more information.","date":"2014-11-16 19:48:35","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed.jpg","categories":["Entertainment"],"tags":{"32596":"audition","8626":"dance","32571":"drowsy chaperone","29689":"kathleen woods","32594":"kwoods","32595":"michael najar","19628":"musical","30526":"najar","8953":"paly","29646":"paly theater","9104":"sing","32593":"spring","9159":"theater","9160":"theatre"}},{"id":79043,"title":"Common Application workshop during Tutorial on Nov. 18 in computer lab 2","permalink":"http:\/\/palyvoice.com\/2014\/11\/16\/common-application-workshop-during-tutorial-on-nov-18-in-computer-lab-2\/","content":"","excerpt":"","date":"2014-11-16 12:07:03","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32734":"common app","32735":"essay workshop"}},{"id":78868,"title":"Former Editors in Chief respond to national journalism awards","permalink":"http:\/\/palyvoice.com\/2014\/11\/15\/former-editors-in-chief-respond-to-national-journalism-awards\/","content":"Two Palo Alto High School journalism publications won 2014 National Scholastic Press Association Pacemaker Awards last Saturday.\r\n\r\nThe awards were given for separate categories and recognized the publications' work from the 2013-14 school year. The <a href=\"http:\/\/http:\/\/www.palycampanile.org\/\">Campanile<\/a> won a pacemaker award for a Broadsheet of 17 pages or more, and <a href=\"http:\/\/http:\/\/verdemagazine.com\/\">Verde<\/a> Magazine won a Pacemaker Award for news magazines.\r\n\r\nOne of last year’s Campanile Co-Editors in Chief Hillel Zand was excited and reflective about the award.\r\n\r\n“We [The Campanile] had such an outstanding year last year, covered some major stories and generated major buzz within the community,” Zand said in a Facebook message.\r\n\r\nOne of last year’s Co-Verde Editors in Chief Noam Shemtov was proud of his publication’s dedication that he says ultimately led to the award via Facebook message.\r\n\r\n“It is great to watch the magazine win for a collection of work by people I have a license to be proud of,” Shemtov said. “Our staff worked very hard to produce those five issues, and those who remained on staff continue to do so this year.”\r\n\r\nZand says he believes that each award is a representation of hard work and dedication and should not be taken lightly, despite the number of awards won over the years.\r\n\r\n“They [the awards] should not be taken for granted and are as a testament to Paly's commitment to student journalists,” Zand said.","excerpt":"The Campanile and Verde Magazine Editors in Chief responded to their recent nominations for National Scholastic Press Association Pacemaker Awards. ","date":"2014-11-15 21:20:03","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo2.jpg","categories":["News"],"tags":{"8506":"Award","32711":"hillel zand","8814":"journalism","32710":"national scholastic press assocation","32712":"noam shemtov","32709":"nspa","32708":"pacemaker","8944":"palo alto high school","8953":"paly","30020":"publications","32714":"the campanile","32713":"verde magazine"}},{"id":78863,"title":"Girls&#8217; volleyball to play Homestead in CCS quarterfinals","permalink":"http:\/\/palyvoice.com\/2014\/11\/15\/girls-volleyball-to-play-homestead-in-ccs-quarterfinals\/","content":"[caption id=\"attachment_76370\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0819.jpg\"><img class=\"size-full wp-image-76370\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0819.jpg\" alt=\"Sophomore right side hitter Katie Passerello hits the ball over the net. Passerello had a kill in the first set. Photo by Liana Pickrell. \" width=\"600\" height=\"399\" \/><\/a> Sophomore outside hitter Katie Passerello hits the ball over the net in a game against Mountain View High School on Oct. 14. Passerello had a kill in the first set. Mountain View won this match in five sets: 25-21, 18-25, 25-20, 17-25, 15-7. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe Palo Alto High School girls' volleyball team (4-8, 19-11) will play Homestead High School (10-2, 22-13) in the Central Coast Section playoffs at 7 p.m. today at Homestead.\r\n\r\nAccording to junior middle Claire Dennis, this match will be especially important because Paly has lost to Homestead multiple times before.\r\n\r\n\"This is going to be an intense match because we've lost to Homestead in the past this season and also in past years in CCS,\" Dennis said. \"We played them in the finals last year, so that was a big rivalry.\"\r\n\r\nSophomore outside hitter Katie Passarello explained the relationship between Paly and Homestead.\r\n\r\n\"It's been a pretty big rivalry just because both teams tend to do very well in league,\" Passarello said. \"They're both big schools and athletic in all their different sports, not just volleyball. So we tend to get head-to-head with them in multiple sports.\"\r\n\r\nGiven this rivalry, Dennis believes that Paly has what it takes to win.\r\n\r\n\"I think Homestead is tough competition, but I think that we definitely have the ability to beat them because we've been working really hard in practice and we've had a lot of improvement since last time we played Homestead,\" Dennis said. \"Since then, we've been going up and becoming a lot stronger and a lot more consistent.\"\r\n\r\nPassarello also has high hopes for an intense game.\r\n\r\n\"It'll be a tough match, but if we play well, which I know we can, it'll be a really fun game because there'll be a lot of competition,\" Passarello said.","excerpt":"The Palo Alto High School girls' volleyball team (4-8, 19-11) will play Homestead High School (10-2, 22-13) in the Central Coast Section playoffs at 7 p.m. today at Homestead.","date":"2014-11-15 16:32:53","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0819.jpg","categories":["Sports","Uncategorized"],"tags":{"8568":"CCS","32706":"dennis","8734":"girls","32704":"homestead","32705":"passarello","9888":"quarterfinals","9216":"volleyball"}},{"id":78627,"title":"Liveblog: Football at Saratoga","permalink":"http:\/\/palyvoice.com\/2014\/11\/14\/liveblog-football-at-saratoga\/","content":"<em>Check back at 7 p.m. on Friday, Nov. 14 as the Palo Alto High School football team (3-6, 2-3) travels to south to take on the Saratoga High School Falcons (4-5, 2-3) for its final regular season game of the season. <\/em>\r\n\r\n[liveblog]","excerpt":"Check back at 7 p.m. on Friday, Nov. 14 as the Palo Alto High School football team (3-6, 2-3) travels to south to take on the Saratoga High School Falcons (4-5, 2-3) for its final regular season game of the season. ","date":"2014-11-14 17:00:52","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-10-at-8.40.13-PM.png","categories":["Football","Sports"],"tags":{"8714":"football","8855":"liveblog","8944":"palo alto high school","9063":"saratoga"}},{"id":78621,"title":"Juniors triumph at debate tournament","permalink":"http:\/\/palyvoice.com\/2014\/11\/14\/juniors-triumph-at-debate-tournament\/","content":"Adding to the success of the Palo Alto High School Speech and Debate team's season so far, two Paly juniors won impressive victories at the Coast Forensic League Tournament, which took place at South San Francisco High School last weekend.\r\n\r\n[caption id=\"attachment_78623\" align=\"alignleft\" width=\"203\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10799774_734068660013116_2100911624_n.jpg\"><img class=\" wp-image-78623\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10799774_734068660013116_2100911624_n.jpg\" alt=\"Junior Jenny Xin celebrates after going undefeated at the Coast Forensic League Tournament at South San Francisco High School this weekend. Photo by Anna Nakai.\" width=\"203\" height=\"276\" \/><\/a> Junior Jenny Xin celebrates after going undefeated at the Coast Forensic League Tournament at South San Francisco High School last weekend. Photo courtesy of Anna Nakai.[\/caption]\r\n\r\nJunior Gabi Rossner participated in both the Congress and the Lincoln-Douglas debate competitions Debate, placing first in the Congress division. Junior Jenny Xin only participated in the Lincoln-Douglas debate division but went undefeated.\r\n\r\nAs Rossner's first time competing in the Congress division, she did not expect to win.\r\n\r\n“I was in a chamber with a lot of advanced people, so I was really nervous,\" Rossner said. \"I had so much fun though, and winning was a pleasant surprise”.\r\n\r\nXin won all four rounds of her debates, which guaranteed her a spot at State Qualifications as her success at the tournament granted her a wildcard. According to Xin, the card not only grants her a place but also does not take away any of the allotted spots for the school.\r\n\r\nXin will continue to work hard in preparing for the upcoming tournament.\r\n\r\n“I'll keep reviewing my past rounds and trying to improve my speaking style and arguments,” Xin said.\r\n\r\nSpeech and Debate team director Jennie Savage praised both Rossner's and Xin's accomplishments.\r\n\r\n<span style=\"color: #222222;\">\"What is remarkable about Jenny and Gabi is that their exceptional talents are not limited to particular categories,\" Savage said. \"To be able to do communicate perfectly across both intellectual and creative platforms is rare.\"<\/span>\r\n\r\nPreviously in the season at the University of Pacific tournament in October, Xin won first place in the Original Prose and Poetry speech competition with her stand-up comedy piece, and Rossner placed third with a comedic musical.\r\n\r\nThe next debate tournament will be the The Harker Upper School Invitational, which will take place this weekend in San Jose.","excerpt":"Adding to the success of the Palo Alto High School Speech and Debate team's season so far, two Paly juniors won impressive victories at the Coast Forensic League Tournament, which took place at South San Francisco High School last weekend.\r\n","date":"2014-11-14 13:49:37","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image1-1.jpeg","categories":["News"],"tags":{"32673":"coast forensic league","8614":"congress","8638":"debate","28581":"gabi rossner","10525":"jennie savage","10195":"Jenny Xin","8851":"lincoln douglas","8944":"palo alto high school","19261":"speech and debate"}},{"id":78713,"title":"Liveblog: Girls&#8217; water polo plays second round CCS","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/liveblog-girls-water-polo-plays-second-round-ccs\/","content":"The Palo Alto High School girls' water polo team (13-14, 6-6) will play against Carlmont High School (12-6, 4-3) in the second round of Central Coast Section playoffs at 7 p.m. today at Paly. They won their last game 12-7 against Woodside High School (4-9, 1-3). Check here for live updates of the game.\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School girls&#8217; water polo team (13-14, 6-6) will play against Carlmont High School (12-6, 4-3) in the second round of Central <a href=\"http:\/\/palyvoice.com\/2014\/11\/13\/liveblog-girls-water-polo-plays-second-round-ccs\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-11-13 13:23:56","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10807060_340765169436392_266510215_n.jpg","categories":["Sports"],"tags":{"8568":"CCS","8734":"girls","9846":"water polo"}},{"id":76769,"title":"The ultimate pearl milk tea challenge: A weekend in the city","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/the-ultimate-pearl-milk-tea-challenge-a-weekend-in-the-city\/","content":"[caption id=\"attachment_76774\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg\"><img class=\"size-full wp-image-76774\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg\" alt=\"Plentea is this week's best reviewed PMT. Plentea specializes in fruit teas, crema oolong teas and pearl milk teas. Photo by Alex Merkle-Raymond\" width=\"650\" height=\"488\" \/><\/a> Plentea is this week's best reviewed PMT. Plentea specializes in fruit teas, crema oolong teas and pearl milk teas. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nWelcome to the third installment of the ultimate Pearl Milk Tea challenge. You can find previous PMT reviews <a href=\"http:\/\/palyvoice.com\/category\/the-ultimate-pmt-challenge\/\" target=\"_blank\">here<\/a>.\r\n\r\nThis week, I am reviewing the PMT I tried while in San Francisco. This city brought out the best PMT I’ve ever had, and also the worst.\r\n\r\n<strong>Boba Guys<\/strong>\r\n\r\n<em><span style=\"color: #222222;\">3491 19th St., San Francisco 94110<\/span><\/em>\r\n\r\n[caption id=\"attachment_76776\" align=\"alignleft\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9877.jpg\"><img class=\"size-full wp-image-76776\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9877.jpg\" alt=\"Boba Guys' PMT was very sweet but the pearls were delicious. Everything is very modern and organic. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Boba Guys' PMT was very sweet, but the pearls were delicious. Everything is very modern and organic. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 6.5\/10\r\n\r\n<em>What I ordered<\/em>: Classic milk tea with almond milk and pearls ($4)\r\n\r\n<em>Features<\/em>:\r\n\r\nThis place is very trendy. There are weekly tastings of tea flavors and additions to make the store seem more communal. The syrups and almond jelly are made from scratch, and almost everything is organic, according to the <a href=\"http:\/\/www.bobaguys.com\" target=\"_blank\">Boba Guys website<\/a>.\r\n\r\nI ordered a drink with almond milk because Boba Guys is one of the few places I’ve been to that has a dairy free option, and I wanted to take advantage of it.\r\n\r\nThe server was generous with the pearls, which were very chewy and flavorful and did not disintegrate. The tea flavor was very strong, but the drink was incredibly sweet. At certain points, some sips would be almost unbearably sweet if the syrup wasn’t completely mixed in.\r\n\r\nA downfall was the slow service, but Boba Guys does call the drinks the \"Slow Bar\" in warning. Also, the drink was served with a snap-on lid. Some people may not understand the importance of this, but without a vacuum sealed lid, it is impossible to shake the drink into a perfect mixture with no too-sweet spots.\r\n\r\n&nbsp;\r\n\r\n<strong>Boba Delight<\/strong>\r\n\r\n<address style=\"font-weight: inherit;\"><span style=\"font-weight: inherit; font-style: inherit;\">528 Larkin St., <\/span><span style=\"font-weight: inherit; font-style: inherit;\">San Francisco<\/span>, <span style=\"font-weight: inherit; font-style: inherit;\">94102<\/span><\/address>\r\n\r\n[caption id=\"attachment_76781\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9884.jpg\"><img class=\"wp-image-76781 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9884.jpg\" alt=\"Boba Delight was very sweet and watery. The pearls were also very sweet and disintegrating. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Boba Delight was very sweet and watery. The pearls were also sweet and disintegrated. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 2.5\/10\r\n\r\n<em>What I ordered<\/em>: Small coconut green pearl milk tea ($2.45)\r\n\r\n<em>Features:<\/em>\r\n\r\nBoba Delight features a small selection of ice cream, a significant array of funky foods and a large variety of pearl milk tea drinks. It’s relatively new, and you can purchase glass bottles to bring in again for a discount. Boba Delight also has a stamping rewards system that gives you a free drink after you buy 10 drinks.\r\n\r\nI personally will not return and do not recommend that anyone try it. The service was very slow, and once I finally received my drink, I was less than impressed.\r\n\r\nThe drink was incredibly sweet and super syrupy. At the time time, it seemed like they used water instead of milk because it was so thin and not at all creamy. I could not mix the drink to see if it was just mixed poorly because it had a snap-on lid.\r\n\r\nThe pearls were very soft and would often clog up the straw. They started to disintegrate quickly and would leave a tapioca pearl residue on the sides of the cup. Everything seemed very artificial, and I could barely tell if they gave me the flavor I asked for.\r\n\r\n&nbsp;\r\n\r\n<strong>Quickly<\/strong>\r\n\r\n<em>300 Walnut St., <span style=\"font-weight: inherit;\">Redwood City<\/span>, <span style=\"font-weight: inherit;\">Calif.,<\/span> <span style=\"font-weight: inherit;\">94063<\/span><\/em>\r\n\r\n[caption id=\"attachment_76779\" align=\"alignleft\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9888.jpg\"><img class=\"size-full wp-image-76779\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9888.jpg\" alt=\"Quickly was not very flavorful but the service was very fast and the sizes are large. Quickly is everywhere and a deal for people who can find a flavor they really like. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Quickly was not very flavorful, but the service was fast and the sizes are large. Quickly is everywhere and a monetary steal for people who can find a flavor they really like. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<em>Overall Rating<\/em>: 4\/10\r\n\r\n<em>What I ordered:<\/em> Small jasmine pearl milk tea ($2.70)\r\n\r\n<em>Features:<\/em>\r\n\r\nQuickly is everywhere. I would personally call it the McDonald’s of pearl milk tea places. I have had Quickly on multiple occasions, and I have never been particularly impressed. This location was no exception.\r\n\r\nIt has very fast service, large cup sizes and many options for mix-ins. I chose the usual tapioca pearls which were large and very chewy. The pearls did not leave remnants in the cup, but coated the inner straw and mouth. In general, the drink was sweet, very milky and not very flavorful.\r\n\r\nThe straws were not wrapped, which I have never seen before and made me a little suspicious. Quickly uses the FIVESTARS reward card system and is cash only. I would say that if you can find a flavor you like, go because it’s cheap, but be aware that it’s not very good either.\r\n\r\n&nbsp;\r\n\r\n<strong>Plentea<\/strong>\r\n\r\n[caption id=\"attachment_76782\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9927.jpg\"><img class=\"wp-image-76782 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9927.jpg\" alt=\"Plentea did not have many flavor options but what it did have was delicious. The tea was very flavorful and consistent in sweetness and texture. The pearls were large and chewy. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Plentea did not have many flavor options, but what it did have was delicious tea. The tea was very flavorful and consistent in sweetness and texture. The pearls were large and chewy. Photo by Alex Merkle-Raymond.[\/caption]\r\n\r\n<address style=\"font-weight: inherit;\"><span style=\"font-weight: inherit; font-style: inherit;\">341 Kearny St., <\/span><span style=\"font-weight: inherit; font-style: inherit;\">San Francisco<\/span>, <span style=\"font-weight: inherit; font-style: inherit;\">94108<\/span><\/address><em>Overall Rating<\/em>: 9\/10\r\n\r\n<em>What I ordered:<\/em> Black pearl milk tea ($5.00)\r\n\r\n<em>Features:<\/em>\r\n\r\nPlentea is right next to Chinatown and the financial district in San Francisco, so it was difficult to find parking, but once I did, it was worth it. The store is two stories and very modern. The food menu is mainly fancy variations on waffles and sandwiches.\r\n\r\nThe staff members were very informative and answered all my questions – when I went back the next day, they remembered me and were very glad I was back. All drinks are served in cool glass containers, and the store will give you a 10 percent discount if brought back. The bottles also have a lid for transportation and reusability.\r\n\r\nThere was a line out the door that was very slow moving, but once you’ve ordered, the drinks come quickly. There are few flavor options, but there are fruit drinks, smoothies, teas and many combinations of all of these.\r\n\r\nThe tea was very flavorful with large, soft pearls. The drink was very creamy and because there was no flavoring, there was no mixing required for a perfectly smooth drink. The texture was even throughout the bottle, which I very much appreciated.\r\n\r\n<i>Please leave a comment to suggest Pearl Milk Tea places you would like reviewed. <\/i>","excerpt":"Staff writer Alex Merkle-Raymond takes the PMT challenge to San Francisco where she experiences the best and worst PMT she's ever had. Through the Mission District, the Tenderloin and the Financial District, Pearl Milk Tea is judged fairly and in great detail. Please leave a comment for any suggestions of other places to try.","date":"2014-11-13 13:10:15","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9952.jpg","categories":["Blog","Spotlight","The ultimate PMT challenge"],"tags":{"29478":"blog","29703":"boba","30534":"boba delight","30533":"boba guys","29705":"pearl milk tea","30536":"plentea","29704":"pmt","30535":"quickly","9061":"San Francisco"}},{"id":78700,"title":"Breaking news: Crystal-Foster concedes school board race","permalink":"http:\/\/palyvoice.com\/2014\/11\/13\/breaking-news-crystal-foster-pulls-out-of-school-board-race\/","content":"The contest for the remaining seat on the Palo Alto school board came to an end this morning when Catherine Crystal-Foster announced today that she is conceding the race.\r\n\r\nAll the vote-by-mail ballots have been counted, which secured the first seat to Ken Dauber, according to Santa Clara County registrar of voters. In a competition for the second open seat and with the provisional ballots uncounted, Crystal-Foster trailed 199 votes behind Godfrey at last count, and the \"uncounted ballots are unlikely to change the outcome,\" Crystal-Foster said in an email to her campaign staff and supporters.\r\n\r\nHere is the full text of her email announcement:\r\n\r\n\"We've all been watching the living lesson that every vote truly counts in our democracy. At this point, the county has recorded all remaining vote-by-mail ballots, and there are only a few thousand uncounted provisional ballots remaining county-wide. Ken Dauber has secured one school board seat, and Terry Godfrey is ahead of me by 199 votes for the second seat. The uncounted ballots are unlikely to change the outcome, so I offer my sincere congratulations to Ken and Terry as the new members of our school board. Both Terry and Ken will be staunch advocates for our students, and I wish them both the best. I have great regard for the talent and dedication that all the candidates brought to this race. My best to Gina Dalma and Jay Cabrera, as well, who share a commitment to education and will, I'm confident, continue their good work on behalf of students. I look forward to continuing my service to the schools and our students, and will do so in a spirit of collaboration with all our school leaders.\r\n\r\n\"I am grateful for the opportunity to have spent these past six months discussing the future of Palo Alto’s schools with so many in our community. I continue to be energized by you, by the opportunities before us, and by the ambition of our new superintendent. To those of you who walked, called, endorsed, created, gave, wrote, informed, and inspired over this campaign -- many, many thanks. We created a network of positive thinkers who care about education that will continue long after the final ballots are counted.\r\n\r\n\"I am privileged to have been surrounded and supported by so many wonderful friends and neighbors in this journey. I thank you all from the bottom of my heart.\"\r\n\r\nAn announcement on Crystal-Foster's Facebook page reads:\r\n\r\n\"The last vote-by-mail ballots have been counted, and Ken has retained the first school board seat and Terry is ahead of me by 199 votes for the second. While provisional ballots remain uncounted, it is unlikely that those will change the outcome. Thus, I've reached out to Ken and Terry to congratulate them as our new school board members. They both care deeply about students and I wish them the very best. To each and every one of you, I offer my deepest thanks for all your hard work, belief in our positive and forward-looking message, and for your friendship and support. I feel privileged to have worked with such a wonderful team and look forward to continuing to work with you in our schools and community for the benefit of all our students.\"","excerpt":"The contest for the remaining seat on the Palo Alto school board came to an end this morning when Catherine Crystal-Foster announced today that she is pulling out of the race.","date":"2014-11-13 11:28:08","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/rsz_img_7834.jpg","categories":["News"],"tags":{"12701":"2014","32676":"catherine crystal-foster","32598":"crystal-foster","29789":"dauber","8667":"elections","29787":"godfrey","8828":"ken dauber","32677":"palo alto school board","9069":"School Board","32674":"terry godfrey","32675":"votes","9219":"voting"}}]