[{"id":76739,"title":"PAUSD celebrating Unity Day on Oct. 23 for National Bullying Prevention Month","permalink":"http:\/\/palyvoice.com\/2014\/10\/19\/pausd-celebrating-unity-day-on-oct-23-for-national-bullying-prevention-month\/","content":"","excerpt":"","date":"2014-10-19 11:33:36","author":"Lizzie Chun","categories":["Ticker"],"tags":{"30528":"national bullying prevention month","9197":"unity day"}},{"id":76720,"title":"Fall concert is a &#8220;ritual&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/fall-concert-is-a-ritual\/","content":"Palo Alto High School's choir will be singing at 4 p.m. tomorrow at Grace Lutheran Church for the “Ritual” fall <a href=\"http:\/\/http:\/\/palychoirs.com\/events\/ritual-a-fall-concert-presented-by-the-palo-alto-high-school-choral-program\/\">concert.<\/a>\r\n\r\nThis fall’s theme includes songs from customs, ceremonies and spirituals according to choir director Michael Najar.\r\n\r\nMany different groups involved with Paly choir will sing tomorrow, including Madrigal Singers, Spectrum Singers, Beginning Choir, Men’s Chorus and a cappella groups.\r\n\r\n“Heartbeats is starting off the year by singing Mr. Sandman by the Chordettes,\" senior Claire Chevallier said. \"We chose this song because it sticks to our style, and we wanted to begin with a more traditional option. In concert choir, we're singing a variety of spirituals as well as some more contemporary songs.”\r\n\r\nChoir co-president Grant Smith is excited for the concert and thinks everyone will be able to enjoy it.\r\n\r\n\"T<span style=\"color: #3e454c;\">he concert is titled 'Ritual,' and all the songs we are singing were really important to a certain people at one point,\" Smith said. \"It's a really nice upbeat mix of spirituals, pop a cappella and just some just really beautiful a cappella the a cappella groups will be there to debut the stuff they've been working really hard on, too. I think it will be a really nice concert with something for everyone to enjoy.\"<\/span>\r\n\r\nThis will be the first Paly choir concert for the freshmen singers, and they are looking forward for it to all come together.\r\n\r\n“I'm so excited to hear how 'Soon Ah Will Be Done' is going to sound with the freshmen, especially with the great acoustics in the church,” sophomore Emily Read said.\r\n\r\nTickets are sold at the door: $10 for adults and $5 for students and seniors. Children under 12 get in for free.\r\n\r\n&nbsp;","excerpt":"Paly Choir's fall concert is tomorrow featuring music from customs and ceremonies that are famous and generally upbeat. Tickets are sold at the door at Grace Lutheran Church at 4 p.m.","date":"2014-10-18 22:10:27","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/14138647541_ddd91b8a4a_z.jpg","categories":["News"],"tags":{"8583":"choir","8613":"concert","8693":"Fall","30526":"najar","30527":"paly choirs","30525":"rituals"}},{"id":76711,"title":"MAC grand opening day 3: Exclusive interview with Betsy Franco","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-exclusive-interview-with-betsy-franco\/","content":"The Paly Voice interviewed Palo Alto High School alumnus James Franco's mother Betsy Franco, in a video exclusive below. Franco graduated from Paly in 1996 and featured his film adaptation of his poetry in a 50-minute video for the third day of the Media Arts Center grand opening.\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"\/\/www.youtube.com\/embed\/mckl-jfarLI\" frameborder=\"0\" allowfullscreen><\/iframe>","excerpt":"The Paly Voice interviewed Palo Alto High School alumnus James Franco's mother Betsy Franco, in a video exclusive below. Franco graduated from Paly in 1996 and featured his film adaptation of his poetry in a 50-minute video for the third day of the Media Arts Center grand opening.","date":"2014-10-18 18:55:28","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-18-at-6.55.15-PM.png","categories":["Multimedia","Video"],"tags":{"30390":"betsy franco","8706":"film","8801":"james franco","18366":"mac","11127":"media arts center","8944":"palo alto high school","30391":"poetry"}},{"id":76485,"title":"Art Center to host Global Family Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/art-center-to-host-global-family-day\/","content":"[caption id=\"attachment_76600\" align=\"alignnone\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_20141017_165050.jpg\"><img class=\" wp-image-76600\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_20141017_165050.jpg\" alt=\"Global family day will take place at the Palo Alto Art Center on 1313 Newell Road from 2 p.m. to 5 p.m. tomorrow.  Admission is free.  Photo by Saba Moussavian.\" width=\"587\" height=\"440\" \/><\/a> Global family day will take place tomorrow at the Palo Alto Art Center on 1313 Newell Road. Admission is free. Photo by Saba Moussavian.[\/caption]\r\n\r\nThe Palo Alto Art Center will be hosting a free Global Family Day from 2 p.m. to 5 p.m. tomorrow.\r\n\r\nThe event will include art-making activities from 2 p.m. to 4 p.m. and dance performances from 4 p.m. to 5 p.m. by <a href=\"http:\/\/www.xpressionsdancemusic.com\/site\/home\/\">Xpressions<\/a>, an Indian dance group, and <a href=\"https:\/\/sites.google.com\/site\/folkloricdancetroop\/\">Raice De Mexico<\/a>, a Mexican folkloric dance group, according to the Art Center <a href=\"https:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/artcenter\/cals.asp?ViewBy=7&amp;CalDate=10\/19\/2014&amp;EventDateID=9617\">website<\/a>.\r\n\r\n[caption id=\"attachment_76598\" align=\"alignright\" width=\"369\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg\"><img class=\"wp-image-76598 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg\" alt=\"Indian dance group Xpressions performs at the reopening of the Palo Alto Art Center.  Xpressions along with Mexican folkloric dance group Raice De Mexico will perform at Global Family day on Sunday.  Photo courtesy of Palo Alto Art Center.\" width=\"369\" height=\"277\" \/><\/a> Indian dance group Xpressions performs at the reopening of the Palo Alto Art Center. Xpressions, along with Mexican folkloric dance group Raice De Mexico, will perform at Global Family Day on Sunday. Photo courtesy of Palo Alto Art Center.[\/caption]\r\n\r\nAlthough the Art Center has hosted fall festivals in the past, this is the first year that the event will have a world culture theme, according to Art Center Family Programming and Outreach Coordinator Tasmia Zahra Hussain.\r\n\r\n“We really wanted to think of ideas on how we can bring a more diverse audience to the Art Center and make it a more welcoming place for people from different cultures,” Hussain said. “We have art activities from all different cultures so people can kind of feel like they can relate.”\r\n\r\nThe dances are all performed by children and teens who dress up in costumes, according to Hussain.\r\n\r\n“It’s a great way to introduce all the different dances from the different parts of the world to our audience,” Hussain said. “It’s a wonderful experience for the whole family.”\r\n\r\nHussain says the activities are catered to all ages.\r\n\r\n“All the art activities are designed in a way where they can adapt to all different age groups,” Hussain said. “Young people can adapt to it just like the older people.”\r\n\r\nHussain says the Art Center is expecting a high turnout and that she is looking forward to tomorrow's event.\r\n\r\n“It’s a great way of spending an afternoon of just art making,” Hussain said. “I hope to see some Paly students there.”","excerpt":"The Palo Alto Art Center will be hosting a free Global Family Day from 2 p.m. to 5 p.m. tomorrow.","date":"2014-10-18 18:48:33","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/8092067746_4a7f1fcc04_c.jpg","categories":["News"],"tags":{"8626":"dance","30385":"global family day","8940":"palo alto art center","30387":"raice de mexico","30388":"tasmia zahra husssain","30386":"xpressions"}},{"id":76688,"title":"MAC grand opening day 3: Interviews","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-interviews\/","content":"The Paly Voice interviewed attendees in line for day 3 of the Media Arts Center grand opening today. The event featured introductions from The Campanile adviser Esther Wojcicki and James Franco, who graduated from Paly in 1996. Franco is currently showcasing an artistic short film he created.\r\n\r\nUpdate: The Paly Voice also interviewed Franco's mother, Betsy Franco, in a video exclusive <a href=\"http:\/\/palyvoice.com\/2014\/10\/18\/mac-grand-opening-day-3-exclusive-interview-with-betsy-franco\/\" target=\"_blank\">here<\/a>.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/Tbw5E9uA0P4?list=UUVOXMqsivga_Tqan2Iuqr6w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice interviewed attendees in line for day 3 of the Media Arts Center grand opening today. The event featured introductions from The Campanile adviser Esther Wojcicki and James Franco, who graduated in 1996.","date":"2014-10-18 18:21:50","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-18-at-6.19.32-PM.png","categories":["Spotlight","Video"],"tags":[]},{"id":76383,"title":"Livestream: MAC Grand Opening &#8211; Day 3","permalink":"http:\/\/palyvoice.com\/2014\/10\/18\/livestream-mac-grand-opening-day-3\/","content":"The final day of the MAC Grand Opening closes with guest speaker actor and Palo Alto High School alumnus James Franco. Franco will feature his artwork inspired by Paly yearbook photos at the event, as well as debuting his 50-minute music video.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/wCYevJNbtW0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The final day of the MAC Grand Opening closes with guest speaker actor and Palo Alto High School alumnus James Franco. Franco will feature his <a href=\"http:\/\/palyvoice.com\/2014\/10\/18\/livestream-mac-grand-opening-day-3\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-18 17:04:20","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg","categories":["Multimedia"],"tags":{"29994":"1993","30024":"3","8493":"art","8494":"arts","30014":"as","8570":"center","9679":"day","30012":"debut","29992":"franco","30010":"grand","30016":"happened","30015":"it","29991":"james","8801":"james franco","27721":"lifestream","27175":"live","27174":"livestream","18366":"mac","30011":"media","8904":"mural","8906":"music","9677":"opening","30013":"painting","8939":"palo alto","8953":"paly","29648":"show","9208":"video"}},{"id":76588,"title":"Liveblog: MAC Grand Opening Day 3","permalink":"http:\/\/palyvoice.com\/2014\/10\/17\/liveblog-mac-grand-opening-day-3\/","content":"<p>Check back in starting at 5 p.m. on Saturday Oct. 18 to get live updates from the Media Arts Center as actor and Paly alumnus James Franco holds an art show and film premiere as part of the grand opening of the building.<\/p>\r\n<p>[liveblog]<\/p>\r\n","excerpt":"Check back in starting at 5 p.m. on Saturday Oct. 18 to get live updates from the Media Arts Center as actor and Paly alumnus James Franco holds an art show and film premiere as part of the grand opening of the building. ","date":"2014-10-17 21:38:55","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg","categories":["Uncategorized"],"tags":{"27710":"grand opening","8801":"james franco","8855":"liveblog","18366":"mac"}},{"id":73427,"title":"Journalist in-residence returns to Macedonia to set up youth program","permalink":"http:\/\/palyvoice.com\/2014\/10\/17\/journalist-in-residence-returns-to-macedonia-to-set-up-youth-program\/","content":"To some, the Palo Alto High School Media Arts Center has become a go-to hangout spot, a second home during production week or a prime place to take a nap. To Aleksandar Atanasov, it served as inspiration for the future.\r\n\r\n[caption id=\"attachment_76119\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10723199_951948531488611_1272741096_n.jpg\"><img class=\"wp-image-76119\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10723199_951948531488611_1272741096_n.jpg\" alt=\"Aleksandar Atanasov and Paly journalism adviser Paul Kandell discuss Atanasov's plan to build a youth journalism program in Macedonia. Atanasov's educational background is focused on political science, and he has worked at the Macedonian Information Agency for five years, specializing in foreign policy. Photo by George Lu.\" width=\"400\" height=\"285\" \/><\/a> Aleksandar Atanasov and Paly journalism adviser Paul Kandell discuss Atanasov's plan earlier this month to build a youth journalism program in Macedonia. Atanasov's educational background is focused on political science, and he has worked at the Macedonian Information Agency for five years, specializing in foreign policy. Photo by George Lu.[\/caption]\r\n\r\nTwo years ago in Skopje, the capital of the Republic of Macedonia, Atanasov came up with the idea to build a platform for Macedonian youth to voice their opinions and address issues relevant to their generation – the first of its kind in the nation. After spending four months in the United States, Atanasov left last week, ready to set his plan in motion.\r\n\r\nAtanasov’s proposal to establish a Macedonia youth journalism association consists of multiple steps, including finding domestic and international organizations that are interested in supporting his idea. Once he finds enough backing, he will host discussions on youth journalism in Macedonia and officially form the association, working out the structural details, including resource distribution.\r\n\r\nAtanasov divided his time in the U.S. evenly between working at the San Francisco Examiner and spending time at Paly to get both the professional and youth-centered sides of journalism that he hopes to bring together in his own project.\r\n\r\nAtanasov’s initial plan was to focus on youth journalism in Skopje. However, after seeking out the advice of his friends in the field and Paul Kandell, a Paly journalism adviser (and adviser to The Paly Voice), Atanasov realized his idea would best serve the public by broadening his scope to all of Macedonia.\r\n\r\n\"The founding of the association would be more beneficial for the youth in Macedonia,” Atanasov said. “You will have a place where anyone that [has] an idea to do something that will benefit the youth can be heard and can get people that want to work with him or her in doing that and get the support and resources. ... It would [speed up] the process of advancing the youth media in the first place.”\r\n\r\nMacedonia declared its independence from Yugoslavia in 1991, and Atanasov compared the state of press rights at that time to a \"free, wild-west environment,\" with few regulations instated. Atanasov personally has not encountered the threat of censorship, which he partially attributes to his work in international news rather than domestic issues. Atanasov's positive experience with journalism while working for the past five years at the Macedonian Information Agency, a public information and news service, influenced his proposal.\r\n\r\n“I was lucky to end up in a working environment and doing the work [I] love,” Atanasov said. “If I could provide something similar for as many students as possible, it would be a very rewarding thing.”\r\n\r\n[caption id=\"attachment_76118\" align=\"alignleft\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10719518_951958934820904_284453896_n-copy.jpg\"><img class=\"wp-image-76118\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10719518_951958934820904_284453896_n-copy.jpg\" alt=\"Atanasov observes The Paly Voice class. Atanasov initially considered creating a program similar to Voice with an online platform focused on local student news. However, the logistical and organizational details of the program will now be determined by the association. Photo by George Lu.\" width=\"300\" height=\"242\" \/><\/a> Atanasov observes The Paly Voice's class in the new Media Arts Center at Palo Alto High School. Paly's first journalist in-residence, Atanasov initially considered creating a program similar to Voice with an online platform focused on local student news. However, the logistical and organizational details of the program will now be determined by the Macedonia youth journalism association that Atanasov is in the process of establishing. Photo by George Lu.[\/caption]\r\n\r\nAs Paly’s inaugural journalist in-residence, Atanasov expressed his appreciation of the guidance he received.\r\n\r\n“You [Paly] are open – [an important aspect is] not that you’re leading in the United States or in California, but that you’re also open to show the way or to lead someone to do similar things in other countries, like a role model,” Atanasov said. “It’s not just doing something, but also giving the chance for someone to participate and see how you’re doing things, to learn from you.”\r\n\r\nDuring his time at Paly, Atanasov drew inspiration from not only the student publications, but also from how the MAC seemed to impact the way the publications are run. Despite the opportunities that the MAC presents, Atanasov recognizes that emulating the MAC in Macedonia will not be feasible for years to come.\r\n\r\n\"It [the MAC] serves [as] a good vision to follow, but it does not fit very well for a plan or a blueprint for a potential project in Macedonia,” Atanasov said. “You need years and years of working and resolving things to come into a position to have a facility like this. I like what I see here, but I’m more focused on what I can truly take and start from scratch in Macedonia.”\r\n\r\nUltimately, Atanasov says he believes that once he gets his project started, the rest of the plan will fall into place.\r\n\r\n\"You will find really engaged students who want to learn, and there are a lot of stories that are untackled in the society,” Atanasov said. “They [the students] will eventually be the first to write about some things that are happening, so it will be easy to get the readers after they [come] out with interesting stories.\"\r\n\r\nAtanasov imagines a future Macedonian newsroom aflutter with students preparing for the production of Skopje’s student newspaper. But it’s not just in Skopje – it’s also in Bitola, Kumanovo and other cities all around the nation, all working to achieve the goals they have set forth for themselves, the same goals that Paly journalism strives for. After all, according to Atanasov, the new generations in the U.S. and Macedonia alike talk “about the same stories, TV series or the last movie that came out or what happened to [the] Kardashians – it’s the same.\" So why can’t journalism be the same, too?","excerpt":"To some, the Palo Alto High School Media Arts Center has become a go-to hangout spot, a second home during production week or a prime place to take a nap. To Aleksandar Atanasov, it served as inspiration for the future.","date":"2014-10-17 16:05:36","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10723199_951948531488611_1272741096_n.jpg","categories":["Editor's Pick","Features"],"tags":{"29961":"aleks","29090":"aleksandar atanasov","18366":"mac","27171":"macedonia","29712":"macedonia youth journalism association","29094":"Macedonian Information Agency","11127":"media arts center","8944":"palo alto high school","29714":"republic of macedonia","29092":"skopje","29093":"student journalism","29091":"the examiner","29713":"youth journalism"}},{"id":76133,"title":"Livestream: MAC Grand Opening &#8211; Day 2","permalink":"http:\/\/palyvoice.com\/2014\/10\/17\/livestream-mac-grand-opening-day-2\/","content":"Day 2 of the MAC Grand Opening Ceremony at Palo Alto High School. Check back here at 5 p.m. on Friday, Oct. 17 for the livestream.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/SdmtT3kptHo\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"Day 2 of the MAC Grand Opening Ceremony at Palo Alto High School. Check back here at 5 p.m. on Friday, Oct. 17 for the <a href=\"http:\/\/palyvoice.com\/2014\/10\/17\/livestream-mac-grand-opening-day-2\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-17 15:34:38","author":"Wesley Woo","categories":["Multimedia"],"tags":{"30022":"2","12340":"alumni","8494":"arts","8570":"center","9679":"day","30021":"friday","30010":"grand","30018":"house","8820":"kandell","27175":"live","27174":"livestream","18366":"mac","30011":"media","30017":"open","9677":"opening","8953":"paly","8972":"parents","30020":"publications","30023":"stream","9132":"students","30019":"taxpayer","27740":"two","12702":"wojcicki"}},{"id":76135,"title":"Vikings remain confident despite recent adversity","permalink":"http:\/\/palyvoice.com\/2014\/10\/17\/vikings-remain-confident-despite-recent-adversity\/","content":"The Palo Alto High School football team (1-4, 0-1) will look to build off of a productive bye week as it receives another chance at a second victory on the season this Friday against Monta Vista High School (1-4, 0-2).\r\n\r\nThe Vikings, ever since a season-opening victory on the road at Sequoia, have lost four straight games, including their first three home contests. During the team's most recent game, <a href=\"http:\/\/palyvoice.com\/2014\/10\/02\/liveblog-football-vs-wilcox\/\">a 20-19 loss<\/a> against the Wilcox Chargers (4-1, 2-0), senior running back and captain Jayshawn Puckett exited early after suffering an apparent ankle injury during the third quarter. According to junior wide receiver Eli Givens, Puckett and several other hampered Vikings received some well-needed rest during the bye week.\r\n\r\n[caption id=\"attachment_76556\" align=\"alignnone\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-6.27.50-PM.png\"><img class=\"size-full wp-image-76556\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-6.27.50-PM.png\" alt=\"Junior wide receiver Oliver Svirsky catches a pass in front of a Wilcox defender during a 20-19 loss. Photo by Josh Yuen. \" width=\"767\" height=\"613\" \/><\/a> Junior wide receiver Oliver Svirsky catches a pass in front of a Wilcox defender during a 20-19 loss. Photo by Josh Yuen.[\/caption]\r\n\r\n\"Last week we just took things a little slowly and it gave some of our players time to heal from injuries,\" Givens said. \"The attitude from the team is that we're going to Monta Vista and going to get the job done: make plays, score touchdowns and come home with a win.\"\r\n\r\nThe Wilcox game was a solid bounce back performance, especially from the team's defense. After surrendering a total of 123 points in three games following the win at Sequoia, the Vikings defense held a tough Wilcox offense scoreless in the second half, forcing three fumbles. Despite falling short on the scoreboard, head coach Jake Halas is proud of the way his team competed hard at home after suffering back-to-back-to-back blow-out losses.\r\n\r\n\"I'm proud that our boys gave the student body a show,\" Halas said after the game. \"They deserve it. They come out every game and fill out their section, and I'm glad we put a show on for them.\"\r\n\r\nAs for this week, Halas was grateful for a bye week that provided rest and the opportunity to improve on overall technique in preparation for Friday's showdown of struggling teams.\r\n\r\n\"We practiced on getting better, just technique,\" Halas said. \"We got some of our guys healthy and are getting ready for Monta Vista. We expect to go in there and take care of business. Their record is identical to ours, but we need to go in there and dominate.\"\r\n\r\nThe Vikings and Matadors kick off at 7 p.m. this Friday at Monta Vista.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School football team (1-4, 0-1) will look to build off of a productive bye week as it receives another chance at a second victory on the season this Friday against Monta Vista High School (1-4, 0-2).","date":"2014-10-17 09:47:54","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-6.27.50-PM.png","categories":["Football","Sports"],"tags":[]}]