[{"id":76893,"title":"&#8220;Must have&#8221; Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/must-have-spirit-week-outfits\/","content":"[caption id=\"attachment_76987\" align=\"alignnone\" width=\"585\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.16.51-PM.png\"><img class=\"wp-image-76987\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.16.51-PM.png\" alt=\"Screen Shot 2014-10-23 at 1.16.51 PM\" width=\"585\" height=\"321\" \/><\/a> During Spirit Week's color day last year, the freshmen wore orange, sophomores wore red, juniors wore yellow and seniors wore green. Photo by Cathy Rong.[\/caption]\r\n\r\nWith Spirit Week right around the corner, it's time to get started on outfit planning. The five-day event can be slightly daunting, but if you plan ahead and take it a day at a time, you'll be ready to go with minimal stress. If you're creative and resourceful, there are easy ways to make cheap outfits that have potential to win \"Best Dressed.\" This is one of the best weeks of high school, so start planning now and get pumped.\r\n\r\nHere's our take on how every grade should prepare for each day. Click on the designated grades to read our half-serious, half-joking take on the \"must have\" Spirit Week outfits.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/freshman-spirit-week-outfits\/\">Freshman<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/sophomore-spirit-week-outfits\/\">Sophomore<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/junior-spirit-week-outfits\/\">Junior<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/senior-spirit-week-outfits\/\">Senior<\/a>","excerpt":"Read a half-serious, half-joking take on the \"must have\" Spirit Week outfits for each grade this year.","date":"2014-10-23 14:15:41","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg","categories":["Opinion","Spotlight"],"tags":{"30849":"Best dressed","8596":"clothes","9795":"freshman","8816":"junior","30835":"outfits","8953":"paly","9085":"senior","29301":"sophomore","9119":"Spirit Week","30842":"suggestions"}},{"id":76895,"title":"Freshman Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/freshman-spirit-week-outfits\/","content":"<em>Freshmen, welcome to Paly Spirit Week, where we go all-out and dress like crazy. You are no longer in middle school, so you should never have the feeling that you are too dressed up or that people will stare – the more original and crazy, the better. Here are a few \"tips\" to prepare yourself for the upcoming week.<\/em>\r\n\r\n<dl id=\"attachment_76999\" class=\"wp-caption alignleft\"><dt class=\"wp-caption-dt\">[caption id=\"attachment_76999\" align=\"alignleft\" width=\"237\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5931.jpg\"><img class=\"wp-image-76999\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5931.jpg\" alt=\"IMG_5931\" width=\"237\" height=\"356\" \/><\/a> Staff writers Claire Krugler [left] and Adele Bloch [right] dress as babies for freshmen generation day on Spirit Week's Thursday. Photo by Molly Fogarty.[\/caption]<\/dt><\/dl><strong>[Monday] Theme day - \"The Lion King:\" <\/strong>As Katy Perry once said, “And you’re gonna hear me roar. Louder, louder than a lion.” Don’t be afraid to unleash your inner animal for this day. For a little inspiration, feel free to reenact the beginning scene of \"The Lion King\" by raising the smallest person you can find to the sun and yelling, “It’s the circle of life.” Although you may get weird looks from your friends, be sure to have confidence like the lion that you’ll be dressed as. If you are struggling with dressing up as a character from \"The Lion King,\" you can extend the theme to all Disney characters. However, it's recommended that freshmen dress up as Lion King-specific characters. You can wear all pink to represent a flamingo, or black and white to represent a zebra. If you’re freaking out about not knowing what to wear, just remember “Hakuna Matata.”\r\n\r\n<strong>[Tuesday] Dressing day <\/strong>-<strong> Healthy Choice: <\/strong>Healthy choice day is a day to dress up like the athlete you were never successful in becoming. Biking, running, lacrosse, golf or football – it's time to pick whichever sport you please. Try to stick with one sport throughout the whole outfit, because we really don’t want to see a biker’s helmet with a jersey and a swimsuit bottom. If you’re going for the runner’s look, please keep in mind that if you wouldn’t wear it on your run, don’t wear it. People don’t want to see your pasty thighs in the athletic shorts you'd never wear. And would you really exercise with your hair down? We think not. To complete the look, bring a water bottle of choice – even better, have it be orange, your class color.\r\n\r\n<strong>[Wednesday] Color day - Orange:<\/strong> Orange you glad you’re a freshman? Head on over to Target or Spirit and buy a variety of orange items: tights, shorts, shirts (or wear your class shirt if you bought one), tutus, boas, sunglasses and socks. You can even buy one of those 69-cent mini pumpkins from Trader Joe's to place on your orange spray-painted head. Just remember to go all-out and find everything you can that’s orange. Color day’s an easy day, no matter the color.\r\n\r\n<strong>[Thursday] Generation day - Babies: <\/strong>Cherish this day, because it is by far one of the comfiest days you will experience all year. If you’re feeling stumped on outfit choices, we recommend looking back on all your #tbt pics on Instagram for some inspiration. Our tips: wear a onesie. Don’t limit yourself to the typical, patternless onesies; look around and find unique, flashy or character-oriented onesies. To accompany your outfit, you can wear a saggy diaper with a bonnet. A binky, pacifier or bottle of milk is a nice addition to all baby days as well. Feel free to bring your favorite stuffed animal to school, and please don’t act like you don’t have any more stuffed animals, because we all secretly snuggle with one at night.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"The freshman's first Spirit Week calls for an in-depth look on what to wear for each day. Check it out here.","date":"2014-10-23 14:10:26","author":"Adele Bloch","categories":["Opinion"],"tags":{"30839":"babies","30837":"dressing day","9795":"freshman","30840":"generation day","30841":"green and white","30838":"healthy choice","8928":"Orange","30835":"outfits","8953":"paly","9119":"Spirit Week","30834":"Spirit Week outfits","30836":"The lion king"}},{"id":76897,"title":"Sophomore Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/sophomore-spirit-week-outfits\/","content":"<em>Another round of Spirit Week calls for another round of loving competition. Try to get the best outfits planned now.<\/em>\r\n\r\n<strong>[Monday] Theme day - Red Card: <\/strong>Feel free to take the literal approach for this day and dress up like an actual red card. Let UNO be your inspiration. If you are planning on wearing a jersey, don’t limit yourself to the most famous and typical soccer players such as Lionel Messi, Cristiano Ronaldo and Wayne Rooney. Contrary to popular belief, they really weren't the only players who participated in the World Cup. If you don’t have a jersey, don’t fret. Let’s be honest, jerseys are expensive and aren’t worth it if you’ll only wear them for one day.\r\n\r\n[caption id=\"attachment_77002\" align=\"alignleft\" width=\"206\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.08.45-PM.png\"><img class=\"wp-image-77002\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-1.08.45-PM.png\" alt=\"Screen Shot 2014-10-23 at 1.08.45 PM\" width=\"206\" height=\"340\" \/><\/a> Staff writers Claire Krugler [left] and junior Adele Bloch [right] dress as cowboys for sophomores second day of Spirit Week, ranch dressing day. Photo by Molly Fogarty.[\/caption]<strong>[Tuesday] Dressing day - Ranch Dressing:<\/strong> It’s country concert time! Slip on the boots, flannels, hats and jeans, and you are ready to go. Try to grow a beard within the next few days since most working cowboys don’t have time to shave on the ranch. Overalls are a great addition to any ranch outfit as well, and don't forget your bandana. Remember, if you're ever feeling down, just saddle up.\r\n\r\n<strong>[Wednesday] Color day - Red:<\/strong> This is a super easy color to dress up for. All you have to do is find any red items you can scavenge around the house. If that’s not enough, head on over to Target or Spirit. You can wear red shirts, tights, tutus, boas, sunglasses, socks and more. To top off the look, take your brightest red nail polish and lipstick and apply. Guys, too.\r\n\r\n<strong>[Thursday] Generation day - Teenyboppers: <\/strong>We personally didn’t know much about Teenyboppers last year, so here are a few definitions to help clear up the confusing term. “The term was introduced in the 1950s to refer to teenagers who mainly listened to pop music and\/or rock and roll and not much else,” according to <a href=\"http:\/\/en.wikipedia.org\/wiki\/Teenybopper\">Wikipedia<\/a>. Teenyboppers are also synonymous to Greasers, a youth subculture that originated in the '50s among teenagers. Take your inspiration from outfits in the popular movie “Grease” or by searching images for “Fashion for teenage boys\/girls in the 1950s.” For guys: it is time to apply lots and lots of gel. We recommend buying two bottles just in case you happen to run out. Make sure to reapply during break, lunch, passing periods and class itself - remember, you can never have too much gel. The gel will give you a sleek-haired look that’ll take you straight back to the '50s. For girls: Wear poodle skirts (a few that can be borrowed from Paly’s Theatre Department), red lip stick, “pink lady” jackets and your mother’s pearls that you’ve always been looking for an excuse to wear. Don’t forget your leather jacket with boots or Chuck Taylors, which can be bought for $10 at certain thrift stores.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"Another round of Spirit Week for sophomores calls for another round of loving competition; get your outfit inspirations here.\r\n","date":"2014-10-23 14:10:18","author":"Adele Bloch","categories":["Opinion"],"tags":{"30837":"dressing day","30847":"greasers","30835":"outfits","8953":"paly","30848":"paly spirit week","30845":"ranch dressing","9033":"Red","30844":"red card","29301":"sophomore","9114":"Sophomores","9119":"Spirit Week","30834":"Spirit Week outfits","30846":"teenyboppers","9695":"theme day"}},{"id":76924,"title":"Junior Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/junior-spirit-week-outfits\/","content":"<em>\"I believe that, I believe that we, I believe that we will, I believe that we will win!\"<\/em>\r\n\r\n<strong>[Monday] Theme day - Pirates: <\/strong>We hope you practiced on “<a href=\"http:\/\/www.playcrossbones.com\/Pirate_Talk.php#sthash.pf55N41y.dpbs\">International Talk Like a Pirate Day<\/a>\" on Sept. 19 because those skills will come in handy right about now. The pirate theme, at least for us, seems to be a relatively hard day to dress up for. If you put yourself in a situation where you've been at sea for many months and you potentially have scurvy, it's alright to assume that you won’t have the most glamorous outfit. Grab a large, flowy, white t-shirt and cut off the ends of the sleeves and the bottom of the shirt in a jagged manner. Paint blue stripes across the front and back of the shirt. For accessories, you can wear a bandana around your neck, a pirate belt, eye patch, one large hoop earring and a plastic sword. Don’t forget to say “Ahoy, matey” to everyone you pass by on your way to class.\r\n\r\n[caption id=\"attachment_77006\" align=\"alignleft\" width=\"254\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5912.jpg\"><img class=\"wp-image-77006\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5912.jpg\" alt=\"IMG_5912\" width=\"254\" height=\"381\" \/><\/a> Staff writer Claire Krugler poses in a chicken suit for the junior's yellow color day that falls on the third day of Spirit Week. Photo by Adele Bloch.[\/caption]\r\n\r\n<strong>[Tuesday] Dressing day - Thousand Island: <\/strong>Although many of you would like to wear your average swimsuit, try to spice it up with a coconut bra, which is most definitely not restricted to girls. If you want to think outside the box, dress up as a scuba diver with flippers; but make sure that you take the walking backwards approach or we might see a few scratched up faces at the rally. Boys, start working on those abs ASAP (we recommend the local gym). Have no fear of the bright tropical colors and floral patterns that you'll be wearing on this day. For all juniors, grab your dad’s oversized Hawaiian shirt, shorts, hula skirts, coconut bras, leis and flip-flops, and you’re good to go.\r\n\r\n<strong>[Wednesday] Color day - Yellow: <\/strong>If you’re going for the <i>“<\/i>wear whatever I can find that is yellow\" look, we recommend patrolling through your house, finding all yellow items and placing them on your body with yellow tape. See that banana? Ring, ring, bringing the banana phone back. See that highlighter? That's your writing utensil for the day. On the other hand, there are also character-specific outfits such as banana costumes, minion suits and Spongebob outfits. If you combine the “wear whatever I can find that is yellow\" look with the costume specific outfit, you may find yourself in the running for Best Dressed.\r\n\r\n<strong>[Thursday] Generation day - Sophisticates:<\/strong> Dress for success. Ladies and gentleman, this is the day to impress all your fellow peers by looking like a successful and accomplished lady and gentleman that you will soon become. Pick your favorite role model and be them for the day. Ladies tend to either wear dresses, skirts with fancy blouses or pant suits. Each of these items can be paired with flats or heels, but keep in mind that you may want some practice with running in heels if you plan to get a good spot on the bleachers during the rallies. Gentlemen can bring on the tux and ties, with a briefcase in hand. Don’t forget your cup of coffee in the morning and your handy pocket book dictionary and thesaurus, which we hope you read the night before so that you’ll look astute for Sophisticates day.\r\n\r\n<strong>[Friday] Paly - Green and White: <\/strong>Wear absolutely all the Paly gear that you can find stashed somewhere in your closet. If you can’t seem to find much, look for any green and white clothing located around the house, which we'll imagine shouldn't be too hard as this is your third Spirit Week. We want to see green and white hair with green and white faces on the last day of the best week. Enjoy Spirit Week, no matter the outcome, and may the odds be ever in your favor.","excerpt":"The upcoming third week of Spirit Week calls for another round of outfit planning; get your inspiration here.","date":"2014-10-23 14:10:12","author":"Adele Bloch","categories":["Opinion"],"tags":{"8596":"clothes","9717":"color day","30837":"dressing day","30840":"generation day","8816":"junior","30850":"outfit","8953":"paly","30851":"pirates","30853":"sophisticates","9119":"Spirit Week","30834":"Spirit Week outfits","9695":"theme day","30852":"thousand island","9244":"Yellow"}},{"id":76937,"title":"Senior Spirit Week outfits","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/senior-spirit-week-outfits\/","content":"<em>With your last Spirit Week coming up, you've probably already thought about your various outfits. But for a little bit more inspiration, see below. It's your last year – give it your all.<\/em>\r\n\r\n[caption id=\"attachment_77011\" align=\"alignnone\" width=\"480\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg\"><img class=\"wp-image-77011\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5983.jpg\" alt=\"IMG_5983\" width=\"480\" height=\"320\" \/><\/a> Staff writers Adele Bloch and Claire Krugler pose for the senior's green color day, which falls on the third day of Spirit Week. Photo by Molly Fogarty.[\/caption]\r\n\r\n<b>[Monday] Theme day - '90s: <\/b>Most seniors tend to take one of two popular routes: either rollerblading around the Quad or carrying a boombox around school. Why not try both? Seniors, it is time to start paying for those rollerblading lessons ASAP. Although we would enjoy seeing a few of you face-plant on the Quad, we will also pity you, so here are our words of advice. And since boomboxes typically weigh around 30 pounds, it’s time to hit the gym. We expect to be seeing at least half of the seniors at our next YMCA visit. Better start on your lifelong dream to become a rollerblader with the most fly tunes.\r\n<p style=\"text-align: left;\"><strong>[Tuesday] Dressing day - Caesar: <\/strong>For toga tips, see <a href=\"http:\/\/www.wikihow.com\/Make-a-Toga-out-of-a-Bedsheet\">here<\/a>. Use extra safety pins for your toga because we really don’t want to see any slips. Ride in eating grapes on your chariot with a little bit of “wine,” aka grape juice. Fight in the colosseum wearing your gladiator sandals, and take a break by playing a soothing harp song.<\/p>\r\n\r\n\r\n[caption id=\"attachment_77015\" align=\"alignnone\" width=\"204\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5990.jpg\"><img class=\"wp-image-77015\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5990.jpg\" alt=\"IMG_5990\" width=\"204\" height=\"306\" \/><\/a> Staff writers Adele Bloch and Claire Krugler pose for senior's green color day and camp day, which respectively fall on the third and last day of Spirit Week. Photo by Molly Fogarty.[\/caption]\r\n<p style=\"text-align: left;\"><b>[Wednesday] Color day - Green:<\/b> Go all out and get your green from Target, Goodwill or Spirit. You've done this before so we expect only the best.<\/p>\r\n<p style=\"text-align: left;\"><b>[Thursday] Generation day - Senior Citizens: <\/b>You’re officially over 70 and you're old enough to get the Happy Meal for less than $5. Congratulations! Grab your cane, wheelchair or scooter and take your time getting to class. Being an old senior citizen is a wonderful excuse to be late. We want to see every senior have at least five pillows attached to their stomach and rear end, and when seniors smile, there better be excess lipstick on their teeth. We don’t want to see any brunettes, blondes or redheads on this day - there'd better be gray hair everywhere. You're most officially the oldest in the school, so don’t forget to yell at those “dirty rotten kids” to “get off my lawn.”<\/p>\r\n<p style=\"text-align: left;\"><strong>[Friday] Camo: <\/strong>You know what to do. Last day, make it count.<\/p>","excerpt":"The upcoming last week of Spirit Week calls for another round of outfit planning; get your inspiration here.","date":"2014-10-23 14:03:51","author":"Adele Bloch","categories":["Opinion"],"tags":{"30854":"90s","30855":"caesar","9796":"camo","9717":"color day","30837":"dressing day","30840":"generation day","8745":"Green","30835":"outfits","8953":"paly","30856":"senior citizens","9090":"seniors","9119":"Spirit Week","30834":"Spirit Week outfits","9695":"theme day"}},{"id":76515,"title":"Teachers satisfied with Social Justice Pathway","permalink":"http:\/\/palyvoice.com\/2014\/10\/23\/teachers-satisfied-with-social-justice-pathway\/","content":"With only two months into the implementation of the Social Justice Pathway, Palo Alto High School teachers are satisfied with the progress and direction of the program, according to a presentation on Oct. 15 in the Media Arts Center.\r\n\r\n[caption id=\"attachment_77008\" align=\"alignright\" width=\"320\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/social-justice1.jpg\"><img class=\"size-full wp-image-77008\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/social-justice1.jpg\" alt=\"Social Justice Pathway teachers Erin Angell and Eric Bloom explain the specifics of the new pathway. Photo by Jeanette Wong.\" width=\"320\" height=\"240\" \/><\/a> Social Justice Pathway teachers Erin Angell and Eric Bloom explain the specifics of the new pathway. Photo by Jeanette Wong.[\/caption]\r\n\r\nHosted by the Parent Teacher Student Association, the event included a powerpoint presentation by Social Justice Pathway teachers Eric Bloom and Erin Angell, as well as a question and answer session following the presentation.\r\n\r\nThe Social Justice Pathway, a three-year program that integrates subject curriculum with community action, made its debut at the beginning of the 2014-15 school year at Paly. It is one of <a href=\"http:\/\/palyvoice.com\/2014\/02\/04\/school-board-to-vote-on-new-courses-at-next-meeting\/\">several additions<\/a> to the course catalog this year.\r\n\r\nBloom and Angell expressed the success of the pathway by sharing a story of experiential learning. Angell recalls a student’s request to walk out of class in the middle of a lesson about power and the concept of having power over someone.\r\n\r\n“I thought that it was probably the best way that I’ve ever taught,” Angell said. “It was the first time in Palo Alto where students dared to try something like that. It was invigorating, I thought it was great — it felt very real, [it was] great for me as a teacher, [and it was] very exciting.\r\n\r\nUnique features of the pathway include internship opportunities, field trips, experiential learning activities and a Capstone Project, in which students “generate a sustainable plan, execute and reflect on measurable goals,” according to Angell.\r\n\r\nOne of the goals of the program is to highlight the value students see in their community. Instead of taking advantage of volunteer opportunities for the sake of getting the President’s Service Award, the teachers encourage students to add value to the organization.\r\n\r\n“Erin [Angell] and I had a strong sense that we see a difference between the concept of service versus volunteering,” Bloom said. “What we want to acknowledge is that service, from our perspective, is you’re adding value to an organization. We’re trying to get kids to understand that they have value, that they can make value in the community.”\r\n\r\nIn addition, the grading method of the new pathway differs from traditional types.\r\n\r\n“Performance tasks are graded by completion but are evaluated on a scale from emergent, not really meeting the goals of this task, to mastery, that says you really have,” Bloom said. “There’s a third category in our grade book, which is reflection. They [students] reflect on what it was that they did, where their successes were, what they can improve on.”\r\n\r\nThe Social Justice Pathway approach emphasizes the views of the students.\r\n\r\n“What is it that you agree with, what is it that you value, what is it that you offer others — that’s part of the mindset of this [pathway],” Bloom said.","excerpt":"With only two months into the implementation of the Social Justice Pathway, Palo Alto High School teachers are satisfied with the progress and direction of the program, according to a presentation on Oct. 15 in the Media Arts Center.","date":"2014-10-23 13:41:34","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo7.jpg","categories":["News","Spotlight"],"tags":[]},{"id":76764,"title":"Unity Day to raise bullying awareness","permalink":"http:\/\/palyvoice.com\/2014\/10\/22\/unity-day-to-raise-bullying-awareness\/","content":"In honor of Unity Week, Palo Alto Unified School District schools are participating in Unity Day, a national event started eight years ago by the Pacer National Bullying Prevention, according to a PAUSD  <a href=\"http:\/\/news.pausd.org\/post.cfm\/unity-day-2014-when-we-stand-together-no-one-stands-alone\">press release<\/a>.\r\n\r\n“The City of Palo Alto and its partners pledge to raise awareness around this issue by hosting events that bring together key decision makers and community members who work to change the culture in our schools and communities so that tolerance, kindness and safety are top priorities,” Palo Alto mayor Nancy Shepherd stated in the press release.\r\n\r\nThe goals of the week are to provide awareness of bullying and to try to unify the community against bullying of all forms. One out of every three students is bullied, according to <a href=\"http:\/\/www.pacer.org\/bullying\/nbpm\/\">The National Bullying Prevention Center<\/a>, and Paly wants to commit students to end bullying by signing the petition and wearing orange.\r\n\r\nClubs, including Unity Club, QSA and Latinos Unidos are participating in Unity Day. There will be events held on the quad throughout lunch to promote unification of the student body through different activities according to Claire Liu.\r\n\r\n“Unity Day is a nationwide campaign to end bullying, and it is happening here at Paly on Thursday,\" Associated Student Body Vice President Reid Walters said. \"We are going to have a petition that people can sign on the Quad, and we are also going to be handing out ribbons.  It would be awesome if everyone could wear orange on Thursday to show their support for the cause.\"","excerpt":"Paly students will be wearing orange Thursday to show their support for bully prevention. Students will be asked to sign the petition and receive ribbons to pledge to end bullying. ","date":"2014-10-22 20:04:13","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10743040_965663266783804_1386580735_o.jpg","categories":["News"],"tags":{"30531":"bully","30532":"bully prevention","30529":"mayor","12344":"nancy shepherd","8928":"Orange","14292":"reid walters","9197":"unity day","30530":"unity week"}},{"id":76882,"title":"Homecoming asking video competition ends Oct. 29","permalink":"http:\/\/palyvoice.com\/2014\/10\/21\/homecoming-asking-video-competition-ends-oct-29\/","content":"","excerpt":"","date":"2014-10-21 22:40:49","author":"Lizzie Chun","categories":["Ticker"],"tags":{"29483":"Asking competition","9781":"homecoming","30832":"videos"}},{"id":76859,"title":"Opinion: Teachers, we&#8217;ve got spirit, how &#8217;bout you?","permalink":"http:\/\/palyvoice.com\/2014\/10\/21\/opinion-teachers-weve-got-spirit-how-bout-you\/","content":"[caption id=\"attachment_76861\" align=\"aligncenter\" width=\"642\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg\"><img class=\" wp-image-76861\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg\" alt=\"Decked out in her superhero attire from last year's Spirit Week, a Palo Alto High School junior expresses the workload she wishes she will not have during the week-long event. Photo by Jeanette Wong.\" width=\"642\" height=\"430\" \/><\/a> Decked out in her superhero attire from last year's Spirit Week, a Palo Alto High School junior expresses the workload she wishes she will not have during the week-long event. Photo by Jeanette Wong.[\/caption]\r\n\r\nTo-do list: Write an English essay. Hunt down Spirit Week outfit. Memorize Spanish vocabulary. Help with float building. Study for Monday morning math test. Sound familiar?\r\n\r\nThe combination of Spirit Week with the already present academic workload can make for an overwhelming experience.\r\n\r\nWhile I recognize the immense time and effort teachers put into creating lesson plans for us, I believe students should have a test-free, stress-free Spirit Week.\r\n\r\nSpirit Week is the one week that the entire student body (or the majority, at least) is involved in a single activity, and many can agree this event generates a sense of pride for both one’s respective class and Palo Alto High School itself. By drawing out the competitiveness in all of us, Spirit Week gets us involved and encourages us to work together towards the common goal of securing bragging rights for being Spirit Week champions. It’s a week for students to have fun and enjoy the high school experience.\r\n\r\nTests, projects, presentations and other major assignments can detach people from the full Spirit Week experience. Instead of being on the bleachers cheering for their class, some students may find themselves stressing over a test or scrambling to put the finishing touches on a project.\r\n\r\nOf course, wishing for a full week of school without any homework at all would be absurd. But in the spirit of Spirit Week, teachers should reserve the three class periods during that week for relatively less rigorous activities. By doing so, teachers will relieve students of the additional stress associated with tests and huge assignments.\r\n\r\nAs Pink Floyd sings, “Teachers, leave them kids alone” (at least during Spirit Week). Allow us to release our energy and scream our hearts out at the pep rallies without the thought of tests nagging at the back of our minds. With only four years at Paly, we should be able to optimize our time here by living it up during Spirit Week.\r\n\r\nSo I respectfully say, teachers, please show your Paly spirit by giving us space during Spirit Week.","excerpt":"Spirit Week generates a sense of pride for both one’s respective class and Palo Alto High School itself. Teachers should \"leave them kids alone,\" as Pink Floyd sings, and allow students to fully enjoy the event without worrying about tests and other major assignments.","date":"2014-10-21 18:56:27","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_3872-lq.jpg","categories":["Opinion","Spotlight"],"tags":{"9119":"Spirit Week","9128":"Stress"}},{"id":76841,"title":"Injuries derail cross country teams&#8217; promising season","permalink":"http:\/\/palyvoice.com\/2014\/10\/21\/injuries-derail-cross-country-teams-promising-season\/","content":"Although injuries to key contributors have limited the performance of the Palo Alto high school’s boys’ and girls’ cross country teams, coaches say both are nearing full recovery and look to compete at full strength for next week’s match versus rival school Gunn.\r\n\r\nBoys’ cross country coach Kelsey Feeley says the team will be back to health soon.\r\n\r\n“Two of our returners from the top seven varsity squad have been out all season,” Feeley said. “One [Junior Samuel Desré] ran on Friday and did really well . He was given [physical] parameters [by his doctor], but still ran a great race, and our other one, [sophomore] Kent Slaney will be hopefully able to run next week.”\r\n\r\nAlthough the injuries have prevented the team from placing higher in meets, Feeley said she sees many improvements this season.\r\n“We’ve had some young and older kids step up across the board,” Feeley said. “Theres been a ton of improvement since the beginning of the season, and I am excited to see how the second half goes.”\r\n\r\nThe girls’ cross country team is also recovering currently, and reaping the positive effects of having healthy runners. Senior girls’ cross country runner Kylie Wilson thinks injuries have played a huge role in the both teams’ performance this season.\r\n\r\n“Because so many of the varsity runners are injured both boys’ and girls’ teams are not doing as well as we could be doing,” Wilson said. “But for so many people injured, we’re doing ok.”\r\n\r\n“We have everybody back and relative healthy,” girls’ cross country coach Paul Jones said. “We finished 6th out of 42 teams at our last meet at Toro Park.”\r\n\r\nJones has a positive outlook on the season, with high expectations for the Santa Clara Athletic Valley League and the Central Coast Selection.\r\n\r\n“We’ll finish in the top four or definitely should, which means we qualify for CCS as a team … We’ll probably have up to three all leaguers [at SCAVLS].”\r\n\r\nBoys’ and girls’ cross country will compete at 3 p.m. today at the Sunnyvale Baylands.","excerpt":"Although injuries to key contributors have limited the performance of the Palo Alto high school’s boys’ and girls’ cross country teams, coaches say both are <a href=\"http:\/\/palyvoice.com\/2014\/10\/21\/injuries-derail-cross-country-teams-promising-season\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-21 14:47:26","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photos.jpg","categories":["Sports"],"tags":[]}]