[{"id":73711,"title":"District hires new Chief Technology Officer","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/district-hires-new-chief-technology-officer\/","content":"A former school district technology expert will start work as chief technology officer for the Palo Alto Unified School District later this week.\r\n\r\nDerek Moore from San Jose Unified School District is replacing Ann Dunkin, who now works for the Environmental Protection Agency.\r\n\r\nAccording to Moore, one of the main attractions to working at PAUSD is that the district is often at the forefront of technology and has seemingly unlimited resources. “Palo Alto schools are always ahead of the game [in technology],” he said.\r\n\r\nAccording to Superintendent Max McGee, with the addition of new buildings throughout PAUSD, there are many ways to technologically improve the district's learning environment.\r\n\r\n“Mr. Moore joins our district at a critical time where technology touches nearly all aspects of the teaching and learning experience,” McGee said in a <a href=\"http:\/\/news.pausd.org\/post.cfm\/district-announces-new-chief-technology-officer\" target=\"_blank\">press release<\/a>.\r\n\r\nFor Paly students, Moore's success will be judged on his effectiveness in resolving ongoing problems like access to Wi-Fi. Many Paly students have difficulty with Wi-Fi, especially with the new buildings. “We tried to do an online assignment in [Advanced Placement] Psych on our phones, but none of them would connect to the Wi-Fi,” senior Cameron Aishin said.\r\n\r\n“Wi-Fi has got to be available,” Moore said. “There will always be some small things you’ll have to adjust.”","excerpt":"Ex-San Jose Unified School District Director of Technology Services Derek Moore will start work as Chief Technology Officer for the Palo Alto Unified School District.","date":"2014-09-16 14:36:09","author":"Alex Merkle","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/unnamed.jpg","categories":["News"],"tags":{"28583":"chief technology officer","28582":"derek moore","25038":"McGee","8912":"new","8977":"PAUSD"}},{"id":73696,"title":"Water polo girls focus on team unity","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/water-polo-girls-focus-on-team-unity\/","content":"The Palo Alto High School girls' water polo team hopes to improve from last year after failing to qualify for Central Coast Sectionals last year.\r\n\r\nThe Vikings only graduated two seniors last year, so they are hoping that they will be stronger over all. Seniors Olivia Scola, Tess Van Hulsen and Maddie Kinnaman will lead the team this year.\r\n\r\nThe girls will need to improve in some aspects of the game to have a more successful season than last year.\r\n\r\n“The big thing [to improve on] will be team unity, team play and making sure we continue to build on the team concept,” head coach Aileen Delaney said. “They need to build their confidence in their shooting and defense as those are two key things, especially the defense.”\r\n\r\nAccording to junior Katie Francis, even if Delaney is focusing on team unity she “is very dedicated to [helping] each individual improve in any way she can.”\r\n\r\nThe Vikings want to be successful this season. However, the success of the season will not only be based on their win and loss record.\r\n\r\n“Our hopes are to have a successful season,” Aileen said. “A season is not defined just by wins but by the unity we show as a team throughout the year though we do have the goal of reaching CCS.”\r\n\r\nThe team will face Homestead High School at 6:45 p.m. Sept. 16 at Homestead. For their first home game, the Vikings will play Los Gatos at 3:30 p.m. Sept. 18.","excerpt":"The Palo Alto High School girls' water polo team hopes to improve from last year after failing to qualify for Central Coast Sectionals last year.","date":"2014-09-16 14:16:22","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/pool.jpg","categories":["Sports"],"tags":[]},{"id":73716,"title":"Junior goes undefeated in debate tournament","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/junior-goes-undefeated-in-debate-tournament\/","content":"<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136\">\r\n<div class=\"_5wd9\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0.0\">\r\n<div data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0.0.0\">\r\n\r\n[caption id=\"attachment_73722\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n.jpg\"><img class=\"wp-image-73722\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n.jpg\" alt=\"Palo Alto High School junior Anna Lu (center) won the Saint Francis High School debate tournament this weekend. Lu and the second and third speakers received medical kits for trophies as a play on their debate topic of organ procurement. “What was really interesting about the tournament was that they didn't give us trophies for speaker awards, but gave us medical kits instead since the topic was about organ procurement,” Lu said. Photo courtesy of Anna Lu.\" width=\"300\" height=\"300\" \/><\/a> Palo Alto High School junior Anna Lu (center) won the Saint Francis High School debate tournament this weekend. Lu and the second and third speakers received medical kits for trophies as a play on their debate topic of organ procurement. “What was really interesting about the tournament was that they didn't give us trophies for speaker awards, but gave us medical kits instead since the topic was about organ procurement,” Lu said. Photo by Sakthi Swamy.[\/caption]\r\n\r\nA Palo Alto High School junior is celebrating the start of the debate season after going undefeated at the Saint Francis High School debate tournament this weekend, going 6-0 through the preliminary rounds and 3-0 in the final round.\r\n\r\nJunior Anna Lu came in first overall, and juniors Anna Nakai and Gabi Rossner made it to the quarterfinals.\r\n\r\nAccording to Lu, Paly has a history of success at the St. Francis tournament. Senior Noah Hashmi made it to the final rounds last year and current debate coach Alex Carter of the Class of 2012 won it his junior year.\r\n\r\n“I definitely could not have won without the help of our coach Matt DeLateur,” Lu said.  “He helped me a lot in adapting to parent judges and making my arguments sound more persuasive, so I'm really grateful to be able to work with him as well as all of the other phenomenal coaches on our team.”\r\n\r\nThe topic of the debate was organ procurement from the deceased.\r\n\r\n“We debated about whether or not the government and society should assume that individuals want to donate their organs after they die,” Lu said.\r\n\r\nLu was sick for most of the tournament and had to sleep in between rounds. Despite this, she was the only competitor to go undefeated.\r\n\r\n“When I saw that my name was first on the list and that I was the only undefeated debater, I honestly could not believe that it was true,” Lu said. “That was by far my favorite moment during the tournament.”\r\n\r\nThis was the first major tournament of the debate season and Lu’s second major victory, having gone undefeated at the Catholic Forensics League 3 tournament last year.\r\n\r\n\"I think my biggest takeaway from this tournament is an increased confidence in my debating ability,\" Lu said. \"I was definitely an underdog sophomore year, as most sophomores are, so now I feel like I have to ability to compete against the best of the best.\"\r\n\r\n&nbsp;\r\n<div class=\"_3ry4\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:1\">\r\n\r\n\r\n\r\n\r\n","excerpt":"A Palo Alto High School junior went undefeated at the Saint Francis High School debate tournament this weekend, going 6-0 through the preliminary rounds and 3-0 in the final round.\r\n","date":"2014-09-16 14:05:03","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n-22.jpg","categories":["News","Spotlight"],"tags":{"28579":"alex carter","28577":"anna lu","28580":"anna nakai","8638":"debate","28581":"gabi rossner","10542":"paly debate","28578":"st francis debate tournament"}},{"id":73610,"title":"Call-in show with Supt. to air next month","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/call-in-show-with-supt-to-air-next-month\/","content":"The Palo Alto Unified School District will host a live call-in TV broadcast featuring Supt. Max McGee at 6:30 p.m. on Oct. 8. The show will be available on <span style=\"color: #000000;\">AT&amp;T Channel 99, Comcast Channel 28 and<\/span> Mid Peninsula Media Center's Watch Now page.\r\n\r\nThe district hopes to improve communication and transparency with the community through the show \"A Conversation with PAUSD Superintendent Dr. Max McGee,\" according to PAUSD Communications Coordinator Tabitha Kappeler-Hurley.\r\n\r\n\"It's all a part of a goal to communicate more with the community about all the great things that's happening in schools, and obviously making ourselves available,\" Kappeler-Hurley said. \"Hearing from the parents and community directly through a live call-in show allows people to ask their own questions or voice any concerns.\"\r\n\r\nMcGee hopes the broadcast will encourage the community to ask hard-hitting questions.\r\n\r\n\"[The purpose of the broadcast is] to really be able to answer what's on people's minds,\" McGee said. \"I think a lot of times, people keep tough questions to themselves, or they make assumptions. Well, here's a chance to check out your assumptions about the district.\"\r\n\r\nThe show is open to any type of question regarding the district from anyone in the community, according to Kappeler-Hurley.\r\n\r\n\"Anyone can call in and ask any questions that is on their mind,\" Kappeler-Hurley said. \"It could be around curriculum, funding, bonds or anything of that nature. If they have a question for Dr. McGee that is something of broad interest, I would encourage someone to call in and ask.\"\r\n\r\nQuestions can be submitted via <a href=\"mailto:thurley@pausd.org\">email to Kappeler-Hurley<\/a> until Oct. 1. Call-in questions will be accepted during the show, however the phone number is yet to be released.\r\n\r\nAs this is the first call-in broadcast, Kappeler-Hurley is curious to see the turnout, which she will take into account for future methods of communication.\r\n\r\n\"I'm going to kind of test this the first time and see how the community reacts to this or enjoys this format,\" Kappeler-Hurley said. \"I'm hoping we can do two or three [live call-in shows] this year. But Dr. McGee is also open to doing things in a variety of ways, maybe community forums, tv shows or using video.\"\r\n\r\nMcGee looks forward to answering any questions or concerns as the star of the show.\r\n\r\n\"I am hoping to get to answer some really tough questions,\" McGee said. \"But overall, I am looking forward to some lively interaction.\"","excerpt":"The Palo Alto Unified School District will host a live call-in TV show featuring Supt. Max McGee at 6:30 p.m. on Oct. 8. ","date":"2014-09-16 13:38:22","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-15-at-2.36.11-PM.png","categories":["News"],"tags":{"27729":"ask","27724":"broadcast","27722":"call in","27728":"communication","8611":"Community","27721":"lifestream","27175":"live","25038":"McGee","27726":"mid pen","27725":"mid peninsula media center","8977":"PAUSD","27727":"questions","11606":"superintendent","27723":"tv"}},{"id":73705,"title":"Paly junior wins St. Francis Debate Tournament","permalink":"http:\/\/palyvoice.com\/2014\/09\/14\/paly-junior-wins-st-francis-debate-tournament\/","content":"","excerpt":"","date":"2014-09-14 22:45:01","author":"Emma Chiu","categories":["Ticker"],"tags":[]},{"id":73587,"title":"Opinion: Bike cage difficulties adding up","permalink":"http:\/\/palyvoice.com\/2014\/09\/13\/opinion-bike-cage-difficulties-adding-up\/","content":"[caption id=\"attachment_73670\" align=\"aligncenter\" width=\"675\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0025.jpg\"><img class=\" wp-image-73670\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0025.jpg\" alt=\"Senior Ashray Narayan attempts to lift his bike out of the over crowded bike cage. Photo by Saba Moussavian.\" width=\"675\" height=\"450\" \/><\/a> Senior Ashray Narayan attempts to lift his bike out of the over crowded bike cage. Photo by Saba Moussavian.[\/caption]\r\n\r\nConstruction near the Haymarket Theater has forced students at Palo Alto High School to make changes to their routines, some of which involve their morning afternoon commute to and from school. Biking, a popular choice of transportation for many Paly students, has become a challenge this year due to the absence of efficient bike cages. One cage, in particular, has caused distress among many Paly students for a variety of reasons.\r\n\r\nThe bike cage in question is adjacent to Embarcadero Road, across from Town and Country. Along with the Media Arts Center, the cage is new to the Paly campus this year, but unlike the new buildings, it has not made a good first impression on students. The cage has three parallel racks all enclosed in a very small fenced area. The proximity of the racks makes it impossible for people to maneuver in between the rows. More often than not, people are forced to carry their bikes up and over other bikes while attempting to move through the sea of hastily locked bikes. Students that are running late often find no space to park their bikes, with the front (and only) entrance to the cage swarmed by an overabundance of bikes.\r\n\r\nForcing students to physically lift their bikes up and over other bikes (and people) also puts them at risk of injury to themselves and damage to surrounding bikes. Last year, the Paly campus <a href=\"http:\/\/palyvoice.com\/2013\/10\/08\/opinion-we-want-bike-rack-city\/\" target=\"_blank\">had difficulties with a lack of bike space as well<\/a>. Recent construction seems to have aggravated the problem.\r\n\r\nTo try and solve this dilemma, administration should consider removing one of the bike racks or opening the back of the cage. This, however, only solves part of the problem. Traffic flow through both entrances will still be impossibly tight. Numerous students have complained about the bike cage and the complications that have arisen.\r\n\r\n“The bikes are way too close together and people park so that [others] can’t actually get to the other bike racks,” junior Emma Raney said. \"They just block you from locking your bike and I usually have to lock my bike to the outside of the cage.”\r\n\r\nSome students have succumbed to simply parking their bikes outside of the cage. With construction blocking the front entrance to the school, bikers along Embarcadero have been rerouted to the bike path parallel to the train tracks, where they then turn and bike near the General Education building. Once they reach the bike cage, they are faced with the decision of whether or not to try and push their bike through the crowded entrance or simply lock their bike on the side.\r\n\r\nSophomore Gregory Jerian agreed with Raney, citing the entrance of the bike cage as his biggest concern.\r\n\r\n“People can’t get their bikes in,” Jerian said. “[They] have to lift their bike over all the other bikes.”\r\n\r\nWe feel that there are a sundry of ways to solve the problem. If one of the racks were to be removed or if faculty unlocked the back gate, parking bikes would no longer be the challenging task it is now. Additionally, if the bike cage was expanded to the point where the proximity of the bike racks was big enough for bikes to squeeze by, it would make the process much less time consuming. An elementary part of bike cages is the physical spaces. If there is not enough room in a bike cage for the bikes to squeeze past each other, it is not fulfilling its basic job.\r\n\r\nBiking is the most efficient and environmentally friendly form of transportation for most Paly students. The fact that students are discouraged from biking because of the unkempt bike cage is a travesty. With a couple fixes, students and bikers in particular would feel less vexed about their bikes.","excerpt":"Biking, a popular choice of transportation for many Paly students, has become a challenge this year due to the absence of efficient bike cages. The Paly Voice examines the issue and offers potential solutions to the problem.","date":"2014-09-13 18:01:14","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0025.jpg","categories":["Opinion","Spotlight"],"tags":{"27772":"bike cage","9668":"biking","27773":"commute","11242":"emma raney","27771":"gregory jerian","18366":"mac","11127":"media arts center"}},{"id":73490,"title":"Guil-tea pleasure: David&#8217;s Tea","permalink":"http:\/\/palyvoice.com\/2014\/09\/11\/guil-tea-pleasure-davids-tea\/","content":"<p><em>David's Tea, an organic tea chain, recently opened its newest location in downtown Palo Alto. <\/em><\/p>\r\n<p>[caption id=\"attachment_73620\" align=\"alignright\" width=\"374\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_64131.jpg\"><img class=\"wp-image-73620\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_64131.jpg\" alt=\"David’s Tea, an organic tea chain company, recently opened in their new location in downtown Palo Alto. Photo by Adele Bloch.\" width=\"374\" height=\"281\" \/><\/a> David’s Tea, an organic tea chain company, recently opened in their new location in downtown Palo Alto. Photo by Adele Bloch.[\/caption]<\/p>\r\n<p>Pom springs, chocolate orange, big apple, brazillionaire <span style=\"color: #545454;\">—<\/span> these are just a few of the 150 blends offered at David’s Tea, an organic tea chain, that recently opened its newest location on 318 University Ave in downtown Palo Alto.<\/p>\r\n<p>According to the Palo Alto branch's general manager Emily Hamel, David’s Tea had a soft opening on Aug. 23 during the Palo Alto Festival of the Arts, where employees handed out over 7,000 sample cups, followed by a grand opening on Aug. 30.<\/p>\r\n<p>Upon entry of the bright teal colored shop, customers are typically handed a daily sample and are greeted with friendly faces that take great care to ensure the quality of the customer's tea. The friendly ambiance is accentuated by the warm coloring of the whole store and the employees' kindness.<\/p>\r\n<p>[caption id=\"attachment_73662\" align=\"alignnone\" width=\"773\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_63971.jpg\"><img class=\"wp-image-73662\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_63971.jpg\" alt=\"IMG_6397\" width=\"773\" height=\"338\" \/><\/a> The store front view of David's Tea reveals a brightly colored store filled with many kinds of tea products, including both merchandise and tea. All employees are spirited, allowing customers to smell and touch any available teas. David's Tea had its grand opening on Aug. 30. \"It's been the warmest welcome we could have asked for,\" Hamel said. Photo by Adele Bloch.[\/caption]<\/p>\r\n<p>“[Our goal is] to make tea fun and accessible to everyone,” Hamel said.<\/p>\r\n<p>The store layout includes merchandise on the left, such as travel mugs, infusers and teapots. On the right is a sleek white table, which the employees work behind, as well as a fully stocked wall of tea jars arranged by type: white, green, oolong, black, pu’erh, mate, rooibos and herbal, each with a designated color on the wall.<\/p>\r\n<p>David’s Tea has the greatest number of organic teas in North America, with over 50 organic teas in stock, according to Hamel. Ninety-eight percent of its blends are unique to the store, including teas with added ingredients such as fruits, nuts, flowers and grasses. David’s Tea sells over one hundred types of loose-leaf teas as well as kosher teas and fair trade teas.<\/p>\r\n<p>David’s Tea also sells products such as filters, tea bags, and chocolate with infused tea.<\/p>\r\n<p>[caption id=\"attachment_73623\" align=\"alignnone\" width=\"714\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_6394.jpg\"><img class=\"wp-image-73623\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_6394.jpg\" alt=\"Photo by Adele Bloch.\" width=\"714\" height=\"536\" \/><\/a> David's Tea has an ever-expanding tea wall, because new tea blends come out every month. David's Tea currently has 150 teas that fall into eight different categories, each category labeled a separate color on the wall. Photo by Adele Bloch.[\/caption]<\/p>\r\n<p>Employees take jars off the wall to educate customers on the content and flavor of the tea. A sample of the designated tea, which customers can smell and touch, sits on top of each jar. Each tea is composed of different ingredients that give it a distinct aroma and touch, bringing varying smells with each sniff.<\/p>\r\n<p>David’s Tea began as an online company, and proceeded to open its first physical location in 2008 in Canada’s largest city, Toronto. By Christmas 2014, David’s Tea will have 125 stores; 100 in Canada and 25 in the United States, according to Hamel.<\/p>\r\n<p>“Palo Alto, being the center of Silicon Valley, really appealed to us, and it really seemed like the perfect location,” Hamel said.<\/p>\r\n<p>Every year, David’s Tea comes out with six different collections of tea: fall, winter, holiday, spring, and two phases in the summer, according to Hamel. Every first day of the month there is a new tea launch that becomes a part of the permanent collection, Hamel said.<\/p>\r\n<p>“Our tea wall is ever-expanding,” Hamel said.<\/p>\r\n<p>Not only does David's Tea have a large selection of teas, it also offers various ways to make each kind of tea. Each tea flavor can be made hot, iced, in a pot, latte or tea pop.<\/p>\r\n<p>Unique to David's Tea, a tea pop is made by taking the desired tea flavor and adding Soda Stream, carbonated filtered water, for sparkling effect. I chose to try the Big Apple tea pop ($4), which was a great substitute for soda, as it was fizzy but had much less sugar. When I took my first sip, I could sense an apple flavor that felt cool to my throat, with a subtle sweet aftertaste. But a fair warning: if the tea is not finished before the ice melts, the drink severely waters down the already light flavors.<\/p>\r\n<p>Buddha’s blend ($3.50), which Hamel said is one of the most popular teas, is composed of jasmine pearls, white hibiscus blossoms and natural and artificial flavoring, according to David’s Tea <a title=\"David's Tea\" href=\"http:\/\/www.davidstea.com\/?&amp;currid=usd&amp;LN=EN\" target=\"_blank\">website<\/a>. The tea had a slightly brown coloring and a smell that made me feel as though I was walking through a garden full of chrysanthemum flowers. The tea was flavorful, and held a light bitter aftertaste. The outside of the cup was nice and warm, making it a perfect drink for a winter day.<\/p>\r\n<p>The iced Pumpkin Chai Latte ($4.50), which its website said is composed of black tea, cinnamon, cloves, lemon peel, carrots, caramel bits and pumpkin candies, was mixed with milk and Agave, a natural sweetener. The light brown drink was slightly bitter and very rich. Although the flavor was great, the smell brought me back to the holiday season, and to be honest, the aroma was probably better than the drink itself.<\/p>\r\n<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223\">\r\n<div class=\"_5wd9\" data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\"><span class=\"_5yl5\" data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0.0\">David's Tea has relatively similar prices to Teavana, a competitor tea chain in the area, but because David's Tea sells its items in a different fashion, it's hard to make a final judgment call on which store offers better prices.<\/span><\/p>\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">\r\n<div data-reactid=\".11.$mid=11410404591756=2a67400a1e43d0bf223.2:0.0.0.0\">At David's Tea, each tea takes about one to five minutes to make, depending on the kind of tea. However, the time flies quickly because customers can watch the tea being made, sample tea aromas or browse through the merchandise. In the back of the store, there is a small room with four white tables, which provides a calming setting to have a sip of tea. The calming background music, which varies in genres, is great to keep conversations lively.<\/p>\r\n<p>[caption id=\"attachment_73624\" align=\"alignnone\" width=\"719\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_6391.jpg\"><img class=\"wp-image-73624\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_6391.jpg\" alt=\"IMG_6391\" width=\"719\" height=\"539\" \/><\/a> The back of the store holds an elongated white room that feels separate from the hectic front of the store, as it plays calm background music and is relatively quiet. Customers can slide right into the chairs as they take a sip of their tea. Photo by Adele Bloch.[\/caption]<\/p>\r\n<p>After each purchase, employees offer a rewards program to customers in which each dollar spent redeems one point. For every 100 points, customers can get two ounces of any tea on the house.<\/p>\r\n<p>“It’s a great way to get rewarded for buying the tea,” Hamel said.<\/p>\r\n<p>David’s Tea also provides an educational component to its company — tea school. Tea school covers the basics of tea production, how it’s processed and what makes tea different. There are around two to four tea schools per month, based off of demand, according to Hamel.<\/p>\r\n<p>“We’re really excited about the educational component as well for this location,” Hamel said. “We also do private sessions so if offices or schools want us to come to them, we do that as well.”<\/p>\r\n<p>David’s Tea is very excited to be in Palo Alto just weeks after opening, according to Hamel.<\/p>\r\n<p>“It’s been the most wonderful welcome,” Hamel said. “People are very excited, and very open. They are educated on tea already, which is so neat for us.”<\/p>\r\n","excerpt":"Pom springs, chocolate orange, big apple, brazillionaire — these are just a few of the 150 blends offered at David’s Tea, an organic tea chain, that recently opened its newest location on 318 University Ave in downtown Palo Alto.","date":"2014-09-11 19:17:37","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_64131.jpg","categories":["Editor's Pick","Reviews"],"tags":{"27731":"David's Tea","27733":"downtown Palo Alto","27730":"Emily Hamel","27732":"tea"}},{"id":73553,"title":"Special Club Day schedule with extended lunch on Sept. 15","permalink":"http:\/\/palyvoice.com\/2014\/09\/10\/special-club-day-schedule-with-extended-lunch-on-sept-15\/","content":"","excerpt":"","date":"2014-09-10 20:06:28","author":"Lizzie Chun","categories":["Uncategorized"],"tags":{"11711":"club day"}},{"id":73498,"title":"Interview with Dean of Students Adam Paulson","permalink":"http:\/\/palyvoice.com\/2014\/09\/10\/interview-with-dean-of-students-adam-paulson\/","content":"[caption id=\"attachment_73569\" align=\"alignnone\" width=\"596\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0022.jpg\"><img class=\" wp-image-73569\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0022.jpg\" alt=\"Dean of Students Adam Paulson talks with students during lunch.  Paulson was recently chosen by a committee of teachers and administrators as Paly's Dean of Students\/TOSA.  &quot;He is student-centered, experienced, has a great sense of humor and is an all-around great guy,&quot; Principal Kim Diorio says in her to staff.\" width=\"596\" height=\"397\" \/><\/a> Dean of Students Adam Paulson talks with students during lunch. Paulson resigned as principal of Arundel Elementary School in San Carlos to accept a position at Palo Alto High School. \"He is student-centered, experienced, has a great sense of humor and is an all-around great guy,\" Principal Kim Diorio wrote in an email to staff.  Photo by Saba Moussavian.[\/caption]\r\n\r\nThe Paly Voice sat down with new Dean of Students\/Teacher on Special Assignment Adam Paulson to learn how his time at Palo Alto High School is going so far. Paulson takes the place of Craig Tuana, who is now an assistant principal at Lynbrook High School.\r\n\r\nThe Paly Voice: Describe yourself in three words.\r\n\r\nAdam Paulson: I would say I am dedicated, passionate and funny. That’s what would describe me. I have a good sense of humor.\r\n\r\nTPV: What are your first impressions of Paly?\r\n\r\nAP: Well, you know, I think it seems like a really great place to go to high school. Students, the facilities and the grounds – they’re just tremendous. And from all the students and faculty I’ve already talked to, it just seems like a place that has a lot of pride and school spirit, so I’m excited about that.\r\n\r\nPV: What are you looking forward to this year at Paly?\r\n\r\nAP: I think mostly just trying to find that pulse. I’m very much into school culture and the way students are thinking and feeling, really just trying to talk with as many students and student organizations and athletic organizations as I can so that I can get a pulse for what Paly is about and what the school culture is all about, you know? And try and find ways where I can interject and collaborate with students and teachers.\r\n\r\nPV: If you were a crayon, what color would you be, and why?\r\n\r\nAP: Trying to think back to some of those funky Crayola colors. Maybe a magenta-something that doesn’t — that has a unique identity – is it blue? Is it green? I’m a musician myself, too, so I like to express myself, and magenta is I think one of those mysterious colors.\r\n\r\nPV: What instruments do you play?\r\n\r\nAP: Anything with strings, you know, guitar, bass.\r\n\r\nPV: Who’s your favorite artist?\r\n\r\nAP: Now that would have to be a whole other interview, right? <em>(laughs). <\/em>You know, I play anything from classical to heavy metal. Elvis Costello is one of my favorite musicians, just to name one.\r\n\r\nPV: As \"dean of students,\" what are students likely to see you doing around campus?\r\n\r\nAP: Obviously, as a school administrator, I am going to have the administrative part of that. I’m going to be doing, you know, leading or just being a part of aspects of managing of the school, but you guys don’t want to hear about that, right. On the student side of it, you know, you’re the dean, so you really want to interact with students, and it goes back to that, you know, finding the pulse at Paly and just getting to know what student – what does it mean to you guys, to be a student here, and how can I support and then help those efforts. So, the managerial side of it’s very different than the student-centered part of it. Just try to be visible, you know, talk to you guys a lot, see what’s on your mind.\r\n\r\nPV: If you could live anywhere in the world, where would it be and why?\r\n\r\nAP: I’ve always been fascinated with Easter Island, if you’ve ever heard of that place. It’s off of the coast of Peru. I don’t know about living there though, that might be tough. That’s a place I’ve always been fascinated with and would want to check out, so maybe I’d go with that.  I’d just hang out on Easter Island and be reflective, then I’d come back to Palo Alto, right. <em>(laughs).<\/em>\r\n\r\nPV: What would students be surprised to find in your refrigerator right now?\r\n\r\nAP: That’s actually a really good question. I would say a homemade chicken broth, how’s that sound? I’m quite a cook and a chef, and I like to make stocks and broths, so that might be something that isn’t a normal, everyday item.\r\n\r\nPV: What is something that has surprised you about Paly so far?\r\n\r\nAP: I think one thing that has surprised me a lot is the history actually that a lot of people have. A lot of teachers I’ve talked to and parents during Back to School Night talk about when they went to Paly, especially the teachers, you know, “I’ve been here for 20 years!” or “30 years” and “I was a student here at Paly, too!” Usually you might have a couple teachers, but it seems like a lot of the teachers I’ve talked to have a past, which matters on how the school culture is built here.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Paly Voice sat down with new Dean of Students Adam Paulson to learn how his time at Palo Alto High School is going so far. Paulson takes the place of Craig Tuana, who is now an assistant principal at Lynbrook High School.","date":"2014-09-10 17:03:20","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0022.jpg","categories":["Features"],"tags":{"22665":"adam paulson","22664":"dean of students","25040":"interview"}},{"id":73568,"title":"Mitchell Park Library keeps teen and green in mind","permalink":"http:\/\/palyvoice.com\/2014\/09\/09\/mitchell-park-library-keeps-teen-and-green-in-mind\/","content":"[caption id=\"attachment_73571\" align=\"aligncenter\" width=\"572\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\"><img class=\"wp-image-73571\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg\" alt=\"People will have plenty of room to experience the Mitchell Park Library’s new features thanks to the building’s massive size. According to the library website, the facility will be approximately four times larger than its predecessor, with a collection nearly twice its previous size. Its children’s area alone is nearly as large as the Children’s Library on Harriet Street.  http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/my_mitchell.asp Photo by William Zhou.\" width=\"572\" height=\"268\" \/><\/a> People will have plenty of room to experience the Mitchell Park Library’s new features thanks to the building’s massive size. <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/topics\/projects\/facilities\/library\/mitchell.asp\">According to the library website<\/a>, the facility will be approximately four times larger than its predecessor, with a collection nearly twice its previous size. Its children’s area alone is nearly as large as the Children’s Library on Harriet Street. Photo by William Zhou.[\/caption]\r\n\r\nAfter almost three years of delay filled with construction and legal problems, the Mitchell Park Library is slated to open this November on Middlefield Road and will feature a variety of teen spaces and environmentally friendly features.\r\n\r\nKevin Zittle of Palo Alto Recreation told The Paly Voice, “We want you to come to this building and enjoy it as a community space and library for education, as well as a way to keep green on people’s minds.”\r\n\r\nThe two-story building will have many spaces that people can enjoy.\r\n\r\n“The library will feature a 56,000-square-foot facility that include[s] flexible library spaces [with a] separate teen room, computer room, quiet reading rooms, game rooms, basketball area, Ada’s Cafe and many other amenities,” Palo Alto City Manager James Keene said in a <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1064\">May press release.<\/a>\r\n\r\n[caption id=\"attachment_73572\" align=\"alignright\" width=\"243\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0787.jpg\"><img class=\" wp-image-73572\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0787.jpg\" alt=\"According to the City of Palo Alto, the library set out to become a sustainable joint-use facility that will be a vibrant destination for civic, cultural, social, educational and recreational activities and will replace undersized and aged facilities.  Photo by William Zhou. \" width=\"243\" height=\"182\" \/><\/a> According to the City of Palo Alto, the library set out to become a sustainable joint-use facility that will be a vibrant destination for civic, cultural, social, educational and recreational activities and will replace undersized and aged facilities. Photo by William Zhou.[\/caption]\r\n\r\n<strong>Teen Use:<\/strong>\r\nThe library will offer many places for teens to both socialize and study.\r\n\r\nThe game room, designed for teens, will provide teens with a place to relax and escape from the pressure of school.\r\n\r\n“The game room was designed specifically for teens and will be used almost exclusively by teens” Lacee Kortsen, a City of Palo Alto Community Services Manager said. “It will have a foosball, ping-pong, pool and air hockey table; large flat screen TV and lounge area for gaming (Xbox, PlayStation, etc.).”\r\n\r\nThe teen space will also have a food area and other facilities, according to Korsten.\r\n\r\n“There will be a teen-run snack bar; a stage with multiple lighting and sound options; multiple lounge areas to hang out; and an outdoor, half-court basketball court connected to the center,” Korsten said.\r\n\r\nBesides being a place to socialize, the new library will allow teens to study.\r\n\r\nAccording to Garcia, there will be a teen zone that will have a technology bar, computers, study spaces and lounging area. The study space will have computers, Smart Board and projector for project needs. Teens can also browse popular media and fiction collections.\r\n\r\nThe library will even provide special accommodations during finals week.\r\n\r\n“We plan to provide ‘study hall’ space and after-hours time for students during that [finals] week,” Garcia said. “In addition, we will be providing some wellness classes for teens and ending with a special after-finals party.”\r\n\r\nTeens looking to get involved in the community can also use the library as a platform to find opportunities, according to Garcia.\r\n\r\n“The library will provide new teen programs and services, including a Teen Advisory Board, a Homework Center for K-5 led by teen volunteers and continue to support our makeX teen <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/lib\/teens\/makex.asp\">mobile makerspace<\/a>, currently at Cubberley Community Center and plenty of volunteer opportunities” Garcia said.\r\n\r\nSophomore Candace Wang is looking forward to the many features of the library.\r\n\r\n“I love the game room and the cafe,” Wang said. “It's great how they're trying to associate other things to libraries. This definitely makes the library a more popular place to hang out and relax and study.”\r\n\r\n[caption id=\"attachment_73573\" align=\"alignright\" width=\"249\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\"><img class=\"wp-image-73573\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0793.jpg\" alt=\"According to Zittle, The Mitchell Park Library will have multiple outdoor patio areas and large windows. The library will also have three green roofs and 6,000 square feet of solar panels. Photos by William Zhou.\" width=\"249\" height=\"187\" \/><\/a> According to Zittle, The Mitchell Park Library will have multiple outdoor patio areas and large windows. The library will also have three green roofs and 6,000 square feet of solar panels. Photo by William Zhou.[\/caption]\r\n\r\n<strong>Green Features:<\/strong>\r\nThe library also highlights Palo Alto’s effort to be environmentally friendly through its multiple green features.\r\n\r\nAccording the the <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/topics\/projects\/facilities\/library\/mitchell.asp\">City of Palo Alto website<\/a>, the library is being built to Leadership in Energy and Environmental Design standards and is expected to be rated as LEED Platinum, the highest rating possible.\r\n\r\nIn order to be certified LEED Platinum, the city constructed the library with its environmental footprint in mind.\r\n\r\nThe website continues by saying, “during construction, a minimum of 75 percent of construction waste generated was either recycled or reused; a minimum of 20 percent of materials used were recycled items.”\r\n\r\nAfter unsatisfactory performance from its original contractors, the city has hired construction company, Big D Pacific to finish the build.\r\n\r\n“We are encouraged by the amount of work Big D has corrected already, and everybody is focused on completing the project with quality work and having it open to the public,” Assistant Public Works Director Brad Eggleston said.\r\n\r\nOne of the many new <a href=\"http:\/\/www.cityofpaloalto.org\/forms\/mplcc\/\">environmentally friendly features<\/a> are the green roofs.\r\n\r\n“The most visible features are the green roofs,” Zittle said. “They’re not only beautiful, but they also absorb the sunlight and decrease the heat given off by the building.”\r\n\r\nThe library is built to emphasize the connection between people and nature, according to Zittle.\r\n\r\n“Ninety percent of the spaces in the library have a window to the outside,” Zittle said. “There’s the green wall outside the entrance and there are two patios where you can sit out next to the green roofs. The green features are very much a part of the building.”\r\n\r\nThe green features will not only provide people with lovely environments, but they will also help the city save resources.\r\n\r\n“The library will save close to 50 percent, and 30 percent reduction in water use [due to its green features]” Zittle said.\r\n\r\nAlthough it still is not open yet, the Mitchell Park Library has already excited Palo Altans.\r\n\r\n\"I think it is going to be a really great place for people to work and just spend some time with friends,\" freshman Tanay Krishna said.\r\n\r\nAccording to Keene, the library will be a place that the entire community can enjoy.\r\n\r\n“The new Mitchell Park Library and Community Center will undoubtedly be a community jewel that will bring together multi-generations of Palo Altans for many years to come,” Keene said.\r\n\r\nThe first event at the new library will be the Grand Opening scheduled for 11 a.m. to 4 p.m. on Saturday, Dec. 6.\r\n\r\nAfterwards<a href=\"http:\/\/bit.ly\/1fKXTof\"> five weeks of events<\/a> targeted at different audiences will follow, according to Garcia.\r\n\r\n“There will be lots of activities and performances around the celebration of our opening,” City of Palo Alto representative RuthAnn Garcia told The Paly Voice.\r\n\r\nThe library will be open until 8 p.m. Mondays through Thursdays, until 6 p.m. on Fridays and Saturdays, and until 5 p.m. on Sundays.\r\n\r\n&nbsp;","excerpt":"After almost three years of delay filled with construction and legal problems, the Mitchell Park Library is slated to open this November on Middlefield Road and will feature a variety of teen spaces and environmentally friendly features.","date":"2014-09-09 13:26:04","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg","categories":["News","Spotlight"],"tags":{"15410":"game","27712":"game room","27710":"grand opening","8848":"Library","27709":"mitchell park","27711":"november","9663":"space","27177":"teen"}}]