[{"id":79604,"title":"Season preview: Girls&#8217; soccer sets a goal for success","permalink":"http:\/\/palyvoice.com\/2014\/12\/02\/season-preview-girls-soccer-sets-a-goal-for-success\/","content":"[caption id=\"attachment_79605\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0133.jpg\"><img class=\"size-full wp-image-79605\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0133.jpg\" alt=\"Junior utility player prepares to kick a long ball in a game last year. The Palo Alto High School girls’ soccer team beat the Saratoga Falcons, 3-0, on Jan. 15 at home.\" width=\"600\" height=\"400\" \/><\/a> Junior utility player Jacey Pederson prepares to kick a long ball in a game last year. The Palo Alto High School girls’ soccer team beat the Saratoga Falcons, 3-0, on Jan. 15 at home. Photo by Maddy Jones[\/caption]\r\n\r\nThe Palo Alto High School girls’ soccer team hopes for a Central Coast Section win in its second year back in the De Anza Division, the stronger of the two divisions in the <a href=\"http:\/\/www.scval.com\">Santa Clara County Athletics League<\/a>.\r\n\r\nPaly finished last year with an overall record of 11-5-5 and a league record of 6-2-4. This year, the team expects to battle for a league championship in the De Anza Division.\r\n\r\n“I think we definitely proved we belong in that [the De Anza] division [last year],\" said junior co-captain and returning league MVP Jacey Pederson.\r\n\r\nIt has been a decade since the Paly girls' team  has won the league title, according to assistant coach Eric Seedman.\r\n\r\nLast year, the team made it to the semifinals of CCS playoffs, but lost to the eventual champions, Los Gatos High School, with an overall record of 12-4-5 and a league record of 7-3-2.\r\n\r\n\"Ultimately I think our goal is to get to and win the CCS finals,\" Pederson said.\r\n\r\nSeedman says he believes the team has a good shot this year at both titles.\r\n\r\n\"I do feel that the players are very skilled and talented, so we can meet our goals of winning our league and the CCS title,\" Seedman said.\r\n\r\nThe team will however suffer the loss of key players after graduating Sunny Lyu, Megan Tall, Jess Branson and Julia Kwasnick. In addition, a recent collarbone injury to senior co-captain Olivia Musil has put her out for part or possibly all of the season, which is a major setback for the team, according to Seedman. However, Seedman says he believes the team will still preform well.\r\n\r\n“Although they are very good players and difficult to replace, we are confident that our returning players have improved significantly and that we have some very promising newcomers,” Seedman said.\r\n\r\nThe Vikings will play the Evergreen Valley Cougars in a pre-season game at 5:45 p.m. Wednesday, Dec. 3, at Paly.","excerpt":"The Palo Alto High School girls’ soccer team hopes for a Central Coast Section win in its second year back in the De Anza league.","date":"2014-12-02 13:09:09","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0133.jpg","categories":["Sports"],"tags":{"8568":"CCS","10199":"eric seedman","10198":"girls soccer","25078":"jacey pederson","12045":"season preview","9110":"Soccer"}},{"id":79613,"title":"Season preview: Experienced players to lead boys&#8217; basketball to success","permalink":"http:\/\/palyvoice.com\/2014\/12\/01\/season-preview-experienced-players-to-lead-boys-basketball-to-success\/","content":"[caption id=\"attachment_79618\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_99301.jpg\"><img class=\"wp-image-79618\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_99301.jpg\" alt=\"Senior Kevin Mullin rebounds the ball and drives to score. Paly defeated Saratoga High School 66-31 on Jan. 22, 2014. Photo by Edward Mei. \" width=\"600\" height=\"432\" \/><\/a> Now-senior Kevin Mullin rebounds the ball and drives to score. Paly defeated Saratoga High School 66-31 on Jan. 22, 2014. Photo by Edward Mei.[\/caption]\r\n\r\nAfter making it to the quarterfinals of the Central Coast Section playoffs, the Palo Alto High School boys' basketball team is hoping to accomplish another successful season with its more experienced players.\r\n\r\nLast season (15-8, 8-4), Paly fell to Menlo-Atherton High School in the quarterfinals of the Central Coast Section playoffs. Senior guard Kevin Mullin says that even after graduating key players Noah Phillips, Keesean Johnson, Clark Schmutz and Matthew Fogarty last season, the team will be strong due to many returning players.\r\n\r\n\"We lost four seniors, but we're not really worried,\" Mullin said. \"We've got a couple of guys who are ready to step up — [senior] Jonathan Rojahn, [senior] Alex Dees [and junior] Justin Hull, among them.\"\r\n\r\nHull agrees, emphasizing that the experienced sophomores and juniors of last year's team will be stepping up.\r\n\r\n\"Last year there were a lot of new people who hadn't played the year before,\" Hull said. \"This year we have more people who actually played last year so they're more familiar with the offense and our coach and what he's trying to do. That really helps in our first couple of tournaments.\"\r\n\r\nWith experienced players, Mullin is looking forward to a different game strategy.\r\n\r\n\"We'll be playing a little more uptempo this season,\" Mullin said. \"Playing defense the whole court, from one end to the other. [We'll] try to get more shots up this year. Other than that, we'll still going to be running our offense.\"\r\n\r\nThe team will take on Santa Clara High School at 7 p.m. tomorrow at Santa Clara in its first preseason game.\r\n\r\n\"We haven't really gotten a chance to scout them,\" Mullin said. \"From what I know we'll be able to handle ourselves.\"","excerpt":"After making it to the quarterfinals of the Central Coast Section playoffs, the Palo Alto High School boys' basketball team is hoping to accomplish another successful season with its more experienced players.","date":"2014-12-01 20:19:22","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_99301.jpg","categories":["Sports"],"tags":{"33524":"2014-15","8538":"boys basketball","29116":"justin hull","11831":"kevin mullin"}},{"id":79469,"title":"Season preview: Wrestling looks to rebuild in new season","permalink":"http:\/\/palyvoice.com\/2014\/12\/01\/season-preview-wrestling-looks-to-rebuild-in-new-season\/","content":"[caption id=\"attachment_79552\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image.jpg\"><img class=\"wp-image-79552 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image.jpg\" alt=\"image\" width=\"600\" height=\"400\" \/><\/a> A lone wrestler works out in the Paly wrestling room. The team finished last season with a league record of 13-14. Photo by Wesley Woo.[\/caption]\r\n\r\n<span style=\"color: #000000;\">After placing sixth at the Santa Clara Athletic Valley League Finals last year, the Palo Alto High School wrestling team is looking to rebuild its program in preparation for the upcoming season.<\/span>\r\n\r\n<span style=\"color: #000000;\">According to assistant coach Tony Brewer, the main issue is the small number of experienced wrestlers on the team this year.<\/span>\r\n<p style=\"margin-bottom: 0cm;\"><span style=\"color: #000000;\">“It's a rebuilding season because we haven't had a huge turnout,” Brewer said. “We have a lot of kids that didn't come back, [so] we're very young, but we also have two or three individuals that we have high expectations for.\"<\/span><\/p>\r\n<p style=\"margin-bottom: 0cm;\"><span style=\"color: #000000;\">Sophomore wrestler Seth Goyal is one of these individuals. He echoed both Brewer's sentiments on rebuilding and setting high expectations for his individual season.<\/span><\/p>\r\n<span style=\"color: #000000;\">\"Some of the team's expectations for the season are to build up the program in terms of skill and numbers since most of our team from last year quit,\" Goyal said. \"[My] personal goal is simple: State Champion for 122 pounds.\"<\/span>\r\n\r\n<span style=\"color: #000000;\">Senior wrestler James Giaccia, another wrestler looking to compete for a state title, added that some losses were expected and not a result of a lack of returning wrestlers.<\/span>\r\n\r\n<span style=\"color: #000000;\">\"We lost Josh Deckleman [a graduated senior], who was huge for us,\" Giaccia said. \"But we still have me and Seth Goyal.\"<\/span>\r\n\r\nRebuilding will also have to occur without long-serving coach Dave Durant.\r\n<p style=\"margin-bottom: 0cm;\"><span style=\"color: #000000;\">“This year, we have a new head coach,\" Brewer said. \"Dave Durant coached with me here since the 90s, [but now] coach Brahman Creighton from JLS [middle school] is the new coach.”<\/span><\/p>\r\n<span style=\"color: #000000;\">Brewer also added that the upcoming JV [ junior varsity] and varsity tournaments will be a good chance for the team's top wrestlers to compete for titles and for new members to acclimatize to the sport.<\/span>\r\n<p style=\"margin-bottom: 0cm;\"><span style=\"color: #000000;\">“Our experienced wrestlers are looking to place, hopefully win,” Brewer said. “The younger guys will be on JV, which is most of our guys, and are looking to get experience. They've never wrestled before, quite a few of them, so it will be a good first time.”<\/span><\/p>\r\n<span style=\"color: #000000;\">The first varsity tournament will begin at 7 a.m. on Saturday, Dec. 6 at Half Moon Bay High School.\r\n<\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"After placing sixth at the Santa Clara Athletic Valley League Finals last year, the Palo Alto High School wrestling team looks to rebuild their program in preparation for the upcoming season.","date":"2014-12-01 14:14:24","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image.jpg","categories":["Sports","Wrestling"],"tags":{"33518":"palo alto high school wrestling","33517":"palo alto wrestling","8966":"paly wrestling","9012":"preview","12045":"season preview","9241":"wrestling","33521":"wrestling preview","33520":"wrestling season","33519":"wrestling tournament"}},{"id":79563,"title":"Season preview: Boys&#8217; soccer kicks off new season","permalink":"http:\/\/palyvoice.com\/2014\/11\/30\/season-preview-boys-soccer-kicks-off-new-season\/","content":"[caption id=\"attachment_79564\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-28-at-6.08.39-PM.png\"><img class=\"size-full wp-image-79564\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-28-at-6.08.39-PM.png\" alt=\"Junior forward Dami Bolarinwa jukes out a Milpitas defender in \" width=\"600\" height=\"399\" \/><\/a> Junior forward Dami Bolarinwa jukes out a Milpitas defender in a game last year. Paly and Milpitas tied 1-1 in their game on Dec. 10, 2013 on the Paly field. Photo by Scott Andrews.[\/caption]\r\n\r\nThe Palo Alto High School boys’ soccer team is looking forward to a new season with experienced players after moving up a league.\r\n\r\nLast year, the team finished with an overall record of 7-8-5 and a league record of 2-5-3 and graduated seniors Tony Maharaj, Neal Biswas and Cina Vazir. This year, the team will be stronger due to more seasoned players, according to senior center back Preston Kuppe.\r\n\r\n“I think that we will be better than last year because we have some good returning players,” Kuppe said. “The biggest difference is that we have more experience this year, so hopefully that will work to our advantage.”\r\n\r\nLast year, the team almost made the Central Coast Section playoffs, according to junior defensive midfielder Siddharth Srinivasan.\r\n\r\n“We had to beat or tie league champion Los Gatos on the last day of last season, and we conceded in the last minute to lose it,” Srinivasan said. “This season, we hope to secure automatic qualification for CCS and fight for the league title.”\r\n\r\nHowever, assistant coach Amir Malekpour says that it may be difficult because the team moved up to the De Anza League.\r\n\r\n“It’s going to be a challenge for us this year since we moved up from the El Camino League,” Malekpour said. “We are facing better teams, but I think we should do OK.”\r\n\r\nAdditionally, the team lost other key players besides seniors, according to Malekpour.\r\n\r\n“Some of our starters aren’t playing school [soccer] this year because of club,” Malekpour said. “That’s quite a change for us — looking for players to fill the spots.”\r\n\r\nSrinivasan says that the team has a strong offense with certain key players.\r\n\r\n“We have very fast and strong forwards, such as [junior] Dami Bolarinwa, [sophomore] Michel Ange-Siaba and [senior] Edward Chen, so we will look to play a more pressing defense,\" Srinivasan said.\r\n\r\nMalekpour agrees, emphasizing the overall strength of the team.\r\n\r\n\"We have a lot of players capable of stepping up,” Malekpour said. “Mostly [seniors] Preston Kuppe and Wesley [Woo] will be the main two in defense and midfield.”\r\n\r\nThe boys’ next game is their first pre-season game against Milpitas High School at 3:30 p.m., Dec. 1, at home.\r\n\r\n“Milpitas has always been a very good opponent to play against because they're skillful yet also aggressive, but we know how they play overall, so hopefully we'll be able to use that against them to pull out a win,” Kuppe said.","excerpt":"Palo Alto High School’s boys’ soccer team is looking forward to a new season with experienced players after moving up a league.","date":"2014-11-30 13:32:21","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-28-at-6.08.39-PM.png","categories":["Sports"],"tags":{"33524":"2014-15","33523":"2014-2015 season","8537":"Boys","9012":"preview","12045":"season preview","33522":"varsity soccer"}},{"id":79467,"title":"Paly students podium in jiu-jitsu championship","permalink":"http:\/\/palyvoice.com\/2014\/11\/27\/paly-students-podium-in-jiu-jitsu-championship\/","content":"[caption id=\"attachment_79476\" align=\"alignnone\" width=\"550\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10255765_10101755490340081_2407649469093751522_n-1.jpg\"><img class=\"wp-image-79476\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10255765_10101755490340081_2407649469093751522_n-1.jpg\" alt=\"Freshman Ethan Rose prepares for his match with instructor Benji Silva. Photo courtesy of Stacey Woods. \" width=\"550\" height=\"327\" \/><\/a> Freshman Ethan Rose prepares for his match with instructor Benji Silva. Rose has been training with Silva for a little more than a year at Form Fitness. Photo courtesy of Stacey Woods.[\/caption]\r\n\r\nThree Palo Alto High School students placed within the top three finishers during their jiu-jitsu events this past weekend at the Bay Area Jiu-Jitsu Championships at Encinal High School in Alameda.\r\n\r\nFreshman Ethan Rose, junior Max Strul and junior Nick Olgado all received medals for their performances, with Rose winning first place in the No Gi event for his weight group. Strul and Olgado finished their weight group events in second and third place, respectively.\r\n\r\nAll three competitors are involved in Form Fitness's after-school Jiu-Jitsu program and have been practicing their skills in both jiu-jitsu and kickboxing for a little over a year with professional fighter Benji Silva, according to Form Fitness manager Stacey Woods.\r\n\r\n\"I am very impressed with their [the students'] discipline and skill development in this unconventional sport,\" Woods said in an email to The Paly Voice.\r\n\r\nOlgado credits coach Silva's commitment and the support of Form Fitness as the biggest reasons why all of three students were so successful in the tournament.\r\n\r\n\"We've been preparing for the competition for a long time at Form, and our teacher, Benji Silva, is a great teacher,\" Olgado said. \"He's pushed us at every class, both mentally and physically. Without a local gym like Form, I don't think I would have gotten into jiu-jitsu or kickboxing in the first place.\"\r\n\r\nAdditionally, Olgado encourages any students who are interested in the sport to begin taking classes at Form Fitness.\r\n\r\n\"I'd recommend anybody to come and try out classes there,\" Olgado said.\r\n\r\nForm Fitness is located just a few blocks away from Paly, at 445 Bryant St.","excerpt":"Three Palo Alto High School students placed within the top three finishers during their jiu-jitsu events this past weekend at the Bay Area Jiu-Jitsu Championship at Encinal High School in Alameda. ","date":"2014-11-27 00:30:07","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10255765_10101755490340081_2407649469093751522_n-1.jpg","categories":["News"],"tags":{"33503":"benji silva","33504":"form fitness","33499":"jiu jitsu","33500":"olgado","33501":"rose","33505":"stacey woods","33502":"strul"}},{"id":79445,"title":"Slideshow: Students showcase their talents at Open Mic","permalink":"http:\/\/palyvoice.com\/2014\/11\/26\/slideshow-students-showcase-their-talents-at-open-mic\/","content":"The Palo Alto Teen Arts Council hosted its second Open Mic of the school year at 7:30 p.m. on Nov. 21 at the Palo Alto Children's Theatre. Many Palo Alto High School students were given the opportunity to sing, improvise scenes, read poems, dance or act in front of an audience.\r\n\r\n[slideshow post_id=79445]","excerpt":"Palo Alto High School students perform at the Teen Arts Council's second Open Mic of the school year.","date":"2014-11-26 20:52:36","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/IMG_0116.jpg","categories":["Slideshow"],"tags":{"29694":"chris hinstorff","33472":"fabo garduno","33474":"gabe galang","33473":"jess feeman","33461":"joey kelisson lynn","29734":"laura maystead","27178":"open mic","29376":"paper islands","33460":"paul bleich","29378":"sally wang","9107":"slideshow","33459":"sophie swezey","33475":"sylvia targ","27176":"teen arts council"}},{"id":79519,"title":"Storify: Paly perspective of Thanksgiving 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/26\/storify-paly-perspective-of-thanksgiving-2014\/","content":"Follow this year's Thanksgiving as seen through the eyes of the Palo Alto community. Use #palythanks to be featured below.\r\n<div class=\"storify\"><iframe src=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014\/embed?header=false&amp;border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014.js?header=false&amp;border=false\"><\/script>\r\n<noscript>[<a href=\"\/\/storify.com\/thepalyvoice\/thanksgiving-2014\" target=\"_blank\">View the story \"Thanksgiving 2014\" on Storify<\/a>]<\/noscript>","excerpt":"Follow this year's Thanksgiving as seen through the eyes of the Palo Alto community with #palythanks.","date":"2014-11-26 17:08:34","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/IMG_9747.jpg","categories":["Multimedia"],"tags":{"33480":"#palythanks","8713":"Food","8944":"palo alto high school","8953":"paly","33481":"paly thanks","30934":"storify","10166":"thanksgiving"}},{"id":79501,"title":"Students and staff react to Darren Wilson ruling","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/students-and-staff-react-to-darren-wilson-ruling\/","content":"Following the recent decision to not hold a trial for the State of Missouri v. Darren Wilson case, Palo Alto High School students and the Palo Alto community are expressing their opinions on the issues presented by the case.\r\n\r\nA grand jury announced its decision not to indict police officer Darren Wilson yesterday. Wilson will not be charged for the shooting of 18-year-old Michael Brown that occurred on Aug. 9 of this year.\r\n\r\nPaly United States Government teacher Steven Foug said the case emphasizes the issues of racism and inequality that the U.S. has and continues to experience.\r\n\r\n“It’s tapping into a larger issue that seems to keep coming up again and again and again,” Foug said.  “There were issues about police violence in neighborhoods and inner cities 50 years ago that [people reacted] to, and then what happens is that broad statements or broad assumptions are put into place.”\r\n\r\nJunior Gabi Rossner stated her disagreement with the grand jury’s announcement.\r\n\r\n“I was disgusted and still am disgusted,\" Rossner said. \"I really do think that there should’ve been an indictment. The [facts are] that this was the 0.1 percent of the time that it [the indictment] didn’t go through with a mostly white jury in a black municipality and ... that the person organizing the jury is a famous pro-police lawyer.”\r\n\r\nSophomore Edward Park echoed these sentiments, focusing on the ethnic makeup of the grand jury which was 75 percent white.\r\n\r\n“Ferguson is actually predominately non-white,\" Park said. \"Juries should be based off of the population.\"\r\n\r\nSupporting the grand jury’s decision, junior Alfredo Gonzalez encourages Paly students to read the <a href=\"http:\/\/http:\/\/www.nytimes.com\/interactive\/2014\/11\/25\/us\/evidence-released-in-michael-brown-case.html?_r=0\">report<\/a> presented by the jury on Monday.\r\n\r\n“I think that they [Paly students] need to read the actual report and see why the jury had their verdict,\" Gonzalez said. \"That they weren’t racist, that the physical evidence and that ... black witnesses also were on the side of the cop.”\r\n\r\nIn regards to how students in Palo Alto should react to the recent issue, junior Dami Bolarinwa says that students should talk to one another about the topic.\r\n\r\n“I feel for everyone in Ferguson, and I hope things like this don’t happen,” Bolarinwa said. “Talk about it. The best way to deal with someone is to talk and get other people involved. It’s a democracy we live in, so we can ultimately change things. If we feel really strongly about it, we should talk to people and get people to rally up and voice our opinions.”\r\n\r\nFor more information on the recent peaceful protest that occurred this afternoon in front of Palo Alto's City Hall, click <a href=\"http:\/\/http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/\">here<\/a>.\r\n\r\n<i>Staff writer <a href=\"palyvoice.com\/author\/amleung16\" target=\"_blank\">Amy Leung<\/a> also contributed to this story.<\/i>","excerpt":"Following the recent decision to not hold a trial for the State of Missouri v. Darren Wilson case, Palo Alto High School students and the Palo Alto community are expressing their opinions on the issues presented by the case.","date":"2014-11-25 16:00:49","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0283.jpg","categories":["News"],"tags":{"33471":"#blacklivesmatter","33477":"#siliconshutdown","33479":"darren wilson","33464":"ferguson","33462":"michael brown","8944":"palo alto high school","33478":"student reactions","33476":"studentreactions"}},{"id":79488,"title":"Ferguson protesters gather at Palo Alto City Hall","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/","content":"[caption id=\"attachment_79494\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg\"><img class=\"size-full wp-image-79494\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg\" alt=\"A peaceful protestor looks on somberly as another protester shares her thoughts. She carries a sign that says, &quot;No Justice in AmeriKKKa.&quot; Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> A peaceful protestor looks on somberly as another protester shares her thoughts during a peaceful gathering this afternoon at Palo Alto City Hall. Roughly 50 people were present at 1:30 p.m. to listen to others talk about their responses to the decision not to indict Officer Darren Wilson in Ferguson, Mo. Photo by Amy Leung.[\/caption]\r\n\r\nAbout 50 Palo Alto residents and Stanford students congregated this afternoon in front of Palo Alto City Hall to peacefully protest a Missouri grand jury's decision not to pursue a trial for an officer who shot an unarmed resident in Ferguson, Mo. earlier this year.\r\n\r\nOriginally starting at the plaza by Pizza My Heart, the protesters relocated to City Hall. The protest was peaceful, with people holding cardboard signs with sayings such as \"#blacklivesmatter\" and \"No Justice in AmeriKKKa.\"\r\n\r\n[caption id=\"attachment_79493\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0271.jpg\"><img class=\"size-full wp-image-79493\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0271.jpg\" alt=\"A crowd of peaceful protesters listens to one protestor as he talks about the brutality of racism. Police lights shine in the background as the Palo Alto Police Department blocks off the street for the protest. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> A crowd of peaceful protesters listens to one protestor as he talks about the brutality of racism. Police lights shine in the background as the Palo Alto Police Department blocks off the street for the protest. Photo by Amy Leung.[\/caption]\r\n\r\nVolunteers took turns stepping into the middle of the circle to relate their personal stories and opinions on the Ferguson decision.\r\n\r\nA Stanford student studying the Program in African and African American Studies, Tianay Pulphus, elicited murmurs of agreement from the crowd when she said, \"Do not be afraid when people say do not assemble. Do not be afraid when people say do not organize.\"\r\n\r\nAnother protester, Angel Santuario, originally came to videotape the protest, but ended up speaking to the crowd.\r\n\r\n\"It's not the system that failed us,\" Santuario said sarcastically. \"The system worked perfectly.\"","excerpt":"About 50 Palo Alto residents and Stanford students congregated this afternoon in front of Palo Alto City Hall to peacefully protest a Missouri grand jury's decision not to pursue a trial for an officer who shot an unarmed resident in Ferguson, Mo. earlier this year.","date":"2014-11-25 15:13:24","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/DSC_0273.jpg","categories":["Editor's Pick","News"],"tags":{"33471":"#blacklivesmatter","33469":"city hall","8653":"downtown","33464":"ferguson","33465":"indictment","33462":"michael brown","33463":"officer darren wilson","8939":"palo alto","33468":"peaceful","33466":"pizza my heart","33467":"protest","33470":"racism"}},{"id":79186,"title":"Students place in the Siemens Competition","permalink":"http:\/\/palyvoice.com\/2014\/11\/25\/students-place-in-the-siemens-competition\/","content":"Five high school students in Palo Alto are finalists and semifinalists in this year's Siemens Competition in Math, Science and Technology, according to announcements on the Siemens Foundation <a href=\"http:\/\/www.siemens-foundation.org\/en\/\">website<\/a> in early Novemeber.\r\n\r\n[caption id=\"attachment_79199\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-20-at-9.03.41-PM1.png\"><img class=\"size-full wp-image-79199\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-20-at-9.03.41-PM1.png\" alt=\"Paly and Gunn students speak about their submissions to the Siemens Competition. Photo courtesy of Simon Bloch.\" width=\"600\" height=\"449\" \/><\/a> Paly and Gunn students speak about their submissions to the Siemens Competition. Superintendent McGee praised each student for their hard work, and was impressed that they wrote 18-page papers. Photo courtesy of Simon Bloch.[\/caption]\r\n\r\nTwo Palo Alto High School students, junior Adele Bloch and senior Richard Cao; two Castilleja students, Kelsey Auyeung and Kris Auyeung; and one Gunn High School student, Joy Jin, are semifinalists of the national competition. One Gunn student, Sharon Chen, and one Castilleja student, Lea Sparkman, are finalists.\r\n\r\nAccording to the Siemens Competition website, the participants could present either individual or group projects for the competition, which is restricted to students attending high school in the U.S. and is funded by the Siemens Foundation. The foundation provides more than $7 million annually in the funding of educational initiatives like the Siemens Competition and The Siemens We Can Change the World Challenge, a program that develops solutions for environmental issues.\r\n\r\n[caption id=\"attachment_79371\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n1.jpg\"><img class=\"size-full wp-image-79371\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n1.jpg\" alt=\"Superintendent Max McGee commends students on their hard work for the Siemens Competition. Photo courtesy of Simon Bloch.\" width=\"600\" height=\"450\" \/><\/a> Superintendent Max McGee commends students on their hard work for the Siemens Competition. During the meeting he also discussed the value of innovation, and asked students about their projects. Photo courtesy of Simon Bloch.[\/caption]\r\n\r\nSparkman, a junior, had an internship over the summer that became the inspiration for the paper she submitted to the Siemens Competition.\r\n\r\n“It [the competition] is like a second internship after the summer,” Sparkman said. “It really requires you to understand what you learned over the summer really deeply and know why you did everything and I think it really just solidifies your understanding.”\r\n\r\n“The project that I worked on dealt with globular clusters and … galaxies,\" Sparkman said. \"So it was an astronomy project … We were comparing the chemical composition of the centers of the … galaxies and the globular clusters, which are basically clusters of stars that are orbiting around these galaxies.”\r\n\r\nAccording to Sparkman, she was not expecting to be a finalist of the Siemens Competition.\r\n\r\n“The most exciting and rewarding part was submitting the paper because … I had never written an 18-page paper before … and then when we won I didn’t expect it and it was very surprising, pleasantly surprising, and so now we go on to Regionals and I am excited for that,” Sparkman said.\r\n\r\n[caption id=\"attachment_79192\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Lea.jpg\"><img class=\"size-full wp-image-79192\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Lea.jpg\" alt=\"Castilleja junior Lea Sportsman is a finalist of the Siemens competition thanks to her analysis of the composition of galaxies and globular clusters. Photo by Ana Caklovic.\" width=\"450\" height=\"600\" \/><\/a> Sparkman is a finalist of the Siemens competition for her analysis of the composition of galaxies and globular clusters. Photo by Ana Caklovic.[\/caption]\r\n\r\nCao, a senior, also used his learning from a summer internship at Stanford University as the basis of his paper. Cao’s paper was about “using DNA sequencing to obtain autoantibodies” and the possible medical treatments that could be created from the sequencing, Cao said.\r\n\r\nThe competition required a thorough report, according to Cao.\r\n\r\n“It was an 18-page report. You needed an abstract, an introduction, methods, conclusions, summary and you needed a bunch of pictures. The hardest part was getting the abstract done,” Cao said.\r\n\r\nCao said that the competition process was simple and mostly internet-based.\r\n\r\n“You put your report in, you have to mail some basic safety regulations if you do biology, like I did. You need to get approval from your mentor if you have one, but to make semifinals there’s no person to person action,” Cao said.\r\n\r\n[caption id=\"attachment_79193\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Richard.jpg\"><img class=\"size-full wp-image-79193\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Richard.jpg\" alt=\"Senior Richard Cao is a semifinalist for his work with antibodies in a Stanford lab this summer. Photo by Ana Caklovic.\" width=\"450\" height=\"600\" \/><\/a> Cao is a semifinalist for his work with antibodies in a Stanford lab this summer. Photo by Ana Caklovic.[\/caption]\r\n\r\nThe Paly, Gunn and Castilleja finalists and semifinalists were awarded their trophies by the Palo Alto District School Board members at the School Board District meeting on Tuesday.","excerpt":"Several high school students in Palo Alto are finalists and semifinalists of the Siemens Competition in Math, Science and Technology. ","date":"2014-11-25 13:34:50","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10755019_609048882533997_291986762_n.jpg","categories":["Features","Spotlight","Uncategorized"],"tags":{"33408":"adele bloch","33407":"finalist","33410":"lea sparksman","33409":"richard cao","9072":"science","33406":"semifinalist","33405":"siemens competition 2014"}}]