[{"id":79265,"title":"Bay&#8217;s Best Black Friday Deals","permalink":"http:\/\/palyvoice.com\/2014\/11\/21\/bays-best-black-friday-deals\/","content":"With Black Friday around the corner, the Paly Voice searched the web and found some of the best local Black Friday deals. Click around the map to find the savings.\r\n\r\n<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=z5KablpJbu1w.kZ44IPiXuBP4\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<em>More deals will be added as they are announced.<\/em>","excerpt":"With Black Friday around the corner, The Paly Voice searched the web and found some of the best local Black Friday deals. Click around the map to find the savings.","date":"2014-11-21 14:45:12","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-20-at-1.27.18-PM.png","categories":["Multimedia","Spotlight"],"tags":{"33404":"2014 black friday","33403":"black friday"}},{"id":78759,"title":"Paly library to undergo renovation","permalink":"http:\/\/palyvoice.com\/2014\/11\/21\/paly-library-to-undergo-renovation\/","content":"[caption id=\"attachment_78766\" align=\"alignright\" width=\"320\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo-2.jpg\"><img class=\" wp-image-78766\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo-2.jpg\" alt=\"A board in the library shows the floor plan of the new library. Photo by Will Zhou.\" width=\"320\" height=\"240\" \/><\/a> A board in the library shows the floor plan of<br \/>the new library. The new Library will have a special area for books storage which allow more space for students to work, according to Paly librarian Rachel Kellerman. Photo by Will Zhou.[\/caption]\r\n\r\nThe Palo Alto High School library  is displaying its renovation plans on campus in an effort to receive student input.\r\n\r\nThe plans, which are located near chalkboard in the Library and approved by the school board on Sept. 23, show its many new features, according to Paly librarian Rachel Kellerman.\r\n\r\n“I’m most excited for the different parts of the new Library,” Kellerman said. “There will be lots of places that focus on how people work and spend time: quietly, collaboratively, productivity and reading.”\r\n\r\nThe funding from the library has come from a $378 million school bond which was approved on June 3, 2008 by the school board. The Paly library has been allotted $9.35 million, according to Kellerman.\r\n\r\nThe library will also have additions that make students’ lives easier, according to Kellerman.\r\n\r\n“We are also planning to have charging lockers for electronics and a genius bar so people can get help,” Kellerman said.\r\n\r\nSeveral students are also interested by the new plans.\r\n\r\n“I like the silent study space,” junior Eli Fedel said. “The current one is pretty loud. I also like the casual reading room. It’ll be a good way to cool off.”\r\n\r\nBefore the construction plans are finalized this year, the library hopes to get input from the students, according to Kellerman.\r\n\r\n[caption id=\"attachment_78765\" align=\"alignright\" width=\"301\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo-1.jpg\"><img class=\" wp-image-78765\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo-1.jpg\" alt=\"Paly junior Adrian Wang places his comment in the comment box, which is located at the front desk of the library. Photo by Will Zhou.\" width=\"301\" height=\"225\" \/><\/a> Junior Adrian Wang places his comment in the comment box, which is located at the front desk of the Library. Photo by Will Zhou.[\/caption]\r\n\r\n“We’ve already gotten some great advice,” Kellerman said. “Students have suggested to make the various spaces look different. For example, the silent space could be dimmer. Other students have also suggested having a quote wall.”\r\n\r\nFedel said he appreciates the library reaching out to students for their opinions.\r\n\r\n“It’s cool that the library is taking student input, especially since this is something that will directly affect the students,” Fedel said.\r\n\r\nThe comment box will be open to comments through November. Students can also have their voices heard by taking this <a href=\"http:\/\/libguides.pausd.org\/survey.php?survey_id=14892\">online survey<\/a>.\r\n\r\nThe Library construction will start in the summer of 2016 after the construction on the gyms is finished, according to Kellerman.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School library  is displaying its renovation plans on campus in an effort to receive student input.","date":"2014-11-21 14:16:54","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo-1.jpg","categories":["News","Spotlight","Uncategorized"],"tags":{"32671":"adrain wang","32668":"comments","8616":"construction","32672":"eli fedel","8848":"Library"}},{"id":79137,"title":"Girls&#8217; water polo season concludes with CCS quarterfinal loss","permalink":"http:\/\/palyvoice.com\/2014\/11\/20\/girls-water-polo-season-concludes-with-ccs-quarterfinal-loss\/","content":"The Palo Alto High School girls' water polo team (15-15, 6-6) <span style=\"color: #222222;\">ended its season in a 5-2 loss to Gunn High School in the Central <\/span>Coast Section quarterfinals on Saturday.\r\n\r\nDespite the loss, junior Katie Francis thought the season was a step in the right direction.\r\n\r\n“We were able to improve since last season and worked very hard to make it as far as we did in CCS,” Francis said. “Last year, we were unfortunately just out of CCS, and this year we made it to the third round”.\r\n\r\nAccording to Francis, the team had a strong performance on Saturday\r\n\r\n“We played a good game on Saturday,\" Francis said. \"We had a strong defense, and we were getting things moving on offense. Some of our shots just did not get into the goal.”\r\n\r\nEven though the team will be losing key seniors including Tess van Hulsen and Olivia Scola, junior Alina Drebin says she is optimistic for next season.\r\n\r\n“Next season, we are going to have a lot of seniors,” Drebin said. “So I'm excited because we are going to have a very experienced team, and I think our bench is going to be really deep next year.\"\r\n\r\nDrebin also believes there is room for improvement.\r\n\r\n“I think we have a lot of room to improve our offensive plays and improving our defensive awareness,”  Drebin said.","excerpt":"The Palo Alto High School girls' water polo team (15-15, 6-6) ended its season in a 5-2 loss to Gunn High School in the Central Coast Section quarterfinals on Saturday.","date":"2014-11-20 22:59:40","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed2.jpg","categories":["Sports"],"tags":{"33163":"Alina Drebin","8568":"CCS","9927":"girls water polo","29696":"Katie Francis","8953":"paly","9888":"quarterfinals","9846":"water polo","10248":"wopo"}},{"id":79202,"title":"Liveblog: Turkey Trot 2014","permalink":"http:\/\/palyvoice.com\/2014\/11\/20\/liveblog-turkey-trot-2014\/","content":"<em>The Parent Teacher Student Association will be hosting its annual Turkey Trot festival during an extended lunch tomorrow. Students can receive a turkey lunch for $5 in cash or $2 with 3 cans of nonperishable food. Check back on November 21 at 11:45 a.m. for live updates and commentary of the festival.<\/em>\r\n\r\n[liveblog]","excerpt":"The Parent Teacher Student Association will be hosting its annual Turkey Trot festival during an extended lunch tomorrow. Students can receive a turkey lunch for $5 in cash or $2 with 3 cans of nonperishable food. Check back on November 21 at 11:45 a.m. for live updates and commentary of the festival.","date":"2014-11-20 22:10:32","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/IMG_9472.jpg","categories":["Entertainment","Spotlight","Uncategorized"],"tags":{"8855":"liveblog","10166":"thanksgiving","10165":"turkey trot"}},{"id":79110,"title":"Boys&#8217; cross country prepares for state championships","permalink":"http:\/\/palyvoice.com\/2014\/11\/20\/boys-cross-country-prepares-for-state-championships\/","content":"The Palo Alto High School boys’ cross country team will be competing for the state championship in Fresno on Saturday after a second place finish in the Central Coast Section on Saturday.\r\n\r\nSenior Lucas Matison finished first in all of CCS after completing the three-mile route a Toro Park with a time of 15:40 according to, <a href=\"http:\/\/www.prepcaltrack.com\/ATHLETICS\/XC\/2014\/ccs_res.htm\">Preptrack<\/a>. Sophomore Kent Slaney finished in second for Paly and ninth overall with a time of 16:06.\r\n\r\nMatison says he is just happy to be competing in the state championships after boys’ cross country was able to rally from behind to finish in second place at CCS.\r\n\r\n“I’m really proud of all of them [my teammates],” Matison said “We [the boys' cross country] were ranked fourth, and only three moved on. And we gave it our all, and that not just made us get third [to qualify for state championships], but second place.”\r\n\r\nCoach Kelsey Feely is aware of the team's anxiousness with the upcoming race and plans to prepare a little differently for this meet.\r\n\r\n“We have to remember that they [the boy's cross country] put in the work, and now it’s just maintaining the level of fitness that they’re at all while, of course, avoiding injury,” Feely said “Therefore, instead of training, we are actually bumping things down slightly.”\r\n\r\nThe girls’ cross country season will come to a close after placing fourth in CCS, with only the top two teams moving on to the state championships.\r\n\r\nAfter exceeding their projected sixth ranking in CCS, junior Portia Barrientos is looking forward to next season.\r\n\r\n“Especially with the results from CCS this year, we [girls' cross country] are really optimistic,” Barrientos said. “The stronger teams are losing key runners, and if we work really hard over the summer, we could go to the state meet [next season].”","excerpt":"Boys' cross country will compete at Fresno on Saturday for state championships after a second place finish in central coast selections.","date":"2014-11-20 13:10:31","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/xc.jpg","categories":["Sports","Spotlight"],"tags":{"25414":"boys cross country","8568":"CCS","8620":"cross country","25415":"girls cross country","10041":"Lucas Matison","8944":"palo alto high school","9004":"portia barrientos","33010":"state championships","33011":"states"}},{"id":79101,"title":"Books Inc. annual promotion to benefit Paly library","permalink":"http:\/\/palyvoice.com\/2014\/11\/19\/books-inc-annual-promotion-to-benefit-paly-library\/","content":"The Palo Alto High School Library will benefit from all Books Inc. sales made today from 4 to 7 p.m.\r\n\r\nTwenty percent of all proceeds earned will go towards buying books for Paly students.\r\n\r\nAccording to Paly librarian Rachel Kellerman, the benefit started as soon as Books Inc. moved to Town and Country Village.\r\n\r\n\"When Books Inc. moved to Town and Country Village a few years ago, they offered shopping night to two schools,\" Kellerman said. \"It's a great partnership for us because we are right across the street, and they know and love the Paly students who shop there.\"\r\n\r\nHeld annually, the event is the library’s main fundraising event.  Whenever a student requests a book the library does not carry, the library can use the earned Books Inc. credit to buy the desired text.\r\n\r\n\"This is a big fundraiser for us as we make almost $1,000, which translates into almost 70 books,\" Kellerman said. \"When a student or staff wants a book, we can just take our store credit from the event and buy the book the same day.\"\r\n\r\nJunior Anant Marur believes that the event encourages connections between the Paly student body and the broader Palo Alto community.\r\n\r\n“It gives us [the Paly student body] more support from the community,” Marur said.  “It’s a mutually beneficial relationship that also shows just how much the rest of the town supports us.\"","excerpt":"The Palo Alto High School Library will benefit from all Books Inc. sales done from 4 to 7 p.m. today.","date":"2014-11-19 15:27:59","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/books-inc.jpg","categories":["News"],"tags":{"8533":"books inc.","32852":"deal","8725":"fundraiser","32853":"fundraising","21439":"Kellerman","8848":"Library","29383":"sale"}},{"id":79089,"title":"Boys&#8217; water polo season ends abruptly","permalink":"http:\/\/palyvoice.com\/2014\/11\/18\/boys-water-polo-season-ends-abruptly\/","content":"The Palo Alto High School boys’ water polo (12-13, 9-3) season ended last Thursday with a 10-9 loss to Salinas High School (18-4, 8-2) in Central Coast Section playoff.\r\n\r\nThe Vikings had a strong first quarter, carried by junior Winston Rosati who scored six goals overall, while the  Vikings’ defense held the Cowboys to just one goal.\r\n\r\nThe last three quarters, unfortunately for the Vikings, took a different turn.\r\n\r\nSalinas quickly recovered, and the game was tied up at the end of the first half.\r\n\r\nDuring the second half, in which both sides used their timeouts, the game was tied until Salinas pulled away with less than a minute remaining. The Vikings were never able to make a comeback.\r\n\r\n“We started out well, but we didn't make the adjustments we had to in the end,” coach Brandon Johnson said. “The team could have been a little more patient. They [Salinas] ran a pretty weird defense, and we gave into what they wanted.”\r\n\r\nEven though the team’s season ended on a bitter note, it was extremely successful overall, according to senior captain Lucas Novak. The Vikings tied first place with Gunn High School for the league championship title.\r\n\r\nThe team season could have been more successful if they had played at a consistent level throughout the season, according to junior driver Ryan Reed.\r\n\r\n“We played down [to] the level of our opponents, which has unfortunately been a recurring theme this season,” Reed said. “When we are on our game, we can challenge top North California Section and Central Coast Section teams like Las Lomas and St. Francis but then struggle against teams like Salinas that we should be able to put away in one quarter.”\r\n\r\nStill, according to Reed, the team has high hopes for the next season if the Vikings are able to fix this flaw.\r\n\r\n“Although we’re losing five excellent seniors this year, next year’s juniors are going to fill their spaces more than capably,” Reed said. “[Underclassmen] Jared Stanley and Nick Russell can become vital players with some more varsity experience.”","excerpt":"The Palo Alto High School boys’ water polo (12-13, 9-3) season ended last Thursday with a 10-9 loss to Salinas High School (18-4, 8-2).","date":"2014-11-18 14:13:37","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/10683495_936995846317213_634147306_o11.jpg","categories":["Sports"],"tags":{"9845":"boys water polo","32751":"fall sports 2014","8953":"paly","32468":"ryan reed","32750":"season recap","9846":"water polo"}},{"id":78849,"title":"I spy acai: Bare Bowls opens in Palo Alto","permalink":"http:\/\/palyvoice.com\/2014\/11\/18\/i-spy-acai-bare-bowls-opens-in-palo-alto\/","content":"Bare Bowls, the first acai bowl shop to open in Palo Alto, is a healthy addition to the downtown restaurant collection, opening at 530 Emerson St. earlier this month.\r\n\r\nBare Bowls specializes in acai bowls -- a kind of healthy smoothie made with the Brazilian fruit acai -- and other health foods. The menu offers acai, pitaya (dragon fruit) and kale bowls, oatmeal and smoothies. Menu items do not include added sweeteners or additives, according to the Bare Bowls <a href=\"https:\/\/www.localfoodlab.com\/members\/bare-bowls-e5c6ba\">website<\/a>. Instead the smoothies are sweetened with dates.\r\n\r\n[caption id=\"attachment_78851\" align=\"alignright\" width=\"308\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed-2.jpg\"><img class=\"wp-image-78851\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed-2.jpg\" alt=\"\" width=\"308\" height=\"411\" \/><\/a> Junior Molly Kraus sits at the main table waiting for her bowl. Bare Bowls has a trendy and modern feel. The menu features a variety of uncommon foods including goji berries, cashew milk and hemp seeds. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nBare Bowls is allergen-conscious and community aware, according to its website. Bare Bowls requests that all customers tell them their food preferences before ordering in order to make sure the food is as satisfactory as possible. All the granola is gluten-free. The back wall of the restaurant has a message board where community members can advertise for activities around the neighborhood.\r\n\r\nSome Palo Alto High School students find acai bowls a delicious snack and the experience enjoyable. Additionally, students appreciate what Bare Bowls has to offer over other acai bowls they have tried.\r\n\r\n\"Normally, acai bowls are too sweet, but Bare's isn't, so you can actually taste the small nuances they put in the toppings like agave nectar,\" senior Alexandra Hsieh said. \"I didn't stay for long, but the ambience was really nice.\"\r\n\r\nAs with many other specialty restaurant for healthy foods, Bare Bowls is expensive. The small bowl is $8 and the regular bowl is $12, which may be out of many students’ budgets, according to junior Molly Kraus.\r\n\r\n“It [Bare Bowls] tastes like overpriced Jamba Juice in a bowl,” Kraus said.\r\n\r\n[caption id=\"attachment_78852\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed-1.jpg\"><img class=\"wp-image-78852\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed-1.jpg\" alt=\"Senior Oskar Soderberg and junior Molly Kraus play checkers at Bare Bowls. Bare Bowls focuses on a community feel with open spaces and communal tables and games. Photo by Alex Merkle-Raymond\" width=\"350\" height=\"262\" \/><\/a> Senior Oskar Soderberg and junior Molly Kraus play checkers at Bare Bowls. Bare Bowls focuses on a community feel with open spaces and communal tables and games. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nBare Bowls hopes to expand to serve coffee and be a place for people to meet at, according to Bare Bowls manager Bridget Corson.\r\n\r\nCurrently Bare Bowls is open from 7 a.m. to 5 p.m. most days, which was disappointing to senior Christine Langston.\r\n\r\n\"I went earlier today really excited to eat breakfast there [Bare Bowls] with my friend, but they were closed,\" Langston said. \"I think they should open earlier. But anyway, I'm excited to try their acai bowls soon.\"\r\n\r\nThere is limited seating at Bare Bowls, and there is rarely a line. However, as more people hear about Bare Bowls, expect a longer line \"because of the health food fanatics in this area are excited for its opening,\" according to Langston.\r\n\r\n&nbsp;","excerpt":"Bare Bowls celebrated its grand opening Saturday after starting business last Monday. This new business focuses on health foods like fruit bowls, oatmeal and smoothies and tries to create a community-oriented feel. ","date":"2014-11-18 13:12:25","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed1.jpg","categories":["News"],"tags":{"32699":"acai","32698":"acai bowl","32701":"allergens","32696":"bare bowls","32736":"bridget corson","8653":"downtown","32697":"emerson","8687":"expensive","32700":"fruit","27710":"grand opening","32702":"healthy","8799":"jamba juice","32703":"oatmeal"}},{"id":78216,"title":"Fall sports: up-and-coming JV athletes","permalink":"http:\/\/palyvoice.com\/2014\/11\/16\/fall-sports-up-and-coming-jv-athletes\/","content":"Some may wonder where impressive varsity players gain their talent and attitude. Often the answer lies in the overlooked junior varsity teams, where athletes are able to develop and improve their skills.\r\n\r\nHere are just a few of the promising fall JV athletes that will be essential to the future of Palo Alto High School athletics.\r\n\r\nClick on the photo to navigate.\r\n<div align=\"center\">\r\n<div class=\"stlr-embed-container embed-large\" data-type=\"compact\" data-story-id=\"385041202812028798\"><script src=\"http:\/\/steller.co\/js\/steller.js\"><\/script>","excerpt":"Here are just a few of the promising JV athletes that will be essential to the future of Palo Alto High School athletics.","date":"2014-11-16 22:16:29","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/Screen-Shot-2014-11-16-at-10.13.24-PM.png","categories":["Sports","Spotlight"],"tags":{"32738":"alex beaudry","32741":"cassie fong","8620":"cross country","8693":"Fall","8714":"football","32742":"maya rebitzer","32739":"molly wietzman","32740":"paul jackson","32743":"reed foster","9120":"sports","9216":"volleyball","9846":"water polo"}},{"id":78691,"title":"Spring musical auditions: not to be slept through","permalink":"http:\/\/palyvoice.com\/2014\/11\/16\/spring-musical-auditions-not-to-be-slept-through\/","content":"With the end of the Palo Alto High School's fall show, \"Server of Two Masters,\" on Saturday, comes auditions for the spring musical \"The Drowsy Chaperone.\"\r\n\r\n[caption id=\"attachment_79056\" align=\"aligncenter\" width=\"570\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/6-L.jpg\"><img class=\"wp-image-79056\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/6-L.jpg\" alt=\"\" width=\"570\" height=\"380\" \/><\/a> Seniors Oskar Soderberg and Will Kast finished up as leads in \"Server of Two Masters.\" Both will be attending \"The Drowsy Chaperone\" auditions which begin Tuesday. Photo courtesy of Paly Theatre.[\/caption]\r\n\r\n“'The Drowsy Chaperone' is an inherently hilarious show because it parodies all of the crazy and ridiculous things that happen in other musicals,” senior stage manager Hannah Nguyen said.\r\n\r\nAuditions begin 2:30 p.m. Tuesday, Nov. 18, in the Haymarket Theater and will continue to the end of the week with each day dedicated to a certain aspect of the audition process. Everyday students will be asked to wear appropriate, comfortable clothing and be on time, according to Director Kathleen Woods.\r\n\r\n“The auditions are open and then the director, Kathleen Woods, in consultation with musical director, Michael Najar, conducts callbacks, where they see how well an auditioner fits a specific role,” Nguyen said.\r\n\r\nTuesday is dedicated to vocal auditions. Any student who auditions for the musical must audition with 16 bars of a traditional musical theater song. Music Director Michael Najar is available to help students choose and rehearse songs. There will be an accompanist available.\r\n\r\nWednesday will be a dance audition day. Students who have tap dance shoes are asked to bring them, according to Kathleen Woods. Additionally, stage movement specialist Kim Saunders will help with the auditions.\r\n\r\n“She [Saunders] will probably teach a combination and then we [auditioners] will do them in small groups,” senior Jamie Garcia said.\r\n\r\nThursday will be focused on acting. There will be a variety of parts for auditioners to read from, and people may be asked to read more than once.\r\n\r\n“They [students] will be given a 'side,' also known as a scene, to read as their audition,\" junior Clara Baker said. \"They will have time to practice before going up. When it is time for their audition, they should hand their forms to the auditioners and then walk onto the stage, state their name and the character they are reading for, take a moment and then begin. Don't forget to say thank you at the end.\"\r\n\r\nOn Friday, the callback list will be posted <a href=\"http:\/\/www.palytheatre.com\">online<\/a> and on the Haymarket doors. Even if students are not called back, there is a high likelihood that they can still be cast in the show. The official list will be posted on Sunday, Nov. 23.\r\n\r\nThere are 12 major parts, and Woods hopes to have an ensemble of 20 to 40 students. The official rehearsal schedule has not yet been released but can be found <a href=\"http:\/\/www.palytheatre.com\/calendar\/\">here<\/a>. The shows will be held on March 6-8 and 12-14.\r\n\r\nWoods is very excited to hold auditions and see the play come together.\r\n\r\n“The show is just so fun and everyone can participate,” Woods said.\r\n\r\n&nbsp;","excerpt":"The spring musical, The Drowsy Chaperone, will hold auditions November 18-21. The musical hopes to have a cast of around 50 students and include all aspects of song, dance and acting. The performances are in March 2015. See Kathleen Woods in the theatre for more information.","date":"2014-11-16 19:48:35","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/unnamed.jpg","categories":["Entertainment"],"tags":{"32596":"audition","8626":"dance","32571":"drowsy chaperone","29689":"kathleen woods","32594":"kwoods","32595":"michael najar","19628":"musical","30526":"najar","8953":"paly","29646":"paly theater","9104":"sing","32593":"spring","9159":"theater","9160":"theatre"}}]