[{"id":72072,"title":"Slideshow: Boys&#8217; lacrosse falls to M-A in SCVAL semifinal","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/slideshow-boys-lacrosse-falls-to-m-a-in-scval-semifinal\/","content":"Palo Alto High School boys' lacrosse (13-7, 9-5) team ended its season on Wednesday May 14 following an 11-10 loss to the Menlo-Atherton Bears (13-11, 9-5) at Paly in the Santa Clara Valley Athletic League semifinal.\r\n\r\n[slideshow post_id=72072]","excerpt":"Palo Alto High School boys' lacrosse (13-7, 9-5) team ended its season on Wednesday May 14 following an 11-10 loss to the Menlo-Atherton Bears (13-11, 9-5) at Paly in the Santa Clara Valley Athletic League semifinal.","date":"2014-05-20 13:39:29","author":"Phoebe So","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5298.jpg","categories":["Slideshow","Sports"],"tags":{"12015":"boys lacrosse","8811":"jordan gans","17799":"josh stern","8836":"Lacrosse","10306":"menlo-atherton","12172":"owen staiger"}},{"id":71992,"title":"Palo Alto Speech and Debate Camp makes changes","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/palo-alto-speech-and-debate-camp-makes-changes\/","content":"[caption id=\"attachment_71996\" align=\"alignright\" width=\"623\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.21.47-PM.png\"><img class=\"wp-image-71996 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.21.47-PM.png\" alt=\"Caption: Previous counselor of Palo Alto Speech and Debate Camp senior Jared Filseth lectures to the speech section of the camp. The camp offers classes in public speaking, debate, impromptu speech and advanced Lincoln-Douglas style debate. Photo by Noa Braun.\" width=\"623\" height=\"468\" \/><\/a> Previous counselor of Palo Alto Speech and Debate Camp senior Jared Filseth lectures to the speech section of the camp. The camp offers classes in public speaking, debate, impromptu speech and advanced Lincoln-Douglas style debate. Photo by Noa Braun.[\/caption]\r\n\r\nIn hopes of increasing awareness of the Palo Alto High School Speech and Debate Program, the organizers of Palo Alto Speech and Debate Camp have implemented various changes to the curriculum and structure of the camp.\r\n\r\nAccording to junior co-director Anish Haris, the camp, which has been in existence for the past 10 years, is built to prepare students to develop the abilities necessary to become effective public speakers.\r\n\r\n“We teach the students to articulate their opinions and present them with poise and confidence,” Haris said. “At the same time, students develop critical thinking skills that help them create and understand logical argumentation.”\r\n\r\nThe camp operates under the mission statement of allowing students to develop the communication skills that are necessary and applicable in most areas. This year, however, the curriculum has been modified from previous years to address the weaknesses most students grades six to 10 tend to face, according to Haris.\r\n\r\n“Instead of boring the students with lectures, the improved curriculum is more interactive and also gives students an opportunity to see what competitive high school speech and debate events are like,” Haris said.\r\n\r\nFor returning and previously experienced students, advanced lanes will be offered to allow students to delve further into the now expanded curriculum and acquire skills that are useful in a competitive setting.\r\n\r\nThe camp’s organizers also plan to supplement the curriculum with visitations from various guest speakers.\r\n\r\n“In order to give students an idea of what an effective communicator looks like, we have guest speakers come in to describe how public speaking has shaped them,” Haris said. “In previous years, we’ve had venture capitalists, local entrepreneurs and even Kevin Skelly help out with the camp by speaking to the students. Our camp has received more interest in recent years, and more and more members of the community are eager to speak to the students.”\r\n\r\nThe camp will run for two separate weeks: one week from June 9 to 13 and another from Aug. 4 to 8. Both weeks will offer a morning speech session and an afternoon debate session.\r\n\r\nFor more information regarding Palo Alto Speech and Debate Camp, go to the camp’s<a href=\"https:\/\/www.facebook.com\/pages\/Palo-Alto-Speech-and-Debate-Camp\/333938700030100\"> Facebook page <\/a>or<a href=\"https:\/\/sites.google.com\/site\/palyspeechanddebate\/\"> website<\/a>.\r\n\r\n&nbsp;","excerpt":"In hopes of increasing awareness of the Palo Alto High School Speech and Debate Program, the organizer’s of Palo Alto Speech and Debate Camp have implemented various changes to the curriculum and structure of the camp.\r\n","date":"2014-05-20 13:37:27","author":"Callie Walker","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.21.47-PM.png","categories":["Features","Spotlight"],"tags":{"10526":"anish haris","8638":"debate","19260":"palo alto speech and debate","10196":"speech","19261":"speech and debate"}},{"id":72005,"title":"Paly struggling with waste disposal","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/paly-struggling-with-waste-disposal\/","content":"Looking around Palo Alto High School’s campus, you may notice the many clusters of trash, recycling and compost bins located near classrooms and placed around the Quad. However, even with these green options available for waste disposal, Paly is struggling to properly sort its waste. Due to the misplacement of trash into the recycling and compost bins, much of what could be recycled or composted ends up in the landfill, according to the senior president of the Paly Environmental Club.\r\n\r\n“From the blue, green and black bins the recycling, compost and trash should all be streamed into the correct lanes,” senior Heather Strathearn, senior president of the Paly Environmental Club, said in an email. “This concept only fails when the bins are contaminated with waste that doesn't belong. An example of this would be a banana peel in the recycling.”\r\n\r\nCurrently, the custodial staff uses clear plastic bags inside waste containers so that custodians can visibly see what kinds of trash ends up in each container. When they see food in a bag from the recycling bin, they have to throw the entire bag into the trash because the recyclables are contaminated.\r\n\r\nAssistant Principal Jerry Berkson said that the current waste management system has been in place for three years.\r\n\r\nAccording to Berkson, the school does recycle a large amount of cardboard and paper waste collected from classrooms, but generally fails to recycle or compost waste collected in public receptacles.\r\n\r\n“It [the current system] is not working, and I don’t know if it ever will,” Berkson said. “I won’t say the custodians have given up, but … it [the trash] is so mixed that we can’t turn it in divided [into waste, recycling and compost].”\r\n\r\nThe reason why students misplace trash could be as simple as the fact that the right bins are not always in the right places, according to sophomore Eric Foster.\r\n\r\n“Usually all three bins aren’t in the same place and so I use whichever one is most convenient,” Foster said. “Even though I know it’s not a good idea, I don’t really have options. They should put all three bins everywhere.”\r\n\r\n[slideshow post_id=72005]\r\n\r\nFreshman Isabelle Doughman agreed that convenience was her biggest priority when looking for a waste receptacle.\r\n\r\n“I feel like it’s kind of hard to find trash cans,” Doughman said. “I can only find compost and recycling, and at that point I just put trash in wherever is convenient.”\r\n\r\nBerkson attributed the poorly sorted waste to a lack of attention.\r\n\r\n“I don’t think it [the problem] is that people don’t give a darn, I think it’s just that people don’t feel like thinking about it,” Berkson said. “It’s just imperfect. … The results of recycling are going to be seen 400 years from now, so people don’t see [the effects today] – they don’t get that instant satisfaction.”\r\n\r\nStrathearn also attributed the failure of many students to correctly sort their trash to lack of awareness.\r\n\r\n“I think students are not sorting their waste correctly out of convenience and ignorance,” Strathearn said. “This includes the convenience of location and convenience of thought. If someone has a banana peel but there isn't a compost nearby, they probably will not compost it.”\r\n\r\nSome people do not make conscious decisions when throwing away their waste even if compost, recycling and trash bins are easily accessible, Strathearn added.\r\n\r\n“Even when there are all three bin types present, people often choose not to sort their waste because they either don't know how to or have no motivation to,” Strathearn said.\r\n\r\nAccording to Berkson, even if most people actively sort their waste, one person misplacing their trash can ruin the system.\r\n\r\n“It’s hard… even if you have 80 percent of people buy into it [the program], you still have 20 percent of people who are contaminating these cans,” he said.\r\n\r\nStrathearn said that her club is planning an outreach campaign to educate and encourage more people to sort their waste items.\r\n\r\n“The Paly Environmental Club... is currently working on creating posters with information regarding what trash goes where,” Strathearn said. “Instead of having the usual cartoons, these posters will have real photos of typical trash Paly students have.”\r\n\r\nRecycling bins should only contain paper, glass, metal and certain plastics and electronics, according to the City of Palo Alto's Curbside Services <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/pwd\/zerowaste\/whatgoeswhere\/curbside.asp\">website<\/a>. Compost can include food scraps, yard waste and food-soiled paper. Other waste products must go into the garbage bins.\r\n\r\nBerkson agreed that outreach to the school’s students will be important in improving waste disposal. He also emphasized the importance of instructing students in the proper way to sort waste from an early age.\r\n\r\n“There’s a strong push [to educate students about the system] in elementary schools which, as kids grow up, gets stronger,\" Berkson said. \"Hopefully by the time they get here, it’s automatic.\"\r\n\r\nWhile Paly has definite room to improve in its recycling and composting rates, there are still many people who do take the time to find the correct bin.\r\n\r\n“For the most part… I do try to get my stuff in the right bin as much as possible because it’s important, you know, and I can,\" senior Jonathan Mackris said. \"It’s not like it takes a lot of time away from my day.”\r\n\r\nSenior Sarah Ohlson acknowledged the effectiveness of past outreach by Strathearn and the Environmental Club.\r\n\r\n“I’ve gone out of my way a little bit on multiple occasions to make sure I get my trash in the right bin,” Ohlson said. “It [the outreach] is definitely something that has stuck with me.”\r\n\r\nBerkson noted that, despite the issues with its waste system, the school has reduced its environmental footprint in other areas.\r\n\r\n“I think as a green place, the biggest focus is energy,” Berkson said. “They’ve done really well on energy conservation, but the recycling hasn’t really taken off.”\r\n\r\nLooking to the future, Strathearn urged students to increase their awareness of the impact they can have as individuals on the environment.\r\n\r\n“For those who have no motivation to sort their trash, I encourage them to think about the consequences of their actions,” Strathearn said. “While throwing things in the trash is better than littering, we are not only running out of space in dumps, but we are wasting valuable resources. Paly's compost and recycling potential represents a huge untapped resource to not only reduce waste, but to use waste for benefit.”\r\n\r\n[poll=\"4\"]","excerpt":"Although recycling, composting and landfill trash bins are available on campus, Paly is often failing to correctly sort its trash.","date":"2014-05-20 13:27:25","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-4.jpg","categories":["Features"],"tags":{"8520":"Berkson","19153":"compost","19156":"enivronmental club","19155":"environment","19157":"going green","19159":"landfills","8953":"paly","19152":"recycling","19158":"strathearn","19154":"trash"}},{"id":70684,"title":"Where are they now: Wes Rapaport","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/where-are-they-now-wes-rapaport\/","content":"[caption id=\"attachment_71843\" align=\"alignright\" width=\"363\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10356663_10152126547803170_1225589021_n.jpg\"><img class=\"wp-image-71843\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10356663_10152126547803170_1225589021_n.jpg\" alt=\"wes\" width=\"363\" height=\"363\" \/><\/a> Wes Rapaport directs Chapman News, the only live newscast in Orange County and produced entirely by Chapman students. Photo by Nicole Chenoweth.[\/caption]\r\n\r\nNot everyone gets to talk to <a href=\"http:\/\/www.nbclosangeles.com\/news\/sports\/He-Volleys-and-He-Knows-It-256466411.html\">Redfoo<\/a>, half of the dynamic duo LMFAO. But then again, not everyone is Wes Rapaport. This is just another day on the job for the recent Paly alumnus and arguably Paly's most successful journalism graduate. Rapaport recently completed a prestigious internship at National Broadcast Company - Los Angeles. However, it was really during his early life in Palo Alto when his journalism career ignited.\r\n\r\nRapaport, Paly Class of 2011, is a highly decorated student and journalist, winning awards including but not limited to the Very Special Person award from the Palo Alto Parent Teacher Association, the Viking Award -- the highest award Paly can grant, an Orange County Press Club Journalism Scholarship, and the Jim Zaillian Memorial Scholarship by the Radio and Television News Association.\r\n\r\nRapaport began his work in broadcast at Jane Lathrop Stanford Middle School. After watching the school morning announcements, he was intrigued and wanted to get involved. He joined the video production class, and by the time he graduated middle school, he had a basic knowledge of how television works. From there, he got involved with broadcast both in the community and at Paly. Little did Rapaport know of the future success that he would achieve in his career.\r\n\r\nAfter graduating, Rapaport joined the Chapman University Class of 2015 to pursue his passion, majoring in television and broadcast journalism. He quickly became as involved in the Chapman community as he had been at Paly. He currently works for Chapman News, holding a variety of positions over the years including Sports Director, Digital Content Director, and Executive Producer. A few of his many other involvements at Chapman include broadcasting for Chapman Radio and announcing for Chapman Athletics. He has also branched out to work with professional television networks, such as Comcast and KNBC.\r\n\r\n<em>The Paly Voice<\/em> decided to find out more about Rapaport's broadcast experiences by interviewing the man himself.\r\n\r\n<span style=\"color: #3e454c;\"><strong>The Paly Voice:<\/strong> How were you involved at the Midpeninsula Community Media Center [a public access station serving five cities in the Bay Area]? <\/span>\r\n\r\n<span style=\"color: #3e454c;\"><strong>Wes Rapaport:<\/strong> I developed my skills and met people who taught me the ins and outs of television production. My relationship with the Media Center has given me the opportunity to not only learn but mentor other students who were in my same shoes. Through the Media Center, I was able to travel to Washington, DC, for the presidential inauguration, spend a morning in the White House and even meet the current president and first lady of the United States. <\/span>\r\n\r\n<span style=\"color: #3e454c;\"><strong>TPV:<\/strong> What opportunities did you have to work in broadcast in high school?<\/span>\r\n\r\n<span style=\"color: #3e454c;\"><strong>WR:<\/strong> As a high school student, I joined up with KMVT, another local public access station, as a sideline camera operator for high school sports. I was the PA Announcer for Paly basketball, JV football, and an occasional softball or lacrosse game. I also covered dozens of football and baseball games for INfocus.<\/span>\r\n\r\n[caption id=\"attachment_72058\" align=\"alignleft\" width=\"405\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10363910_10152126558863170_563638812_n.jpg\"><img class=\"wp-image-72058\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10363910_10152126558863170_563638812_n.jpg\" alt=\"Wes Rapaport films a Paly football game in the rain. Photo by Rebecca Sanders. \" width=\"405\" height=\"228\" \/><\/a> Wes Rapaport films a Paly football game in the rain. Photo by Rebecca Sanders.[\/caption]\r\n\r\n&nbsp;\r\n\r\n<span style=\"color: #3e454c;\"><strong>TPV:<\/strong> What work did you do for INfocus? <\/span>\r\n\r\n<span style=\"color: #3e454c;\"><strong>WR:<\/strong> As executive producer of INfocus, I was responsible for leading the class and daily broadcasts. Working in that capacity gave me the chance to hone my leadership skills, as well as get a real grasp of the production side of television. You may think you know how a studio works, but you never really know until you have to find which one cable is causing the entire operation to fail. Both Mike McNulty and Ellen Austin [INfocus advisors] pushed me to the limits of my capabilities, truly allowing me to visualize the big picture of what we were trying to do with INfocus. Without them, I wouldn't be anywhere near where I am today.<\/span>\r\n<p style=\"color: #000000;\"><span style=\"color: #3e454c;\"><strong>TPV:<\/strong> Why did you decide to pursue television and broadcast journalism at Chapman University?<\/span><\/p>\r\n<p style=\"color: #000000;\"><span class=\"Apple-style-span\" style=\"color: #3e454c;\"><strong>WR:<\/strong> <\/span>I have such a strong passion for broadcast journalism, and I couldn't see myself doing anything else. So naturally, with the amazing broadcast program and facilities that Chapman has to offer, I feel right at home.<\/p>\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>Can you describe your range of experience in broadcast? <\/span>\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>WR:<\/strong> <\/span>Over the years I have developed my broadcast skills in all elements of production. From anchoring KJLS, INfocus, and Chapman News, to covering the Olympics and professional sports for KNBC, to directing and producing shows at various levels, I feel as though I've seen a little bit of everything. The education never stops, though. There's always more to learn. <\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>What has been your most exciting broadcast experience?<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span class=\"Apple-style-span\" style=\"color: #3e454c;\"><strong>WR:<\/strong> <\/span><span style=\"color: #3e454c;\">My most recent thrilling experience was being able to cover the NHL playoffs for KNBC. Few things compare to being inside a professional sports locker room. I'll also never forget my encounter with the Obamas through the Media Center. I was also incredibly proud to earn scholarships from the Orange County Press Club, and the Radio &amp; Television News Association. Winning those scholarships, to me, means a certain level of acceptance into the southern California journalism community. I'm grateful for the opportunities like these that have come my way.<\/span>\r\n\r\n[caption id=\"attachment_71959\" align=\"alignright\" width=\"236\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10356471_10152126543593170_1522017504_n.jpg\"><img class=\"wp-image-71959\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10356471_10152126543593170_1522017504_n.jpg\" alt=\"wes\" width=\"236\" height=\"315\" \/><\/a> Wes Rapaport reports from the Red Carpet of the 86th Annual Academy Awards. Photo by Roma Daravi.[\/caption]\r\n\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>Do you have a most rewarding or biggest learning broadcast moment?<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span class=\"Apple-style-span\" style=\"color: #3e454c;\"><strong>WR:<\/strong> <\/span>Last year, I covered the National Ballroom Dancing Championships for Chapman News. I didn't know the first thing about the sport, but the staff and the competitors helped teach me the basics. At one point, I was interviewing a pair of dancers from southern California. They were 12 years old, I believe. They were nervous to be on camera, and I was nervous to ask them the right questions. We had a great conversation, and their parents and I exchanged information. About two weeks later, I got an email from one of the moms, thanking me for interviewing the kids. Attached were about a dozen pictures she took during our interview. These are the moments that I work for. The fact that someone appreciated my work at the end of the day is enough for me. This also relates to my work at the Media Center. I am all about \"paying it forward.\" I want others to have great experiences in media, just as I did as a student. For me, the storytelling and experiences come far ahead of the glamour and publicity that can come with the television industry.\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>What is your favorite project you've produced so far? <\/span>\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>WR:<\/strong> <\/span>I don't think I could pick one favorite project, but I love getting to interview professional athletes. Working on projects with [Palo Alto] Mayor Sid Espinosa and Mayor Yiaway Yeh was a neat experience.<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span><\/span>What are the differences between being in front of and behind the camera?\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>WR:<\/strong> <\/span>Working in front of the camera has it's perks. People stop to ask what I'm doing all the time. That's fun sometimes. Working behind the camera is far less glamorous, but I find myself being far more attentive to everything around me. I notice all of the little things when I'm behind the scenes. It allows me to clear my mind and think about logistics. But with both, you have to be smart, and I still have some work to do on that.<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>Do you have any advice for current Paly or high school students interested in broadcast?<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>WR:<\/strong> <\/span>Get involved. The Media Center is a great place to start. Practice your writing, your camera work, develop your style— your \"brand.\" Join social media, have an online presence. Meet as many people as you possibly can. Some of my most memorable experiences have come from meeting a person at an event that develops into another project. There's a saying in TV: go out on a story, come back with three more. Email your favorite news anchor or reporter and ask to take them to coffee. Most importantly, have fun with whatever you're doing. I work in broadcast,because it's something I love. I may never make any money in it during my career, but it's my passion, so that makes it worthwhile. <\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n\r\n<span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>TPV:<\/strong> <\/span>Where do you see your broadcast career headed?<\/span>\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\"><span style=\"color: #3e454c;\"><span class=\"Apple-style-span\"><strong>WR:<\/strong> <\/span>After I get my degree, I'll be looking for a job in a small market TV station. That's where folks start, work their way up, mastering their skills, make mistakes. Eventually, the goal is to make it to a market near the top of the list — New York, Los Angeles, San Francisco, [Washington,] DC, etcetera. I plan to work as hard as I can at my job, continue to tell people's stories, pay it forward, and hopefully someone will recognize that. At some point, I'd love to earn a spot at the anchor desk, but that's a long ways away at this point.<\/span>\r\n<div style=\"color: #000000;\">\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Find out about Wes Rapaport's, arguably Paly's most successful journalism alumnus, broadcast career. ","date":"2014-05-20 13:15:28","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10356471_10152126543593170_1522017504_n1.jpg","categories":["Editor's Pick","Features"],"tags":{"14174":"broadcast journalism","14175":"chapman","11161":"media center","14173":"wes rapaport"}},{"id":72106,"title":"Slideshow: Annual Field Day a success","permalink":"http:\/\/palyvoice.com\/2014\/05\/20\/slideshow-annual-field-day-a-success\/","content":"<span style=\"color: #000000;\">Palo Alto High School’s annual field day took place today on the Quad, featuring three blow-up courses, a bungee jumping activity and free food served by the Parent Teacher Student Association.<\/span>\r\n\r\n<span style=\"color: #3e454c;\">[slideshow post_id=72106] <\/span>\r\n\r\n&nbsp;","excerpt":"Palo Alto High School’s annual field day took place today on the quad, featuring three blow-up courses, a bungee jump and free food served by the Parent Teacher Student Association.","date":"2014-05-20 13:08:05","author":"Cathy Rong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo-2-copy.jpg","categories":["Multimedia","Slideshow"],"tags":{"8704":"field day","9107":"slideshow"}},{"id":71973,"title":"Voice of the Week: Aaron Slipper","permalink":"http:\/\/palyvoice.com\/2014\/05\/19\/voice-of-the-week-aaron-slipper\/","content":"[caption id=\"attachment_72026\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/aaron.jpg\"><img class=\"wp-image-72026\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/aaron.jpg\" alt=\"Aaron Slipper is not only a devoted mathematician, but actor and Philz Coffee lover. Photo by Kate Marinkovich. \" width=\"600\" height=\"450\" \/><\/a> Aaron Slipper is not only a devoted mathematician, but also an actor and Philz Coffee lover. Photo by Kate Marinkovich.[\/caption]\r\n\r\nThis week The Paly Voice sat down with senior Aaron Slipper to talk about parallel parking, Philz Coffee and math.\r\n\r\nThe Paly Voice: Tell us about yourself.\r\n\r\nAaron Slipper: I was born on March 28, 1996. I was born with the umbilical cord wrapped around my neck. It caused strangulation temporarily. I was apparently born a rather interesting shade of blue. I was always a colorful chap. What happened apparently was that the doctor unwrapped the thing from around me. It was rather stupid of me. It was not my most intelligent move. I'm not sure if it was latent desire to stay in the womb. Let's face it, it's like a warm bath, who wouldn't? All your meals come prepared, you don't have to think, you don't have to eat, you don't even have to sleep, or maybe you are asleep. I don't even know. But I have a feeling that I didn't want to leave so I attempted to harness myself with the umbilical cord, which caused it to wrap around my neck, which was not my most intelligent move because I didn't know that I needed to breathe. I didn't know that the neck was an important part that was necessary to my respiration. I guess I'm not really to blame, but it really wasn't my most intelligent move. Most babies don't seem to have the problem of coming out of the womb quite the way that I did.\r\n\r\nTPV: Is it why you're so smart now?\r\n\r\nAS: It's probably why I'm mad.\r\n\r\nPV: What do you consider your most intelligent move?\r\n\r\nAS: My most intelligent move? I have so many bad ones. Can I tell you about my worst?\r\n\r\nPV: Sure.\r\n\r\nAS: This won't make me come off as boastfully arrogant. Well, I one time attempted to prove my intelligence to myself by riding my bicycle with my hands crossed, and I had forgotten what it was like to not know how to ride a bicycle, but I found out quite quickly. I couldn't balance myself at all. I would push one way when I meant to push the other way and very quickly, I would run myself into the ground and scrape my knee. It was not my most intelligent move, but I'm not sure if it's the worst that I ever did.\r\n\r\nPV: The worst was coming out with the umbilical cord wrapped around your neck.\r\n\r\nAS: Oh yes! What can beat that? That almost killed me from the start. Not intelligent – maybe they should give you an instruction manual down there. I could read it as I come out. <em>Birth process is a natural phenomenon, life is much more exciting on the other side, the sun shines much brighter<\/em>. That would have been excellent, but no such things exists.\r\n\r\nPV: Unfortunately.\r\n\r\nAS: Other stupid things that I've done in my life — there are many that I can speak of. Well, I once attempted to parallel park, which was a pretty poor idea. I'm not that bad a driver until I find that I need to squeeze the car into narrow spaces. I find that I take my foot off all pedals and I expect the car to move but it doesn't, so I lightly tap the accelerator and it pushes forward into the car in front of me. At which point, I slam on the brakes and put the car in reverse and lightly tap on the accelerator and I fly into the car behind me. Of course it did widen the space, but that's a little bit of a fabrication. So it was safe, but it took me about 12 maneuvers in order to get out.\r\n\r\nPV: That's not bad!\r\n\r\nAS: Is that actually a record? It was a tight space, but it was worth it because I was going to Philz Coffee.\r\n\r\nPV: Tell us about Philz Coffee.\r\n\r\nAS: Philz Coffee descends from paradise in a conduit without touching the sides.\r\n\r\nPV: That is a perfect explanation.\r\n\r\nAS: It keeps one at greater alarm than any other beverage one can find and the Philtered Soul, oh the undertones of the hazelnut. Scrumptious.\r\n\r\nPV: What about the Mint Mojitos?\r\n\r\nAS: Mint Mojitos are pretty good. I've tried everything there. And I've learned to parallel park.\r\n\r\nPV: Tell us about your high school experience.\r\n\r\nAS: This is going to get all sentimental now, but high school has been absolutely awesome. I have no complaints. High school has been to me, well I haven't had the college experience yet, but essentially the college experience. I got to know all of the teachers. I made wonderful relationships with fellow peers. I've exposed myself to lots and lots different activities that I never thought I'd do. I came to high school a determined geek, and nothing would shake me of it, but then I signed up for theater. … I figured it be quite fun but I didn't realize that I would be hooked into every single show and want to continue it as a hobby or as an additional study. It's hard to just give up theater. Theater is wonderful – it introduces me to fantastic people, a wonderful community of friends. It is of course completely egotistical to go on stage and perform in front of audience who you feel like is in the palm of your hand and you have control over. And you can forget your lines and cause the show to freeze, it's so intense. It's fantastic. Particularly doing a comedic role, when you can make the audience laugh.\r\n\r\nPV: What's your favorite show that you've been in?\r\n\r\nAS: That's a toughie. I think it would have to be \"Twelfth Night.\" It was just so much fun.\r\n\r\nPV: Who did you play?\r\n\r\nAS: I played Malvolio. … We did it as a romp. We did it only comedically, which allowed me to make the hammiest performance of my lifetime and it was just wonderful. Everything one could want to do. I got to pull disgusting faces, manifest all my chins.\r\n\r\nPV: Tell me about math. You like math?\r\n\r\nAS: Math is pure beauty.\r\n\r\nPV: Better than Philz?\r\n\r\nAS: Yes. As much as it pains me, I have to say so. And that's not just because I have to parallel park. Thought experiment time: in the natural world, how often do you see a perfect circle?\r\n\r\nPV: Not often.\r\n\r\nAS: Almost never! … The only perfect lines you find in nature are the horizon, and of course the sea all the waves go off into the distance and form a nice line, and light beams. But you can’t see beams of light generally. … Why is it that humans in the man-made world have taken from nature only those perfect things? Why have we taken them? The answer in my opinion is fundamentally math as an aesthetic art. Math is an art, really. Math is the art of taking the most beautiful things in the world and making them perfect.\r\n\r\nPV: So you're off to Harvard next year. Are you excited?\r\n\r\nAS: I am indeed, I am very excited. I am absolutely ecstatic.\r\n\r\nPV: What are your final words to the Paly community?\r\n\r\nAS: A profound thank you. It's been wonderful, and I'll miss you tremendously.\r\n\r\n<em>If you know a student (or student group) who you think should be interviewed, please leave a comment below.<\/em>","excerpt":"This week The Paly Voice sat down with senior Aaron Slipper to talk about parallel parking, Philz Coffee and math.","date":"2014-05-19 13:52:41","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/10370733_10203105276248352_1451626143_n.jpg","categories":["Spotlight","Voice of the Week"],"tags":{"19301":"aaron slipper","8822":"kate marinkovich","19302":"lydia barry","8953":"paly","10258":"voice of the week"}},{"id":72150,"title":"Mandatory meeting for incoming AP Lit students at lunch on May 19 in the ERC","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/mandatory-meeting-for-incoming-ap-lit-students-at-lunch-in-the-erc-on-may-19\/","content":"","excerpt":"","date":"2014-05-18 13:24:58","author":"Charles Yu","categories":["Ticker"],"tags":[]},{"id":72148,"title":"Senior baccalaureate on May 25 at the Flint Center in Cupertino","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/senior-baccalaureate-on-may-25-at-the-flint-center-in-cupertino\/","content":"","excerpt":"","date":"2014-05-18 13:20:20","author":"Lizzie Chun","categories":["Ticker"],"tags":{"19372":"baccalaureate","19373":"flint center","9090":"seniors"}},{"id":72146,"title":"Mandatory meeting for Link Crew applicants at lunch on May 21 in the ERC","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/mandatory-meeting-for-link-crew-applicants-at-lunch-on-may-21-in-the-erc\/","content":"","excerpt":"","date":"2014-05-18 12:37:57","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8852":"Link Crew"}},{"id":71978,"title":"Boys&#8217; lacrosse season ends in 11-10 loss to M-A in SCVAL semifinal","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/boys-lacrosse-season-ends-in-11-10-loss-to-m-a-in-scval-semifinal\/","content":"[caption id=\"attachment_72088\" align=\"alignnone\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5144.jpg\"><img class=\"wp-image-72088\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5144.jpg\" alt=\"IMG_5144\" width=\"767\" height=\"511\" \/><\/a> Senior midfielder Jordan Gans sprints down the field alongside a Menlo-Atherton player during Wednesday's Santa Clara Valley Athletic League semifinal. The Vikings lost the game 11-10, ending their season. Photo by Addie McNamara.[\/caption]\r\n\r\nDespite a strong showing in the first quarter of the game, the Palo Alto High School boys' lacrosse team (13-7, 9-5) was unable to fend off a comeback from the Menlo-Atherton (13-11, 9-5) Bears in the Santa Clara Valley Athletic League semifinal on Wednesday, resulting in a 11-10 loss for the Vikings and an end to the team's season.\r\n\r\nThe Vikings pulled ahead quickly at the start of the game, with a 4-0 lead by the end of the first quarter. In the second quarter, however, M-A began its comeback, with the Vikings still leading 6-5 at half-time but reaching a 9-9 tie at the end of the third quarter.\r\n\r\n\"We came out unbelievably strong in the first quarter and fell apart in the second quarter,\" Paly coach DJ Shelton said.\r\n\r\nSenior midfielder Jordan Gans, who scored five goals for the Vikings throughout the game, echoed Shelton's sentiment that the second quarter was a turning point in the game.\r\n\r\n\"Second quarter is where we fell apart and they came back twice in the second and third quarter,\" Gans said. \"That's where we broke down and lost the game.\"\r\n\r\nIn the final quarter, M-A pulled ahead with two more goals, compared to Paly's one, ending the game 11-10 for M-A.\r\n\r\nAccording to Shelton, Paly lacked energy in the second half of the game.\r\n\r\n\"Second half was just kind of playing catch-up, not necessarily with the score but with random swings of energy,\" Shelton said. \"They definitely took it from us and we were just clawing our way back.\"\r\n\r\nPreviously, Paly had beaten M-A on two separate occasions throughout the season, and both Gans and Shelton attributed this game's loss to inadequate execution.\r\n\r\n\"We just had a couple of problems executing at the end,\" Shelton said. \"Everyone in this game had issues with consistency.\"\r\n\r\nHad it not been for lack of consistency, Gans said he feels that the team certainly had the strength to win the game.\r\n\r\n\"Everybody played really hard,\" Gans said. \"It wasn't a lack of effort, it was just a lack of execution. We could've won that game.\"\r\n\r\nThe loss marks the end of the Vikings' season, a disappointment for the team, according to Gans.\r\n\r\n\"It's really tough,\" Gans said. \"It was really disappointing. ... I would've loved to have played in the championship.\"\r\n\r\nShelton said the loss was not a result of any individual team member.\r\n\r\n\"This isn't a game about individuals,\" Shelton said. \"You win as a team and you lose as a team.\"","excerpt":"Despite a strong showing in the first quarter of the game, the Palo Alto High School boys' lacrosse team (13-7, 9-5) was unable to fend off a comeback from the Menlo-Atherton (13-11, 9-5) Bears in the Santa Clara Valley Athletic League semifinal on Wednesday, resulting in a 11-10 loss for the Vikings and an end to the team's season.","date":"2014-05-18 10:06:16","author":"Addie McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_51441.jpg","categories":["Sports","Spotlight"],"tags":{"12015":"boys lacrosse","19371":"DJ Shelton","8811":"jordan gans","8836":"Lacrosse","10306":"menlo-atherton","9078":"scval"}}]