[{"id":70905,"title":"Five fun tricks to combat senioritis","permalink":"http:\/\/palyvoice.com\/2014\/05\/06\/five-fun-tricks-to-combat-senioritis\/","content":"[caption id=\"attachment_71249\" align=\"alignnone\" width=\"526\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg\"><img class=\"wp-image-71249\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg\" alt=\"Symptoms of senioritis may include spending excessive amounts of time playing 2048 instead of studying for Advanced Placement Psychology. Photo by Gavin Libbey.\" width=\"526\" height=\"394\" \/><\/a> Symptoms of senioritis may include spending excessive amounts of time playing 2048 instead of studying for Advanced Placement Psychology. Photo by Gavin Libbey.[\/caption]\r\n\r\nWith less than a month until graduation, who <em>really<\/em> wants to study for that calculus test second period tomorrow? As wave after wave of senioritis sweeps the school it doesn't seem so ridiculous to ditch sixth period to go to the beach or take the train up to the city. After all, you're in college, so there's nothing to worry about, right?\r\n\r\nWell, maybe.\r\n\r\nIf you're like me and falling off the academic bandwagon possibly a little <em>too<\/em> hard, check out these super fun tips and tricks to hold your senioritis at bay because, hey, nobody likes being rescinded.\r\n\r\nTIP NUMBER ONE: Study outside. Next time you're headed to the park to work on your tan, grab a textbook on your way out the door. Got a 5th period prep? Head out to the Quad with some homework. Now you can work on that summer glow AND learn about biology. Multi-tasking at its finest.\r\n\r\nTIP NUMBER TWO: Make a calendar for yourself. Sure, maybe you're headed to Santa Cruz Wednesday afternoon, but that's no reason you shouldn't do your Spanish homework on Thursday. If you set aside time to work and time for fun, you'll feel a lot less guilty about slacking off one day if you know you'll have time to write that essay the next.\r\n\r\nTIP NUMBER THREE: Reward yourself for being productive. That may mean a Chipotle run, a fresh batch of chocolate-chip cookies or a new pair of shoes, whatever works for you. Maybe reviewing for a quiz means a scoop of ice cream while finally turning in that eight page paper merits a whole banana split.\r\n\r\nTIP NUMBER FOUR: Find a study buddy. Work is more fun with friends, everyone knows that. Pretty soon you'll be looking at each AB Calc review assignment as an excuse to hang out with that cute boy who sits across the room from you, and who doesn't want that?\r\n\r\nTIP NUMBER FIVE: Everything in moderation. For some people, senioritis is partying six nights a week, while for others symptoms include nine hour long Netflix marathons. Try cutting that in half (three parties a week is nothing to shake a stick at...) and spend all your new free time catching up on those 80 pages of AP English reading.\r\n\r\nSo go ahead, skip 3rd period tomorrow, and the next day and the day after that. But really, with four weeks left of school make sure to drop by Paly at least once or twice before graduation.","excerpt":"Check out these super fun tips and tricks to hold your senioritis at bay because, hey, nobody likes being rescinded.","date":"2014-05-06 22:01:46","author":"Paige Esterly","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg","categories":["Opinion"],"tags":[]},{"id":71416,"title":"Paly student hit by car on route to school","permalink":"http:\/\/palyvoice.com\/2014\/05\/06\/paly-student-hit-by-car-on-route-to-school\/","content":"A Palo Alto High School student was hit by a car around 8:15 a.m. on route to campus this morning at the intersection of Churchill Avenue and Castilleja Avenue.\r\n\r\n<span class=\"Apple-style-span\">According to an email sent out after the incident by Dean of Students Craig Tuana to Paly faculty, the student, whose injuries were not serious, was taken to the hospital by her parents as a precaution.<\/span>\r\n\r\n[caption id=\"attachment_71458\" align=\"alignright\" width=\"476\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg\"><img class=\"wp-image-71458\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg\" alt=\"The intersection of Churchill Avenue and Castilleja Avenue during hours while students are in class. Photo by Kate Marinkovich.\" width=\"476\" height=\"357\" \/><\/a> The intersection of Churchill Avenue and Castilleja Avenue is known for its lack of traffic lights and stop signs. Photo by Kate Marinkovich.[\/caption]\r\n\r\nFreshman Steven Marinkovich was at the intersection at the time of the incident.\r\n\r\n\"I got out of my car with my sister and I heard a car hit something,\" Marinkovich said. \"I turned around and saw the girl fall onto the ground and saw her laying there for awhile.\"\r\n\r\nFreshman Louie Marzano also saw the incident while he was biking to school.\r\n\r\n\"I ... saw a bunch of cars lined up on Churchill and a girl lying on the ground,\"  Marzano said. \"[There was] a lot of commotion, people on the phone. The girl was crying – she had her hand on her head.\"\r\n\r\nThe intersection is recognized as an unsafe area for students and other commuters during busy hours, according to Marinkovich.\r\n\r\n\"I felt bad for her but wasn't surprised somebody eventually got hit in that intersection,\" he said.\r\n\r\nIn 2010, traffic lights were added to the Embarcadero Road crosswalk, a similar location for Paly parking traffic that provides access to Paly from three directions. Some students feel as though a traffic light system should be added to the Churchill Avenue and Castilleja Avenue crossing as well.\r\n\r\n\"A traffic light system should be added because if the pedestrians know that it's their right of way, then they will be more confident in crossing,\" junior Savannah Feriante said. \"Drivers will be sure of the pedestrian actions because they will be following light signals rather than intuition.\"","excerpt":"A Palo Alto High School student was hit by a car around 8:15 a.m. on route to campus this morning at the intersection of Churchill Avenue and Castilleja Avenue.","date":"2014-05-06 20:22:51","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg","categories":["News","Spotlight"],"tags":{"8453":"accident","9672":"car","17668":"churchill","8953":"paly","17670":"safety","9129":"student","17669":"traffic"}},{"id":70912,"title":"Baseball Season Update: Vikings confident for playoffs","permalink":"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/","content":"[caption id=\"attachment_49426\" align=\"alignnone\" width=\"900\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/02\/mce_022013_0024.jpg\"><img class=\"size-full wp-image-49426\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/02\/mce_022013_0024.jpg\" alt=\"Starting pitcher Chris Smith throws a fastball in the first inning of Paly's 9-3 season opener loss to St. Ignatius last year.  Photo by Matt Ersted.\" width=\"900\" height=\"600\" \/><\/a> Starting pitcher Chris Smith throws a fastball in the first inning of Paly's 9-3 season opener loss to St. Ignatius last year. Photo by Matt Ersted.[\/caption]\r\n\r\nAfter falling short of a league title this year, the Palo Alto High School baseball team (13-12) looks forward to making a run in the upcoming Santa Clara Valley Athletic League and Central Coast Section playoffs.\r\n\r\nThe Vikings will open the SCVAL playoffs on Tuesday at Wilcox High School.\r\n\r\n\"We have had some stumbles along the way, but we are hoping to finish strong,\" senior outfielder Bowen Gerould said.  \"We need to play well as a team in playoffs to beat some of the solid teams that we will face.\"\r\n\r\nSo far, strong pitching has led the team to a successful season, finishing third in league, according to senior second basemen Anthony Lim.\r\n\r\n\"Our pitching so far has been really good and consistent,\" Lim said.  \"Our hitting over the past couple of games needs some work.\"\r\n\r\nWhile the Vikings' pitching continues to be successful, other areas leave room for improvement, according to senior third baseman Noah Phillips.\r\n\r\n\"All of our pitchers are throwing strikes, and we are doing a good job playing strong defense behind them,\" Phillips said.  \"We can improve a little on our offensive execution - bunting and base-running especially.  Those things might end up being the difference in a game, especially down the stretch.\"\r\n\r\nGerould agrees that the offense needs to step it up in the coming games.\r\n\r\n\"All of us need to hit better as a whole,\" Gerould said.  \"We need to improve on getting guys home once we get them on base.\"\r\n\r\nThe Vikings finished third in the De Anza League,  and are hoping to be placed in the open division for CCS playoffs, according to Phillips.\r\n\r\n\"We all think we can make a deep run,\" Phillips said.\r\n\r\nOverall, Lim agrees that the Vikings will be able to pull together and make a run in league and CCS playoffs.\r\n\r\n\"The team is bonding well,\" Lim said.  \"We have a very tightly knit group.\"\r\n\r\nSenior ace Chris Smith will likely take the mound as the Vikings opening playoff game takes place at 4 p.m. on Tuesday at the Wilcox baseball field.","excerpt":"After falling short of a league title this year, the Palo Alto High School baseball team (13-12) looks forward to making a run in the upcoming <a href=\"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-05 22:41:28","author":"Jared Schwartz","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/chris-smith.jpg","categories":["Sports"],"tags":{"15103":"anthony lim","8410":"Baseball","15102":"bowen gerould","15104":"noah phillips","8944":"palo alto high school","15100":"paly baseball","15101":"season update"}},{"id":71115,"title":"How to prepare for AP testing","permalink":"http:\/\/palyvoice.com\/2014\/05\/04\/how-to-prepare-for-ap-testing\/","content":"[caption id=\"attachment_71126\" align=\"alignnone\" width=\"634\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png\"><img class=\"size-full wp-image-71126\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png\" alt=\"Staff writers Becca Raffel and Jared Schwartz demonstrate perfect AP testing preparation. \" width=\"634\" height=\"477\" \/><\/a> Staff writers Becca Raffel and Jared Schwartz demonstrate perfect AP testing preparation. Photo by Callie Walker.[\/caption]\r\n\r\nWith Advanced Placement tests are right around the corner, many Palo Alto High School juniors are likely wondering how they should prepare for their first round of AP testing. Having taken AP tests last year, the Voice's own Jared Schwartz and Becca Raffel offer their two cents on advice to prepare, and several other seniors as well as AP U.S. History teacher Jack Bungarden join the conversation.\r\n\r\nFirst of all, many people greatly overestimate the need to frantically prepare for these examinations, and they forget one crucial element: they have been preparing for the exam all year.\r\n\r\nWhy did you read every chapter of <em>American Pageant<\/em>? And learn how to use a voice recorder in Spanish? And diligently participate in all the biology labs?\r\n\r\nThe fact of the matter is, AP tests are made to reflect what you have learned all year, not how much content you can cover in the next few days. Staying focused all year is crucial to success on the tests, according to senior Sarah Ohlson.\r\n\r\n\"Your teachers prepared you well throughout the year and as long as you stayed focused first semester you will do well second semester,\" Ohlson said.\r\n\r\nDon't get us wrong – a little spot review on areas that you might have forgotten is a great plan, but there is no need to go overboard with it. AP U.S. History teacher Jack Bungarden addresses the importance of reviewing.\r\n\r\n\"Study,\" Bungarden said. \"Go to review sessions, review your notes, go back and look at class materials, review the stuff you learned back in first semester.  Take some practice exams.\"\r\n\r\nPurchasing an AP practice booklet can also be beneficial, according to senior Jack Shapiro.\r\n\r\n\"It's really important to buy an AP test prep book if you can,\" Shapiro said. \"They have lots of tips on what problems you'll find and face and what you should review.  It's definitely worth it to get one to at least practice.\"\r\n\r\nAnother aspect of AP testing that is overlooked is the huge curve on the test. Depending on what AP class you're in, chances are that you have been taking simulated AP tests all year and have been receiving your raw grades on them. On the AP test, that C you have could turn into a 5.\r\n\r\n<em>Three suggested steps to dominating the test:<\/em>\r\n\r\n1. Pick out the topics that you have struggled with or haven't seen in a while. Make flashcards or have a friend explain them to you.\r\n\r\n2. Briefly skim over all the other material to remind yourself how much you know.\r\n\r\n3. Relax, get a good night's sleep and enter the test with confidence! \"Always choose sleep over study,\" senior Anthony Lim said.\r\n\r\nAll in all, we would like to stress the importance of not stressing about the tests. Sure, do some review and make sure you know your stuff, but getting worked up about the tests is neither necessary nor beneficial.\r\n\r\n\"Take it easy and relax about it, it's not a big deal,\" senior Jonathan Mackris said. \"Paly prepares you well for the AP's.\"","excerpt":"With Advanced Placement tests are right around the corner, many Palo Alto High School juniors are likely wondering how they should prepare for their first <a href=\"http:\/\/palyvoice.com\/2014\/05\/04\/how-to-prepare-for-ap-testing\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-04 21:21:50","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png","categories":["Opinion"],"tags":[]},{"id":71319,"title":"One Acts showcase humor, drama, talent of Theater program","permalink":"http:\/\/palyvoice.com\/2014\/05\/02\/one-acts-showcase-humor-drama-talent-of-theater-program\/","content":"[caption id=\"attachment_71329\" align=\"alignleft\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo.jpg\"><img class=\"size-full wp-image-71329\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo.jpg\" alt=\"The Theater program's One Acts this year include three original scripts written by Paly students, two adapted scripts, and an improvisational performance. There are two more shows on Friday May 2 and Saturday May 3. Tickets are $5. \" width=\"600\" height=\"450\" \/><\/a> The Palo Alto High School Theater program's One Acts this year include three original scripts written by Paly students, two adapted scripts and an improvisational performance. There are two more shows on Friday May 2 and Saturday May 3. Tickets are $5. Photo by Gavin Libbey[\/caption]\r\n\r\nThe annual Palo Alto High School Theater class's One Acts plays allow the program to showcase its students' skills in acting, writing and directing for the stage. After a successful first show, this year's series of short performances have proven once again to be a fun and amusing with a diverse lineup.\r\n\r\nThe One Acts showcase is the Theater program's last show of the school year and consists of several short plays acted, directed and, in some cases, written by Paly Theater students. Compared to the bigger productions put on earlier in the year, the One Acts performances are quaint and simple, but that is what gives them their charm. Besides, those descriptions probably don't do justice to all the time and work spent on the plays, which makes them even more impressive.\r\n\r\nThis year's lineup includes three original plays written by Paly students, two adapted scripts and a performance by the Paly Improv Troupe.\r\n\r\nThe Improv Troupe, led by senior Marcus Edholm, starts the night off with two rounds of \"foursquare.\" The improv game has four performers organize themselves in a square and rotate at the order of an outside leader. The duo facing the audience starts a scene with each other, but when the leader orders them to rotate, the scene is paused and the new duo starts a different scenario. All the scenes must include a key word given by the audience and must persist between similar duos.\r\n\r\nThe four rapidly-changing stories can get wild and bizarre, but make for some great spontaneous laughs. As with all improv acts there were hits and misses, but the actors stuck to their scenes and characters regardless of whatever strange tangent their partner sent them on, and I enjoyed watching their impromptu stories develop on the spot.\r\n\r\nThe first written performance is \"Tell Me a Story,\" written by senior Curtis Wu and directed by Edholm. In it, sophomore Paul Bleich's stressed and caffeine-addicted character Chris calls upon his cooler, smarter friend Jake, played by sophomore Ophir Sneh, to help him with his Psychology course thesis by having him tell Chris three stories to psychoanalyze despite not having three real cases to study.\r\n\r\nHowever, whenever Jake begins a story, the focus shifts to a different scene about a man named Mark, played by junior Guive Assadi, actually being psychoanalyzed by his psychologist Joan, played by sophomore Adele Bloch. Mark then tells the story, and the play once again shifts to Sneh acting as the characters Assadi describes. The result is interestingly meta and works as a fantastic way to study characters and personas. My only complaint is that it ended so soon because it would have only improved with more time.\r\n\r\nThe next play, \"Doors,\" is written by sophomore Charlotte Moffat and directed by junior Sabrina Sonner. The story follows a librarian named Cora, played by junior Riley Cassidy, who has a strange encounter in her quiet, unassuming workplace. A mysterious reoccurring figure, played by freshman Erin Reynolds, claims to be Janus, the Roman god of doors, endings and transitions. The events of the play are rather simple, mostly consisting of Cora's interactions with Janus and her interpretations of them being bounced off her friend, but the conclusion takes a turn for the confusing and intriguing. I don't think I got it entirely, but its crypticness is what made this play special.\r\n\r\n\"Sure Thing\" is the first adapted script of the night, written by David Ives and directed by freshman Jason Pollak. The premise is simple: Bill, played by junior Will Kast, attempts to court junior Madison Mignola's character Betsy, who is reading a book alone in a cafe. Every time either one of them screws up or says something awkward, a girl with an assortment of loud instruments, played by freshman Leanne Miron, interjects with a noise and resets the scene at Bill's last successful chatting point.\r\n\r\nIt's a hilarious script, with plenty of clever gags and a neat, fast pacing. The three actors nailed the timing of their lines and cues, undoubtedly with the help of their director. \"Sure Thing\" could have gone poorly very easily, but the dedication to precision and accuracy was what made this adaptation so much fun to watch and my favorite play of the night.\r\n\r\nAfter an intermission, it's time for the next adapted script \"The Six of Calais.\" Written by George Bernard Shaw and directed by senior Aaron Slipper, this play tells the story of the Burghers of Calais (immortalized and exhibited on the Stanford campus by master sculptor Auguste Rodin). The Burghers were six town elders of the French hold Calais, who sacrificed themselves to the English King Edward III, played by freshman Johnny Rohrbach, for the safety of their city.\r\n\r\nIt's the longest and biggest play of the night, with a cast of twelve and two Medieval-style war tents flanking the stage. The play is surprisingly humorous for an event typically depicted as somber. Slipper did do the event some dramatic justice throughout his adaptation, especially during the scenes between King Edward and the more defiant Burghers. The only big issue was the projector, which displayed slides of semi-related pieces of art throughout the play. It felt unnecessary and distracting when it overshadowed the performers.\r\n\r\nThe last performance is \"Foul Play,\" written by senior Dashiel Grusky and directed by sophomore Molly Kraus. It's the most tongue-in-cheek script by far, telling the story of a county fair's best-in-show competition for donkeys. Ryan, played by junior Ido Gal, loves his perfect donkey Harold, played by freshman Joey Kellison-Linn, but despises his business associate Rosemary, played by senior Aida Goma-Petite. They have to work together in the most convoluted way possible to defeat Ryan's rival and his schemes involving a parrot. I still don't quite get how a parrot could pass as a donkey and vice versa, but it's the fact that all the characters understand this as a seemingly typical thing that makes it humorous. It was a silly, fun way to end the night.\r\n\r\nThe variety and talent in all the plays is impressive and speaks to the strength of Paly's Theater program and its members. The quick bursts of drama, comedy and intrigue kept me entertained throughout, and it was easily worth the easy two hours it ran for.\r\n\r\nOne Acts are playing again Friday May 2 and Saturday May 3 at 7:30 p.m. in the Haymarket Theater. Tickets cost $5 for students and $7 for adults.","excerpt":"The final show of the year put on by the Palo Alto High School theater program is an impressive display of writing and acting by Paly students and is something everyone and anyone can enjoy. ","date":"2014-05-02 18:15:10","author":"Gavin Libbey","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo.jpg","categories":["Entertainment","Spotlight"],"tags":{"8456":"acting","17493":"doors","8654":"drama","17496":"foul play","17491":"foursquare","8758":"haymarket","17489":"one acts","17490":"plays","17494":"sure thing","17492":"tell me a story","17495":"the six of calais","9159":"theater","9160":"theatre"}},{"id":71268,"title":"Annual YCS food drive meets goal","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/annual-ycs-food-drive-meets-goal\/","content":"[caption id=\"attachment_71307\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/882321_386319028176767_1639367332967763652_o-11.jpg\"><img class=\"size-full wp-image-71307\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/882321_386319028176767_1639367332967763652_o-11.jpg\" alt=\"YCS-Interact loads non-perishable food items into a truck. The goods will be donated to Neighbors Helping Neighbors. Photo provided by Kate Musen.\" width=\"400\" height=\"400\" \/><\/a> YCS-Interact loads non-perishable food items into a truck. The goods will be donated to Neighbors Helping Neighbors. Photo provided by Kate Musen.[\/caption]\r\n\r\nThe Palo Alto High School Youth Community Service-Interact Club has announced the winners of its annual food drive after collecting over 700 food items over a period of two weeks.\r\n\r\nThe food drive was a competition between third period classes, where points were awarded based on the number of non-perishable food items that students brought to class.\r\n\r\nThe winners of the food drive, from first to third place, were the classes of Caitlyn Evan, Matt Hall and Kari Snell. First place received a pizza party, second place was awarded donuts and third place earned chocolate bars.\r\n\r\nSenior YCS-Interact President Kate Musen said the food items, which included canned tomatoes, canned tomato sauce, canned beans, whole grain cereal, whole grain pasta and pancake mixes, will be given to the Palo Alto charity organization Neighbors Helping Neighbors.\r\n\r\n“We were very excited by our results this year,” Musen said. “We don’t know the exact weight of the items this year … but from we see, we believe that this may have been one of our biggest and most successful drives yet.”\r\n\r\nAccording to Musen, Neighbors Helping Neighbors is a program that provides groceries to people in need who otherwise do not qualify for welfare programs that give food.\r\n\r\n“Neighbors Helping Neighbors provides food primarily to Palo Alto families, so we appreciate the opportunity to help those within our own community,” Musen said. “Living in the Palo Alto ‘bubble,’ there’s a tendency to forget that there are a lot of families in need within our own borders.”\r\n\r\nIn the past, the food drive has been hosted in the fall, but the club decided to space out their charity projects after having a clothing drive during Spirit Week.\r\n\r\nMusen noted the importance of consistently providing assistance to those in need.\r\n\r\n“A lot of other organizations host food drives during the holidays,” Musen said. “But low-income families need food year round.”\r\n\r\n&nbsp;\r\n\r\n<i><a title=\"Author: Emma Chiu\" href=\"http:\/\/palyvoice.com\/author\/emchiu\/\">Emma Chiu<\/a> contributed to this story<\/i>","excerpt":"The Palo Alto High School Youth Community Service-Interact Club has announced the winners of its annual food drive after collecting over 700 food items over a period of two weeks.","date":"2014-05-01 21:20:30","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/882321_386319028176767_1639367332967763652_o-11.jpg","categories":["News"],"tags":[]},{"id":71311,"title":"Girls’ lacrosse settles the score after beating Gunn in rematch","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/girls-lacrosse-settles-the-score-after-beating-gunn-in-rematch\/","content":"[caption id=\"attachment_70284\" align=\"alignleft\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/917.jpg\"><img class=\"wp-image-70284\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/917.jpg\" alt=\"Junior midfielder Allie Peery deflects a blocking attempt by a Gunn defender in the first Gunn-Paly faceoff of this season's league play. Photo by Maddy Jones.\" width=\"400\" height=\"268\" \/><\/a> Junior midfielder Allie Peery deflects a blocking attempt by a Gunn defender in the first Gunn-Paly faceoff of this season's league play on Friday, March 28. Photo by Maddy Jones.[\/caption]\r\n\r\nThe Palo Alto High School girls’ lacrosse team (10-4, 9-1) earned redemption after beating the Gunn High School Titans (12-2, 9-1) in a hard-fought match, 10-9, Wednesday at Paly.\r\n\r\nThe Vikings are now sitting in third place in the Santa Clara Valley Athletic League, while Gunn still holds on to first place.\r\n\r\nDespite the Titans scoring the first two goals of the game, Paly was able to strike back quickly with a goal from sophomore midfielder Maya Benatar, which gave momentum to the Viking offense. Both halfs of the game were toughly contested, with the difference in goals never passing two. While Gunn threatened Paly with fast breaks, the Viking defense stayed patient and blocked several opportunities for a Titan advantage.\r\n\r\nThe cross-town match brought a level of physical aggression that caused both teams to give up key goals due to fouls. Paly senior midfielder Kristen DeStefano scored the last goal of the first half after a Gunn player illegally checked her, resulting in her being sent off of the field with a yellow card.\r\n\r\nWhile defense was a highly emphasised component of this match, both teams excelled offensively, with Titan captain Victoria Nguyen scoring one-third (three) of their goals. Viking junior midfielder Paige Bara responded by scoring an impressive four goals, one of which gave Paly their tenth and winning goal.\r\n\r\nWhile Paly finished the first half with a lead of 7-5, Gunn came back in the 2nd, tying it up 8-8 with 15 minutes to go. During these first 10 minutes, the Titans displayed their athleticism as they pivoted and sprinted with great endurance across the field, waiting for an opening in the Paly defense. Viking sophomore goalie Meredith Kinnaman successfully blocked earlier attempts by the Titan offense, but Gunn’s patience was eventually rewarded, bringing the score to 8-8.\r\n\r\nPaly, determined to put an end to Gunn’s comeback, attentively watched as the Titan’s offense advanced. Gunn midfielders walked back and forth across the field, seemingly taunting the Vikings to make the first move. Paly intercepted the ball and brought it down the field where junior attacker Lauren Gargiulo scored, putting the Vikings back on top.\r\n\r\nIt was apparent that as time on the clock decreased, the intensity increased, as players of both teams desperately fought for possession of the ball. Gunn gained control and in fast break made their way towards the goal, only to be met with fierce opposition by the Viking defense. Almost mechanically, the Gunn offense reset, returning to their style of patience. Gunn midfielder Annie Vesey saw her chance and struck, pivoting and spinning she executed a powerful shot and scored.\r\n\r\n“I was in the moment, it was all instinct,” Vesey said. “All I was thinking was maybe we can win this.”\r\n\r\nThe Viking defense held-off the last attempts of a determined Titan line-up, earning redemption for their loss to Gunn in March.\r\n\r\n“We were not prepared for Gunn’s skills in the first game. This time we knew how they played,” Bara said. “I think we just came into the game with the right mindset and did a much better job communicating on defense.”\r\n\r\nEven though the Vikings walked away with a victory, Coach Jamie Nesbitt is already looking for ways they can improve.\r\n\r\n“There are a lot of areas for improvement,” Nesbitt said. “I think for us, in close games, it comes down to little things like the defensive presence at the end and the urgency to get the ball to the attacking end.”\r\n\r\nThe Vikings’ next game is against Saint Francis High School (10-3, 9-1) at 7 p.m. Friday night at Palo Alto High School.","excerpt":"The Palo Alto High School girls’ lacrosse team (10-4, 9-1) earned redemption after beating the Gunn High School Titans (12-2, 9-1) in a hard-fought match, 10-9, Wednesday at Paly. ","date":"2014-05-01 21:01:14","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/917.jpg","categories":["Sports","Sports Recap"],"tags":{"17487":"cross town","8734":"girls","8751":"gunn","8836":"Lacrosse","8953":"paly","17488":"rival","9165":"titans","9210":"vikings"}},{"id":71017,"title":"Swimming towards CCS","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/swimming-towards-ccs\/","content":"As the swim season comes to a strong close, the Palo Alto High School swim team will compete against Gunn High School at 4 p.m. today at Gunn.\r\n\r\nAfter coming off a Thursday win against Los Gatos for the boys' team and a loss for the girls', both of the teams look to score well at the Central Coast Section Championships.\r\n\r\nPaly senior and swim co-captain Caroline Moser admits that although the team is relatively young compared to previous years, it has been performing well.\r\n\r\n[caption id=\"attachment_54515\" align=\"alignright\" width=\"436\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg\"><img class=\" wp-image-54515\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg\" alt=\"Paly Boy's swimming pose with each other after winning second at CCS in 2013. Photo by Sam Kelley.\" width=\"436\" height=\"325\" \/><\/a> Paly Boys swimming pose with each other after winning second at CCS in 2013. Kevin Bowers, Ethan Look, Alex Francis, Bo Fields, Andrew Liang, Andrew Cho, Willy Lee, Omri Newman and Bret Pinksker are all smiles after the victory. Photo by Sam Kelley.[\/caption]\r\n\r\n\"<span class=\"Apple-style-span\" style=\"color: #3e454c;\">The final score was 94-92, with Los Gatos taking the win, but our freshmen and sophomore class has really stepped up this season in both leadership and work ethic,\" Moser said. <\/span>\r\n\r\nSenior and co-captain for boys swimming, Omri Newman, is happy with his team's performance and development.\r\n\r\n\"I think the major improvement from last season in my opinion is the work ethic and morale of the team,\" Newman said. \"It's clear that the guys care about what we are trying to accomplish, and everyone has set goals they are working for.\"\r\n\r\nThe team's first meet, which was the Spring Invite held back in March, helped show off the Vikings' potential. The boys' team beat Saint Francis, 216-180, and the girls fell to Monta Vista 177-154.\r\n\r\nBoth Moser and Newman agree that their coach Danny Dye has stepped up and showed commitment to both teams.\r\n\r\n\"He has performed as expected but also has improved as a coach,\" Newman said. \"He talks about evolving with the team, and I feel he has been putting an effort in doing so, as well as succeeding in it.\"\r\n\r\n<span style=\"color: #3e454c;\">\"I've been with Danny for four years and this is the first time I've seen him fully involved with our team,\" Moser said. \"We even did a team bonding event with him.\"<\/span>\r\n\r\nEarlier in the season, the Paly team gained confidence when the boys beat defending CCS champions Monta Vista and the girls' team placed in second.\r\n\r\n\"The girls still feel positive about their meet and their chance to win the league championship come the end of the year,\" Dye reflected in a <a href=\"http:\/\/www.palyswim.com\/2014\/03\/boys-improve-to-4-0-while-the-girls-go-to-3-1-against-monta-vista\/\">blog post<\/a> after the meet.\r\n\r\n&nbsp;","excerpt":"As the swim season comes to a strong close, the Palo Alto High School swim team will compete against Gunn High School at 4 p.m. today at Gunn.","date":"2014-05-01 18:55:20","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg","categories":["Sports","Sports Recap"],"tags":{"15679":"alex francis","15680":"andrew cho","11364":"andrew liang","15683":"bo fields","15682":"brett pinsker","15678":"ethan look","15677":"kevin bowers","8923":"Omri Newman","8944":"palo alto high school","15610":"paly swimming","9120":"sports","9143":"Swimming","15681":"willy lee"}},{"id":71016,"title":"May Fete Parade to march through Palo Alto","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/may-fete-parade-to-march-through-palo-alto\/","content":"[caption id=\"attachment_71277\" align=\"alignright\" width=\"375\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-1.56.43-PM.png\"><img class=\"wp-image-71277\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-1.56.43-PM.png\" alt=\"The annual May Fete Parade will be held on Saturday from downtown Palo Alto to Heritage Park. This is the ninety-second annual parade and the parade is the oldest children's parade in Northern California. Picture by the City of Palo Alto.\" width=\"375\" height=\"306\" \/><\/a> The annual May Fete Parade will be held on Saturday from downtown Palo Alto to Heritage Park. This is the ninety-second annual parade, making it the oldest children's parade in Northern California. Picture by the City of Palo Alto.[\/caption]\r\n\r\nPalo Alto will host its 92nd annual May Fete Parade starting at 10 a.m. on Saturday, May 3 at University Avenue and Emerson Street.\r\n\r\nThe May Fete Parade and Faire are popular events among the citizens of Palo Alto. The Parade is the oldest children’s parade in Northern California. This year’s theme for the event is “Let Me Be Your Neighbor,” according to parade event planner Ali Williams.\r\n\r\nAll of the public middle and high schools of Palo Alto are performing in the parade. During the parade, multiple groups will be marching through the streets, including the Viking Pep Band from Palo Alto High School. The Viking Pep Band will be playing the song “In the Stone” by Earth, Wind &amp; Fire, according to band member and junior Andrew Lu.\r\n\r\n“We’ve got tons of spirit when it comes to playing outside,” Lu said. “We’ll do yells and cheers, and we have the signature kick during the drum cadence.”\r\n\r\nWhile Lu has participated in the Parade in past years for the marching band, he has also attended the event with his family when he was younger, according to Lu.\r\n\r\n“It’s a really great community event [and] brings everyone in town together,” Lu said. “The groups are diverse, ranging from musicians to martial artists to middle schoolers who’ve built go-carts at school.”\r\n\r\nDuring the parade, eight floats are going to compete for the Palo Alto Weekly Awards, along with clowns, stilt walkers, hula artists and other entertainers who will participate in the parade. Different schools, youth groups, dance teams and sports teams will also march in the parade, according to Williams.\r\n\r\n“Numerous preschool groups and elementary schools are joining the fun to show school pride,” Williams said. “The parade kicks off with the motorcycle police and ends with the shiny fire engine.”\r\n\r\nAlong with those showing their spirit for the town, there will also be groups who are promoting their organization. The Palo Alto Children’s Theater will be promoting their upcoming performance and the Humane Society will be walking through the parade, showcasing local pets in need. Representatives from the Palo Alto Historical Association will also be riding in the antique cars from the Museum of American Heritage to celebrate its one hundredth anniversary.\r\n\r\nThe parade will end at around noon at Heritage Park, where the May Fete Faire will begin. At the park, all of the bands will perform as they arrive. The Faire will also have food trucks and games, according to Williams.\r\n\r\nWilliams stressed the importance of community building within the city.\r\n\r\n“[The event is] a community event that celebrates all that we strive in Palo Alto,” Williams said. “What’s important is that it’s a place where people care and connect with each other to create a supportive community.”\r\n\r\nFor more information on the event, click <a href=\"www.cityofpaloalto.org\/gov\/depts\/csd\/events\/parade.asp\">here<\/a>.<b> <\/b>","excerpt":"The Palo Alto City will host its ninety-second annual May Fete Parade starting at 10 a.m. on Saturday, May 3 at University and Emerson Street.","date":"2014-05-01 14:46:36","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-1.56.43-PM.png","categories":["News"],"tags":{"15095":"fair","15099":"float","15097":"heritage","15098":"heritage park","15093":"may fete","15096":"museum","15094":"parade"}},{"id":71222,"title":"Slideshow: Underclassmen dominate powderpuff","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/slideshow-underclassmen-dominate-powderpuff\/","content":"The annual powderpuff games started yesterday with the seniors against the freshmen. The freshmen won with a score of 7-0. Today, the sophomores went up against the juniors, winning with a score of 21-0. Tomorrow is an alternate schedule for a long lunch so that the freshmen and sophomores can play each other for the champion title on the soccer field.\r\n\r\n[slideshow post_id=71222]","excerpt":"The annual powderpuff games started yesterday with the seniors against the freshmen. The freshmen won with a score of 7-0. Today, the sophomores went up against the juniors, winning with a score of 21-0. Tomorrow is an alternate schedule for a long lunch so that the freshmen and sophomores can play each other for the champion title on the soccer field.","date":"2014-05-01 14:40:19","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0723.jpg","categories":["Multimedia","Spotlight"],"tags":{"8574":"Championships","8714":"football","15846":"powderpuff","15848":"soccer field","15847":"tackle"}}]