[{"id":69922,"title":"Opinion: My last farewell to the big gym","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/opinion-my-last-farewell-to-the-big-gym\/","content":"It has been exactly 21 days since I last exited the locker room of the Big Gym in a Palo Alto High School uniform and walked onto the court for what could be the last basketball game of my life.\r\n\r\nMany young children dream of playing professional sports, but my dream was different.\r\n\r\nMy dream was to play basketball for Paly in the same gym that hosted countless numbers of students and players before me.\r\n\r\nBeing raised in Palo Alto my entire life, the one thing I wanted to do before I left for college was to make that walk.  The first time I ever stepped foot onto the Big Gym floor, I was an elementary school student playing for a National Junior Basketball team.  The last time I ever stepped, and will ever step, on that floor was as a senior starter who had already been admitted to college.\r\n\r\nI mention this because the Paly gym has played such a crucial role in my development not only as a basketball player, but also as a person.\r\n\r\nPlaying basketball in the gym hasn't just been about winning games.  It's been about building character and learning determination.\r\n\r\nI had my fair share of moments when I wanted to quit playing, but every time I had a doubt in my mind I thought back to the day when I first shot a basketball into the south-facing hoop and dreamed of the day I would get to do it again in a varsity uniform.  Whether it was barely making the freshman team in ninth grade and doubting I could earn playing time or sitting on the bench my entire junior season, the dream of playing in the gym gave me the mental toughness that I needed to succeed not only on the hardwood, but in life.\r\n\r\nThe seemingly endless practices and film sessions my junior year preparing for games that I wouldn't play in taught me to be patient, trust in the process and wait for my time.\r\n\r\nIt took me awhile to realize that I had achieved my childhood dream.\r\n\r\nI walked out to a gymnasium full of people and we beat our crosstown rival, Gunn High School.\r\n\r\nI was a Viking, representing my school and community, every time I stepped foot on the court.\r\n\r\nThe night before my last home game, I sat in bed unable to sleep and thought about everything that the gym had given me: It gave me a space to clear my mind when I was having a bad day, it gave me something to look forward to, and it fostered friendships that I will cherish for the rest of my life.\r\n\r\nWhen the gym comes down in May, I will be losing a building that holds a special place in my heart, but I will never lose the memories, friendships and values that came with my time playing for Paly under its roof.\r\n\r\nI would like to thank the big gym for everything it provided, and all of the people who supported me in my last four years at Paly.  I am truly grateful for the opportunity I had to play in front of my fellow students and community members.","excerpt":"A student says goodbye to the big gym.","date":"2014-04-08 12:49:36","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/biggym51.jpg","categories":["Opinion","Sports","Spotlight"],"tags":[]},{"id":68502,"title":"Are prom tickets more expensive?","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/are-prom-tickets-more-expensive\/","content":"Tickets to Palo Alto High School's Prom are on sale now, and speculations have been made to whether prices have continued to rise each year.\r\n\r\n[caption id=\"attachment_69789\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg\"><img class=\" wp-image-69789 \" alt=\"&quot;Exploratorium 14&quot; by Tom Hilton is licensed under CC By 2.0. \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg\" width=\"400\" height=\"265\" \/><\/a> \"Exploratorium 14\" by Tom Hilton is licensed under CC By 2.0.[\/caption]\r\n\r\nThe current prices are $110 with an Associated Student Body sticker and $120 without. On March 18 the ticket prices will go up to $120 with an ASB sticker and $130 without. Tickets are on sale at the <a href=\"http:\/\/webstores.activenetwork.com\/school-software\/palo_alto_senior_hig\/index.php?l=product_detail&amp;p=463#.Uw-p747ko6p\">Paly webstore<\/a>.\r\n\r\nThere has been talk about Prom tickets being more expensive this year than in previous years, but that may not necessarily be the case, according to Student Activities Director Matt Hall.\r\n\r\n\"Five years ago at Paly the price was $130, and then it went down,\" Hall said.\r\n\r\nThe last three years, however, the prices have fluctuated at both Paly and Gunn High School, but \"[prom tickets] have not risen by any consistent,\" Hall said.\r\n\r\n\"ASB is subsidizing Prom significantly to bring down the per-person price,\" Hall said.\r\n\r\nAt a minimum, the price tag per person this year will be $150, according to Hall.\r\n\r\nThe reason for this year's somewhat more expensive price tag is mainly due to the location chosen by ASB at the Exploratorium on Pier 15 in San Francisco, according to Hall.\r\n\r\n\"This year's ASB officers have moved heaven and earth to put together what I think is going to be an excellent, great-value-for-the-money prom,\" Hall said.\r\n\r\nThe total cost of this year's prom is $129,000 with estimated price of bus rental around $14,000, catering and site rental at $112,000, and DJ around $3,000, according to Hall.\r\n\r\nASB has been working hard to make prom fun while keeping the costs manageable to everyone. To lower ticket prices, ASB has taken away some of the extra specialties of prom, according to Hall.\r\n\r\n\"There isn't a traditional dinner but there will be plenty of food to fill everyone up,\" senior class president Audrey DeBruine said. \"It's basically dinner without tables. There will be sliders, salads, snacks, and more, and unlike in the past, the caterers are in-house, so the food is being made in the Exploratorium's kitchen.\"","excerpt":"Tickets to Palo Alto High School's Prom are on sale now, and speculations have been made to whether prices have continued to rise each year.","date":"2014-04-08 12:49:01","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/10632863914_c2f7172bd7.jpg","categories":["News","Spotlight"],"tags":{"12859":"exploratorium","8944":"palo alto high school","8953":"paly","12857":"paly prom","12860":"pier 15","12858":"prom 2014"}},{"id":70296,"title":"Liu wins ASB presidency amid higher turnout","permalink":"http:\/\/palyvoice.com\/2014\/04\/06\/liu-wins-asb-presidency-amid-higher-turnout\/","content":"[caption id=\"attachment_70299\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg\"><img class=\" wp-image-70299 \" alt=\"&quot;Vote&quot; poster and smartphone QR code outside the Student Activities Office. Voter turnout in the 2014 election sharply increased from previous years. Photo by Drew Keller.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg\" width=\"600\" height=\"450\" \/><\/a> \"Vote\" poster and smartphone QR code outside the Student Activities Office. Voter turnout in the 2014 election sharply increased from previous years. Photo by Drew Keller.[\/caption]\r\n<p dir=\"ltr\">Palo Alto High School's student government officers for the 2014-15 school year, including future ASB President Claire Liu, have been chosen in an Associated Student Body (ASB) election marked by the highest voter turnout in years.<\/p>\r\n<p dir=\"ltr\">According to Student Activities Director Matt Hall, 34 percent of all Paly students voted over the course of the weeklong election period, a significant rise from last year’s 28 percent and the previous year’s 18 percent.<\/p>\r\n<p dir=\"ltr\">Hall attributed the increase to better accessibility: it was possible to vote not just at the school’s voting station, but also online at home or on students’ mobile devices by using QR codes posted around the school.<\/p>\r\n<p dir=\"ltr\">“We've had a nice steady rise [in student voting rates],” Hall said. “And we had some good races.”<\/p>\r\n<p dir=\"ltr\">According to Hall, the actual participation rate was higher than the gross percentage suggests because the gross figure includes seniors, who cannot vote for next year's officers. Discounting these students, 43 percent of those eligible to vote did so, a rate that surpassed Hall's goal of 40 percent. However, according to Hall, rates are still much lower than at Gunn High School, where close to 80 percent of eligible voters participate.<\/p>\r\n<p dir=\"ltr\">Liu, who will serve as next year’s ASB President after winning an uncontested election, expressed optimism about the increased turnout.<\/p>\r\n<p dir=\"ltr\">“This [the increase] is super exciting, obviously, because it means more Paly students are coming out to cast their ballots and make their voices heard,” Liu said. “It's a sign that the student body is taking ASB elections more seriously and expressing interest and concern in who they want to select to lead the school and to serve as a voice of the Paly student community.”<\/p>\r\n<p dir=\"ltr\">Liu highlighted one-candidate races, such as hers, as one of the negative aspects of the election.<\/p>\r\n<p dir=\"ltr\">“For many of the positions, there seemed to be a lot of intense competition because each candidate was so strong,” Liu said. “[But] For some positions, there was only one person running – for example, mine. This is something I'd like to work on changing in the future. Having lots of people running for a position gives the student body more people to choose from.”<\/p>\r\n<p dir=\"ltr\">This year, four of the twelve total positions were won by an uncontested candidate: ASB President by Liu, ASB Treasurer by junior Courtney Hull, Senior President by junior Maya Ben-Efraim, and Sophomore President by freshman Noa Ben-Efraim. However, there were also two three-way races for Senior Vice President and Sophomore Vice President, won by Olivia Scola and Anmol Nagar, respectively.<\/p>\r\n<p dir=\"ltr\">Due to the election of current sophomores Joseph Kao and Reid Walters, two of the four schoolwide positions will be held by juniors next year. Kao will take the position of ASB Secretary while Walters will serve as ASB Vice President.<\/p>\r\n<p dir=\"ltr\">“I'm excited to work with the whole school and a variety of grade levels,” Walters said. “This upcoming year as ASB Vice President I'll mainly be working with clubs and will be the connection between them and ASB. This will be different from the role that I played in ASB this year as a class officer where I worked mainly with my grade.”<\/p>\r\n<p dir=\"ltr\">Like Walters, Liu looks forward to playing an important role at Paly next year.<\/p>\r\n<p dir=\"ltr\">“I'm really excited about ASB next year,” Liu said. “I'm looking forward to serving as a voice for Paly's student body and focusing on social climate at school, meaning issues of stress, tolerance, [and] bullying.”<\/p>\r\n<p dir=\"ltr\"><strong>Election Results:<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB President: junior Claire Liu<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Vice President: sophomore Reid Walters<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Treasurer: junior Courtney Hull<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>ASB Secretary: sophomore Joseph Kao<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Senior President: Maya Ben-Efraim<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Senior Vice President: Olivia Scola<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Junior President: William Zhou<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Junior Vice President: Eli Friedlander<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Sophomore President: Noa Ben-Efraim<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Sophomore Vice President: Anmol Nagar<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Freshman President and Vice President: to be elected in fall 2014.<\/strong><\/p>","excerpt":"Palo Alto High School's student government officers for the 2014-2015 school year have been chosen in an Associated Student Body (ASB) election marked by the highest voter turnout in years.","date":"2014-04-06 21:36:22","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/photo-4.jpg","categories":["News"],"tags":{"12855":"ASB election 2014","8666":"election","8873":"Matt Hall","8953":"paly","8955":"paly asb","12856":"student government"}},{"id":70178,"title":"Robotics team in tournament over Spring Break","permalink":"http:\/\/palyvoice.com\/2014\/04\/01\/robotics-team-in-tournament-over-spring-break\/","content":"[caption id=\"attachment_70242\" align=\"alignright\" width=\"432\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg\"><img class=\" wp-image-70242  \" alt=\"The Palo Alto High School's (((School)))robotics team's robot is putting the exercise ball into one of the goals to score a point. The robotics team is competing in a tournament over Spring Break. Photo by Chris Linn.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg\" width=\"432\" height=\"287\" \/><\/a> The Palo Alto High School robotics team's robot puts the exercise ball into one of the goals to score a point. The robotics team is competing in a tournament over Spring Break. Photo by Chris Linn.[\/caption]\n\nWhile everybody else is sleeping during Spring Break next week, the Palo Alto High School robotics team will be up early competing in its second robotics tournament of the year. The regional tournament will be held from next Thursday until next Saturday at San Jose State University.\n\nThe upcoming challenge for the tournament is called \"Aerial Assist.\" The goal for the team is for its robot to pick up two-foot diameter exercise balls and put them through goals. The more goals the robots gets, the more points that are scored, according to sophomore Claire Kokontis.\n\nIn this competition, there is more teamwork among the different schools  than usual, according to Kokontis.\n\n\"There's a lot of teamwork among other teams from different schools which is different from past years,\" Kokontis said. \"Usually it's individual teams who are trying to shoot points for their alliance but now we have to work together.\"\n\nPalo Alto High School is competing in the Silicon Valley Regional with over 50 teams, including Castilleja School, Gunn High School, Los Altos High School and many more.\n\nThe team had its <a href=\"http:\/\/palyvoice.com\/2014\/03\/13\/robotics-falls-short-in-first-competition\/\">first tournament<\/a> a few weeks ago from March 7-9 in Madera in which the bumper of the team's robot stopped working. The team was able to fix their robot by the end of the competition but the robot was not as effective, according Kokontis.\n\n\"We worked through it and the team worked really, really hard,\" Kokontis said. \"We have a working robot with our bumper now so we're really excited for this coming competition.\"\n\nThe robotics team meets every Thursday for a general meeting and during the weekends. To prepare for the competition, the team spent roughly six weeks building and perfecting the robot so it will be successful during the tournament.\n\nAs the competition draws closer, the team has high hopes and is looking forward to spending time together and bonding, according to Kokontis.\n\n\"I think we have a good chance of doing well,\" Kokontis said. \"Last competition there was a lot of team building and everybody got closer so this should be fun.\"\n\nFor more information about the competition, click <a href=\"http:\/\/www.firstsv.org\/\">here<\/a>.","excerpt":"While everybody else is sleeping during Spring Break next week, the Palo Alto High School robotics team will be up early competing in its second robotics tournament of the year. The regional tournament will be held from next Thursday until next Saturday at San Jose State University.","date":"2014-04-01 08:03:52","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/robotics.jpg","categories":["News"],"tags":{"12849":"claire kokontis","12848":"competition","12847":"robot","9049":"robotics","10117":"san jose","12846":"spring break","9175":"tournament"}},{"id":70294,"title":"Admin: Kelli Hagen and Kirk Hinton to exit the Teacher Advisor Program","permalink":"http:\/\/palyvoice.com\/2014\/03\/29\/admin-kelli-hagen-and-kirk-hinton-to-exit-the-teacher-advisor-program\/","content":"","excerpt":"","date":"2014-03-29 23:30:15","author":"Lizzie Chun","categories":["Ticker"],"tags":[]},{"id":70267,"title":"Slideshow: Girls lacrosse falls to cross-town rival","permalink":"http:\/\/palyvoice.com\/2014\/03\/29\/slideshow-girls-lacrosse-falls-to-cross-town-rival\/","content":"<p dir=\"ltr\" id=\"docs-internal-guid-e5a4588e-1167-8cba-8605-93ec4d7a2caf\">The Palo Alto High School girls' lacrosse team (4-4, 3-1) lost, 12-10, to cross-town rival Gunn High School (7-1, 4-0) Friday night at Gunn.<\/p>\r\n<p dir=\"ltr\">The Paly Vikings kicked off the half by extending a lead of three, but the Gunn Titans caught up by the half, making the score tied 5-5. Going into the second half the Vikings again extended a lead, but the Titans surpassed them in the last two minutes, making the final score 12-10 as a Viking loss.<\/p>\r\nThe Vikings will next take on the Pioneer High School Mustangs (0-3, 0-2) at 7 p.m. on April 11th at Palo Alto High School.\r\n[slideshow post_id=70267]","excerpt":"Palo Alto High School's girls' lacrosse team lost, 12-10, to cross-town rival Gunn High School in Friday nights game at Gunn.","date":"2014-03-29 22:24:18","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/1002.jpg","categories":["Sports","Spotlight"],"tags":{"12854":"girls lax","8736":"girls' lacrosse","8836":"Lacrosse","12016":"lax"}},{"id":70258,"title":"Brief: Associated Student Body election results announced","permalink":"http:\/\/palyvoice.com\/2014\/03\/28\/brief-associated-student-body-election-results-annouced\/","content":"The Palo Alto High School Associated Student Body elected officials were announced today on Paly's <a href=\"http:\/\/www.paly.net\/event\/congratulations-2014-15-asb-officers\">website<\/a> after being confirmed at 4:13 p.m. by Student Activities Director Matt Hall.\n\nA copy of the results is listed below.\n\nASB President: Claire Liu\n\nASB Vice President: Reid Walters\n\nASB Treasurer: Courtney Hull\n\nASB Secretary: Joseph Kao\n\nSenior President: Maya Ben-Efraim\n\nSenior Vice President: Olivia Scola\n\nJunior President: William Zhou\n\nJunior Vice President: Eli Friedlander\n\nSophomore President: Noa Ben-Efraim\n\nSophomore Vice President: Anmol Nagar","excerpt":"The Palo Alto High School Associated Student Body elected officials were announced today on Paly's website after being confirmed at 4:13 p.m. by Student Activities Director Matt Hall.","date":"2014-03-28 19:52:09","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/20140325-145248.jpg","categories":["News","Spotlight"],"tags":[]},{"id":70254,"title":"Voice Verbatim: What&#8217;s your favorite memory of the Big Gym?","permalink":"http:\/\/palyvoice.com\/2014\/03\/28\/voice-verbatim-whats-your-favorite-memory-of-the-big-gym\/","content":"<iframe src=\"\/\/www.youtube.com\/embed\/mgZ5Bhm5BoA\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\"><\/iframe>","excerpt":"On March 16th, at the farewell celebration for the historical Palo Alto High School Big Gym, The Paly Voice asked Paly students, alumni and staff to recall their favorite memories of the Big Gym.","date":"2014-03-28 18:22:02","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/Screen-Shot-2014-03-28-at-6.15.57-PM.png","categories":["Spotlight","Verbatims"],"tags":{"12336":"85 years","11286":"big gym","12851":"celebration","12850":"farewell","8700":"favorite","12346":"jim harbaugh","12853":"memory","8939":"palo alto","8944":"palo alto high school","8953":"paly","12852":"palyvoice","9201":"verbatim","9214":"voice"}},{"id":69942,"title":"Student receives Naval Reserve Officers Training Corps scholarship","permalink":"http:\/\/palyvoice.com\/2014\/03\/27\/student-receives-naval-reserve-officers-training-core-scholarship\/","content":"Palo Alto High School senior Cedric Amaya will have his college education paid for before joining the Marine Corps after college. Amaya received a Navy Reserve Officers Training Program scholarship, and is one of the few students at Paly who is choosing a military path after high school.\n\n\"I believe that Paly students aren't as aware of the number of possibilities the military has to offer,\" Amaya said. \"Kids often think that if you join the military, the only option you have is to be on the front lines fighting. That's obviously not the case and unfortunately the students here at Paly do not know that.\"\n\n[caption id=\"attachment_70187\" align=\"alignright\" width=\"358\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/navypic2.jpg\"><img class=\"wp-image-70187 \" alt=\"\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/navypic2.jpg\" width=\"358\" height=\"249\" \/><\/a> Senior Cedric Amaya receiving an NROTC scholarship last Friday.      Photo by Lydia Barry.[\/caption]\n\nThe NROTC is a program that runs concurrently with a student’s college's or university's educational course of study. Besides working towards a number of different bachelor's degrees, the students attend classes in Naval Science and train physically, according to the NROTC <a href=\"http:\/\/www.nrotc.navy.mil\/program_info.aspx\">website.<\/a>\n\n\"I chose to join the Marine Corps for a couple reasons,\" Amaya said. \"I wanted to have my education paid for and not have to worry about being in debt afterwards. I also want to be a pilot when I am older and I figured the military would be a good place for me to get my training.\n\nSelected applicants for the NROTC Scholarship Program are awarded scholarships through a highly competitive national selection process, and receive full tuition, books stipend, educational fees and other financial benefits at many of the country's leading colleges and universities, according to the scholarship program's <a href=\"http:\/\/www.nrotc.navy.mil\/about.aspx\">website<\/a>.\n\n\"I'm very excited to have been rewarded the NROTC scholarship,\" Amaya said. \"I'm happy to be going to college and not having to worry about paying back huge amounts of debts years later.\"\n\n&nbsp;","excerpt":"Palo Alto High School senior Cedric Amaya was awarded a Navy Reserve Officers Training Program (NROTC) scholarship and will have his college education paid for before joining the Marine Corps after college.","date":"2014-03-27 13:47:30","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/navypic2.jpg","categories":["News","Spotlight"],"tags":{"12389":"amaya","12388":"cedric","12390":"navy","12391":"NROTC","8953":"paly","9685":"Scholarship"}},{"id":70224,"title":"Science Olympiad wins regional competition, heads to states","permalink":"http:\/\/palyvoice.com\/2014\/03\/27\/science-olympiad-wins-regional-competition-heads-to-states\/","content":"<p dir=\"ltr\" id=\"docs-internal-guid-541bd772-053c-d31c-7250-fe26d4f46e22\">The Palo Alto High School Science Olympiad team is preparing for the Northern California state competition, having won the regional competition on March 14.<\/p>\r\n<p dir=\"ltr\">While in past years the team’s margin of victory at the regional level has been bigger, this year the competition was tighter, according to co-captains junior Ken Chen and senior Annie Chen.<\/p>\r\n<p dir=\"ltr\">“We usually get first but this year was a lot closer than we hoped it to be,” Ken Chen said. “Last year we had a really clear 80 or 90 point margin, which is really big. The lowest score wins [and] this year we only got 12 points less than the second place team so we were quite worried.”<\/p>\r\n<p dir=\"ltr\">Still, Ken Chen said he is proud of the results and the efforts that the team made.<\/p>\r\n<p dir=\"ltr\">“I think everyone worked really well overall,” Ken Chen said. “You can’t base this on results alone because there are a lot of competitions that people actually study for and what actually happens in the competition might not go as expected.”<\/p>\r\n<p dir=\"ltr\">Since the team of 15 people placed in the top four at the regional level, it will compete in the state competition for Northern California, which will take place April 12 in Turlock, Calif., according to the tournament’s <a href=\"http:\/\/www.norcalscienceolympiad.com\/index2.htm\">website<\/a>.<\/p>\r\n<p dir=\"ltr\">According to Annie Chen, there is not much for the team to do to prepare for the state tournament other than increasing the frequency of practices and the motivation of the team members.<\/p>\r\n<p dir=\"ltr\">“I don’t think there really is much that we can change but I’m hoping that we can have more study meetings and engineering meetings,” Annie Chen said. “Before regionals about every week we had a meeting Saturday or Sunday or both days, and now we still have weekend meetings but hopefully closer to states we’ll have meetings on Thursdays and Fridays as well. I’m hoping that people will be more motivated because we only have less than three weeks until states. We have to trust in the team that we made that they’ll study more.”<\/p>\r\n<p dir=\"ltr\">The date of the state competition falls on the same day as Paly’s Prom, to be held at the Exploratorium in San Francisco. According to Annie Chen, the team has devised a way to attend both the competition and Prom.<\/p>\r\n<p dir=\"ltr\">“Unfortunately prom is the same day as the SciOly states but fortunately it [the state competition] is in Northern California … so it’s only an hour or two from where Prom is,” Annie Chen said. “After the awards ceremony, which will hopefully end at 5 [p.m.] or so, we can have a parent … drive us to prom as long as we notify him [Associated Student Body Director Matthew Hall] ahead of time and if we get breathalyzed then we’re good.”<\/p>\r\n<p dir=\"ltr\">If the team wins the state competition, it will move on to compete in the national tournament in July.<\/p>","excerpt":"The Palo Alto High School Science Olympiad team is preparing for the Northern California state competition, having won the regional competition on March 14.","date":"2014-03-27 13:46:30","author":"Addie McNamara","categories":["News"],"tags":[]}]