[{"id":75373,"title":"Video Preview: The Stinky Cheese Man","permalink":"http:\/\/palyvoice.com\/2014\/10\/03\/video-preview-the-stinky-cheese-man\/","content":"<em>The Palo Alto High School Theatre Department's first play of the year is \"The Stinky Cheese Man,\" an adaptation and combination of many classic fairy tales. The show performs at 7:30 p.m. on Oct. 4 and at 2 p.m. on Oct. 5. Tickets are $5 at the door. Read a preview of the play <a href=\"palyvoice.com\/2014\/10\/02\/preview-the-stinky-cheese-man-premieres-at-paly\/\">here<\/a>.<\/em>\r\n<iframe src=\"\/\/www.youtube.com\/embed\/LUp8z2foAa4\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School Theatre Department's first play of the year is \"The Stinky Cheese Man,\" an adaptation and combination of many classic fairy tales. The show performs at 7:30 p.m. on Oct. 4 and at 2 p.m. on Oct. 5. Tickets are $5 at the door.","date":"2014-10-03 16:43:13","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-02-at-10.14.13-PM.png","categories":["Entertainment"],"tags":{"29646":"paly theater","8996":"play","9012":"preview","29648":"show","29519":"stinky cheese man","9160":"theatre","29647":"trailer"}},{"id":75388,"title":"Recap: Paly girls&#8217; water polo defeats Los Altos in close call","permalink":"http:\/\/palyvoice.com\/2014\/10\/03\/recap-paly-girls-water-polo-defeats-los-altos-in-close-call\/","content":"[caption id=\"attachment_75389\" align=\"aligncenter\" width=\"470\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_3019.jpg\"><img class=\" wp-image-75389\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_3019.jpg\" alt=\"Junior Katie Francis prepares to shoot. Her goal in the fourth quarter led the  Vikings to victory. Photo by Nika Woodfill\" width=\"470\" height=\"313\" \/><\/a> Junior Katie Francis prepares to shoot. Her goal in the fourth quarter against the Los Altos Eagles led the Vikings to a 3-2 victory. This is the team's fourth league win of the season.  Photo by Nika Woodfill.[\/caption]\r\n\r\nThe Palo Alto High School girls’ water polo team (9-4, 4-1) defeated the Los Altos High School Eagles (4-6, 2-4) 3-2, after an intense battle at home on Thursday.\r\n\r\nThe game's crucial  moment came in the fourth quarter when junior Alina Drebin scored a bar-in cross-cage goal from the eight meter mark. The goal tied up the game 2-2 and helped give the Vikings the defining push they  needed to overcome the players' fatigue. This would give them the upper hand that would lead to their victory.\r\n\r\nThe game commenced with an almost immediate temporary ejection of Junior Gigi Rojahn, giving Los Altos a six on five advantage.  Playing a man up, Los Altos scored the first goal of the match coming from an unmarked Eagle on the right post.\r\n\r\nThe Vikings came back determined in the second half with the score at 1-0. Rojahn won the sprint to start the third quarter, portraying the team’s new found confidence. Half-way through the third quarter, sophomore Izzy Kelly passed to Rojahn, who shot an unstoppable goal into the upper left net from outside the five meter mark, making the score 1-1.\r\n\r\nFrom this point on the game was close. Los Altos’ speedy counterattacks fiercely combated Paly’s determined defense. Both Drebin and Van Hulsen kept Paly defense in check, staying aggressive throughout the game.\r\n\r\n“We had solid team defense,” Paly head coach Aileen Delaney said. “ We showed great teamwork on both ends and really showed our mental toughness.”\r\n\r\nHowever, the team still has room for improvement, according to Rojahn.\r\n\r\n“We could get a lot more movement on offense and get back quickly on counter attacks.” Rojahn said. “We also need more confidence to shoot.”\r\n\r\nThis is the first time Paly has played Los Altos since losing to the team in the first round of the Santa Clara Valley Athletic League tournament, 8-4.\r\n\r\nThe Vikings are set to play their next game at  at 6:45 p.m. on Tuesday against Saratoga High School at Saratoga.","excerpt":"The Palo Alto girls' water polo team defeated Los Altos High School 3-2 in a tight game on Thursday.","date":"2014-10-03 00:21:48","author":"Nika Woodfill","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_3019.jpg","categories":["Sports","Sports Recap"],"tags":{"9927":"girls water polo","29696":"Katie Francis","9792":"viking","10248":"wopo"}},{"id":75256,"title":"Associated Student Body releases breast cancer awareness statement","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/associated-student-body-releases-breast-cancer-awareness-statement\/","content":"The Palo Alto High School Associated Student Body released a statement regarding the profits of its Breast Cancer Awareness Campaign that has become controversial among students.\r\n\r\nThe statement can be read by clicking <a href=\"https:\/\/docs.google.com\/document\/d\/1sMlZCzc17CVsPB36jqQGXgwFHHninxmBj3Im4m8iRBg\/edit?pli=1\">here.<\/a>","excerpt":"The Palo Alto High School Associated Student Body released a statement regarding the profits of their Breast Cancer Awareness Campaign that has become controversial among students.","date":"2014-10-02 18:20:09","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_3176.jpg","categories":["News"],"tags":{"8496":"ASB","29491":"breast cancer awareness","8714":"football","8953":"paly","29517":"pink out"}},{"id":75278,"title":"A first look inside Mitchell Park Library","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/a-first-look-inside-mitchell-park-library-2\/","content":"The Mitchell Park Library opened to the community for a sneak peek of the facilities on Saturday. In case you couldn't make it, here's a preview of whats to come in November.\r\n[slideshow post_id=75278]\r\n“The library will feature a 56,000-square-foot facility that include[s] flexible library spaces [with a] separate teen room, computer room, quiet reading rooms, game rooms, basketball area, Ada’s Cafe and many other amenities,” Palo Alto City Manager James Keene said in a <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1064\">May press release.<\/a>\r\n\r\nThe first event at the new library will be the Grand Opening scheduled for 11 a.m. to 4 p.m. on Saturday, Dec. 6., according to the City of Palo Alto's Mitchell Park Library <a href=\"http:\/\/www.cityofpaloalto.org\/gov\/depts\/csd\/my_mitchell.asp\">website<\/a>.\r\n\r\n“There will be lots of activities and performances around the celebration of our opening,” City of Palo Alto representative RuthAnn Garcia told The Paly Voice.\r\n\r\nThe library will be open until 8 p.m. Mondays through Thursdays, until 6 p.m. on Fridays and Saturdays, and until 5 p.m. on Sundays.","excerpt":"The Mitchell Park Library opened to the community for a sneak peek of the facilities on Saturday. In case you couldn't make it, here's a preview of whats to come in November.","date":"2014-10-02 18:03:58","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/image3-copy-5.jpeg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"8848":"Library","29312":"mitchell park library","8944":"palo alto high school","9012":"preview"}},{"id":74600,"title":"College fair starting at 6 p.m. on Oct. 13 at Gunn High School","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/college-fair-starting-at-6-p-m-on-oct-13-at-gunn-high-school\/","content":"","excerpt":"","date":"2014-10-02 17:45:33","author":"Lizzie Chun","categories":["Ticker"],"tags":{"29216":"college fair","8751":"gunn"}},{"id":74602,"title":"Alternate schedule for College Awareness Day on Oct. 15","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/alternate-schedule-for-college-awareness-day-on-oct-15\/","content":"","excerpt":"","date":"2014-10-02 17:44:49","author":"Lizzie Chun","categories":["Ticker"],"tags":{"29218":"alternate schedule","8608":"College Awareness Day","29217":"psat"}},{"id":75230,"title":"ASB breast cancer awareness shirts stir controversy","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/asb-breast-cancer-awareness-shirts-stir-controversy\/","content":"[caption id=\"attachment_75236\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-13.jpg\"><img class=\"size-full wp-image-75236\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-13.jpg\" alt=\"Boxes of ASB's breast cancer awareness shirts lay on the floor of the S\" width=\"600\" height=\"450\" \/><\/a> Boxes of the Associated Student Body's breast cancer awareness shirts lie on the floor in the Student Activities Office. ASB had sold roughly 175 out of 450 shirts online and in person as of Thursday, according to Student Activities Director Matt Hall. Photo by Amy Leung.[\/caption]\r\n\r\nAfter a controversy over a Palo Alto High School Associated Student Body's shirt sale, ASB leaders are reiterating that the focus of the sale is to raise awareness of breast cancer.\r\n\r\nAccording to ASB, officers decided to design and sell shirts with a message to raise awareness for breast cancer. The problem was what to do with any profits, although Student Activities Director and Japanese teacher Matt Hall said they did not expect any profits. Some students read on the <a href=\"http:\/\/paly.net\/event\/buy-asb-pink-out-viking-t-shirts\">Paly website<\/a> that the shirts’ profits were not going directly to funding research to cure cancer and took action to express their disapproval through social media.\r\n\r\nOne of these vocal students was junior Griffin Carlson. His <a href=\"http:\/\/www.change.org\/p\/palo-alto-high-school-asb-stop-exploiting-disease-for-revenue-fix-your-mistake#supporters\">petition<\/a> garnered 51 signatures in an hour-and-a-half to protest the sale of the shirts. He closed the petition after seeing ASB officers post on Facebook about being open to modifying their plans for the sale, Carlson said.\r\n\r\n“I think it’s not morally right to use a disease to gain profit for something else that’s not benefiting people affected by the disease,” Carlson said.\r\n\r\nProceeds could not be directly given to a foundation because <a href=\"http:\/\/www.leginfo.ca.gov\/.const\/.article_16\">California Constitution Article 16 Section Six<\/a> states that schools cannot donate to public funds, according to  Hall. Thus, ASB cannot legally donate to any cancer research foundation.\r\n\r\n“Money raised by students must be spent on and for students,” Hall said.\r\n\r\nThe situation highlights a challenge many ASB clubs have faced since this law came into effect. The Free the Children Club faced these difficulties when attempting to send money raised by bake sales to its partner village in Ecuador, club member and senior Anna Dukovic said. The club instead had to find alternative methods of giving money to the village.\r\n\r\n“We used that money to buy bracelets that women had made from many of the different villages and some of this money went to the villages directly, while the other proceeds went to the organization for other uses,” Dukovic said. “We have also focused more on campaigning and spreading awareness.”\r\n\r\nThis law makes the process of donating money to organizations much more tedious and hindering, Dukovic said, but she said she understands the rationale behind it.\r\n\r\n“It does prevent our money from blindly being sent to a place without knowing exactly where in the village or organization it will go,” Dukovic said.\r\n\r\nInstead of donating directly to a foundation, ASB will focus on raising awareness by hosting a tailgate for Friday’s football game, Liu said.\r\n\r\n“When we noticed [donating] was illegal, we still are obviously going to do something about promoting awareness, as well as trying our best to get money to these organizations somehow in a legal way,” Liu said. “Our plan for that is to have charities with their tables at our tailgate.”\r\n\r\nJunior Alfredo Gonzalez, whose own mother survived breast cancer, feels that there is no use in raising awareness.\r\n\r\n“One of the things that angers me the most is the idea of breast cancer awareness,” Gonzalez said via a comment on Carlson’s petition.  “Everyone who doesn’t live under a rock knows it exists, so wearing pink doesn’t make you a hero. Donate your money to a legit charity that you care about.”\r\n\r\nSome students, like junior Riley Schoeben, supported the way ASB handled the situation.\r\n\r\n\"I understand how hard it is to raise money for a charitable cause in a way the school allows them to,\" Schoeben said. \"It was a great idea that the t-shirts were used to spread awareness and the proceeds, which appear to be close to nothing, can't be given to an outside organization anyway.\"\r\n\r\nIf there is a profit, which according to Hall is unlikely,  it will go to the ASB general account. Money in the general account will then be used to subsidize Homecoming and Prom. For example, the general price of tickets will be lowered and subsidized for those who cannot afford tickets.\r\n\r\nCarlson argues that there should not be any profit for ASB if its intention is to spread awareness.\r\n\r\n“ASB could have chosen to not make a profit by selling the shirts for a cheaper amount of money, and thus be able to sell more shirts and get that awareness to more students,” Carlson said.\r\n\r\nIn the end, Hall wants to remind students to stay calm about the situation.\r\n\r\n“Let’s one, take a deep breath,” Hall said. “Let’s support breast cancer awareness by being aware. … Let’s support Paly. It’s not even about supporting ASB. It’s about, 'Let’s have something fun for Paly on Friday night at the game.' It’s a win-win.”\r\n\r\n<em>Update: ASB has released an <a href=\"https:\/\/docs.google.com\/document\/d\/1sMlZCzc17CVsPB36jqQGXgwFHHninxmBj3Im4m8iRBg\/edit?pli=1\">official statement<\/a> addressing the t-shirt controversy.<\/em>","excerpt":"After a recent debate over social media about where the profits of the ASB's t-shirt sale are going, the Paly Voice decided to get facts from both sides of the argument. Read more here.","date":"2014-10-02 14:14:10","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-13.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","29491":"breast cancer awareness","14290":"claire liu","8617":"controversy","10040":"Griffin Carlson","8873":"Matt Hall","13033":"petition"}},{"id":75161,"title":"Preview: &#8220;The Stinky Cheese Man&#8221; premieres at Paly","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/preview-the-stinky-cheese-man-premieres-at-paly\/","content":"[caption id=\"attachment_75300\" align=\"alignnone\" width=\"607\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10669109_849736055058798_2661697122228917321_o.jpg\"><img class=\" wp-image-75300\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10669109_849736055058798_2661697122228917321_o.jpg\" alt=\"Junior Daniel Cottrell as the Stinky Cheese Man in &quot;The Stinky Cheese Man&quot; The show opens today for elementary schoolers and Saturday and Sunday for a general audience. Photo courtesy of Paly Theatre. \" width=\"607\" height=\"405\" \/><\/a> Junior Daniel Cottrell as the Stinky Cheese Man in \"The Stinky Cheese Man.\" The show opens today for elementary schoolers and Saturday and Sunday for a general audience. Photo courtesy of Paly Theatre.[\/caption]\r\n\r\nThe Palo Alto High School Theatre Department's production of \"The Stinky Cheese Man,\" the department's first show of the year, opens today for elementary school students and on Saturday and Sunday for a general audience.\r\n\r\nThe show marks the second year in a row that Paly Theatre is opening a production for younger students in addition to the normal main stage fall show.\r\n\r\n\"The Stinky Cheese Man\" is a play based on the famous children's book by Jon Scieszka and involves numerous spoofs on common fairy tales.\r\n\r\n\"It's antic, free-wheeling and wild,\" director Tony Kienitz said. \"That's what makes it unique. You're taking famous fairy tales and turning them on their ear in a way that is original and irreverent.\"\r\n\r\nActors have enjoyed the relative freedom involved in the process of making the show.\r\n\r\n\"Tony gives us the freedom to try different physicality and voices,\" junior Daniel Cottrell, who plays the Stinky Cheese Man, said. \"He encourages all the actors to enhance the whole ridiculousness of the show.\"\r\n\r\nSenior Jamie Garcia also enjoys the looseness of the production.\r\n\r\n\"It's special,\" Garcia said. \"It gives everyone an opportunity to be super goofy and have a great time while still getting to put on a production.\"\r\n\r\nGarcia encourages Paly students to attend the \"The Stinky Cheese Man\" this weekend.\r\n\r\n\"It's a really funny show, even thought the humor can be immature at times,\" Garcia said. \"But high schoolers will think it's really funny, and they would get to see their friends dress up in ridiculous costumes, which is a good time.\"\r\n\r\nThe dates for general audience are 7:30 p.m. on Oct. 4 and 2 p.m. on Oct. 5 at the Haymarket Theatre. Tickets are $5.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Theatre Department's production of \"The Stinky Cheese Man,\" the departments first show of the year, opens today for elementary school students and Saturday and Sunday for a general audience. ","date":"2014-10-02 13:26:09","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Stinky-Cheese-Poster-FIN-Web-CORRECTION.jpg","categories":["Entertainment"],"tags":{"8996":"play","29520":"play theatre","29519":"stinky cheese man","9159":"theater","9160":"theatre"}},{"id":75159,"title":"Liveblog: Football vs. Wilcox","permalink":"http:\/\/palyvoice.com\/2014\/10\/02\/liveblog-football-vs-wilcox\/","content":"<em>Check back at 7:30 p.m. for live coverage as the Palo Alto High School football team (1-3, 0-0) takes on the Wilcox High School Chargers (2-1, 0-0) for its first league game of the season. <\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School football team (1-3, 0-0) hosts the Wilcox High School Chargers (2-1, 0-0) at 7:30 p.m. on Friday Oct. 3. ","date":"2014-10-02 12:50:53","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10708004_762226827168711_1713728146_n.jpg","categories":["Football","Sports"],"tags":[]},{"id":75195,"title":"Students restricted from eating in the Media Arts Center","permalink":"http:\/\/palyvoice.com\/2014\/10\/01\/students-restricted-from-eating-in-the-media-arts-center\/","content":"[caption id=\"attachment_75199\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Trash1.jpg\"><img class=\"wp-image-75199\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Trash1.jpg\" alt=\"Three piles of trash were left out on Monday, leading teachers to restrict students from eating in the building. The restriction will last for one week. Photo courtesy of Margo Wixsom.\" width=\"600\" height=\"450\" \/><\/a> Three piles of trash were left out on Monday, leading teachers to restrict students from eating in the building. The restriction will last for one week. Photo courtesy of Margo Wixsom.[\/caption]\r\n\r\nDue to students' failure to throw away trash, food and beverages have been banned from all areas in Palo Alto High School's Media Arts Center this week.\r\n\r\nAccording to photography and yearbook teacher Margo Wixsom, teachers of the MAC have asked nicely for trash to be cleaned, but took this steeper measure when three tables piled high with trash were abandoned on Monday.\r\n\r\n“There was a mountain of trash yesterday,” Wixsom said. “There was crushed food and candy in the new rugs.”\r\n\r\nHowever, junior Aadit Narayanaswamy believes that the whole community should not be punished for several students' wrongdoings.\r\n\r\n\"I understand it's a new building and people want to keep it in pristine condition, but it's still a space meant to be used by the student body,\" Narayanaswamy said. \"Keeping it new forever is impossible.\"\r\n\r\nAnother issue coming to light is the mistreatment of MAC furniture. Teachers are having problems with furniture being thrown, jumped on and used as toys.\r\n\r\nNo action has currently been taken to stop these deeds. However, that may be subject to change if the situation grows further out of hand.\r\n\r\n“It’s discouraging and disheartening that students treat the MAC this way,” Wixsom said. “I would like to have the MAC as close to the same condition as it was the first day.”","excerpt":"Due to students' failure to throw away trash, food and beverages have been banned from all areas in Palo Alto High School's Media Arts Center this week.","date":"2014-10-01 09:49:53","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Trash1.jpg","categories":["News"],"tags":[]}]