[{"id":70650,"title":"Girls lacrosse to host Sacred Heart","permalink":"http:\/\/palyvoice.com\/2014\/04\/16\/girls-lacrosse-to-host-sacred-heart\/","content":"The Palo Alto High School girls lacrosse team will host its crosstown rival, the Sacred Heart Prep High School Gators (7-3, 4-0) at 7 p.m. Wednesday.\r\n\r\nStopping Sacred Heart will not be an easy task for the Vikings, who will have to focus on junior Brigid White, a Northwestern University commit, as well as Libby Muir, a sophomore who has already pledged to Stanford.\r\n\r\n\"Our plan is to pretty much double team [White and Muir] as soon as they get the ball,\" junior Paige Anderson said.\r\n\r\nAnderson explained that in addition to blanketing the Gators' stars, the Vikings will have to do a better job communicating on defense.\r\n\r\n\"We need to work on talking a lot on defense and making sure to send the slides when we are double teaming,\" Anderson said.\r\n\r\nAccording to Anderson, as far as offense goes, the Vikings will look to play a fundamentally sound game by keeping the ball moving and retaining possession.  More time with the ball means less opportunities for the Gators to score.\r\n\r\n\"[I believe] we have a chance of winning as long as we get the 50-50 balls from the draw and keep possession,\" Anderson said.\r\n\r\nThe Vikings will stay at home to play Mountain View High School at 7 p.m. Thursday.","excerpt":"The Palo Alto High School girls lacrosse team will play host to its crosstown rival, the  Sacred Heart Prep High School Gators (7-3, 4-0) at 7 p.m. Wednesday.\r\n","date":"2014-04-16 15:29:59","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030213_0033.jpg","categories":["Sports"],"tags":[]},{"id":70556,"title":"Students respond to Phil Winston story","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/students-respond-to-phil-winston-story\/","content":"[caption id=\"attachment_70564\" align=\"alignright\" width=\"340\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg\"><img class=\"size-full wp-image-70564\" alt=\"Phil Winston was under investigation for misconduct during the time of his decision to step down from his principal position. Photo by Veronica Weber.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg\" width=\"340\" height=\"227\" \/><\/a> Former Paly principal Phil Winston was under investigation for misconduct during the time of his decision to step down from his principal position at Palo Alto High School. Photo by Veronica Weber.[\/caption]\r\n\r\nPalo Alto High School students are responding to a Palo Alto Weekly <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">story<\/a> detailing former Paly Principal Phil Winston's notice of misconduct, which was received by him last summer.\r\n\r\nThe story contains numerous examples of alleged misconduct by Winston towards both students and staff. Many of the examples in the Weekly story are related by a staff member or parent who claimed to have seen the situations unfold.\r\n\r\nThere is now push back on social media from some students who saw no misconduct from Winston during his time at Paly.\r\n\r\n\"This Winston story is completely a misrepresentation of Mr. Winston as a guy,\" junior Phil Lewis said. \"I had the pleasure of knowing him well, and he really cared about each individual. It's a shame that he was forced to leave Paly because now the students are stuck with a misconception of him as a person.\"\r\n\r\nNot only current students, but also Paly alumni, disagree with the claims made about Winston.\r\n\r\n\"During my time at Paly I never witnessed Mr. Winston doing or saying anything inappropriate,\" said Paly alum Olivia Maggi, Class of 2013. \"He would always talk to students and was very friendly, but I thought that was good. I thought he was very involved with students' lives and cared about how they were doing. It made me feel like he actually cared and supported us. When I read the Weekly's story about Mr. Winston, it made me sad that this could happen to him. I feel that words can sometimes be taken the wrong way and that Mr. Winston was never intending to be inappropriate. I think he was very good at his job.\"\r\n\r\nHowever, now some students said they felt uncomfortable with Winston after reading the article.\r\n\r\n\"Honestly, I was pretty on board with the 'Chill Phil' thing, too,\" senior Jessica Feinberg said. \"After reading the evidence and documentation against him and having discussions with teachers and fellow students, I feel a really sick sense of being used. He created a good rapport with students ... but he used that as a shield to protect him from these allegations because it became nearly impossible for students and teachers to report their harassment. His popularity among students — this shield — allowed a culture of silence to be created, where speaking up would create backlash against those who spoke. And I was part of that shield.\"\r\n\r\nWinston argued against <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1397016468.pdf\">six specific allegations<\/a> made against him by sending a <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1397016279.pdf\">letter<\/a> to Assistant Superintendent of Human Resources Scott Bowers on June 14, according to the Weekly.\r\n\r\n\"It is always disappointing when statements or conduct are misinterpreted, but I understand that this is going to happen from time to time, and I do my best to avoid such misinterpretations,\" Winston said to Bowers. \"I am certain I can do still better in that respect and I will take these comments as a learning experience that will help me further improve.\"","excerpt":"Palo Alto High School students are responding to a Palo Alto Weekly story detailing former Paly Principal Phil Winston's notice of misconduct, which was received by him last summer.","date":"2014-04-15 14:20:07","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg","categories":["News","Spotlight"],"tags":{"8939":"palo alto","8953":"paly","8984":"Phil Winston","9013":"principal","11609":"resignation","13859":"student response"}},{"id":70630,"title":"Preview: New York Times bestselling author to discuss college life","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/preview-new-york-times-bestselling-author-to-discuss-college-life\/","content":"The Palo Alto High School and Gunn High School Parent Teacher Student Associations are bringing a New York Times bestselling author to Gunn's Spangenberg Theater tonight at 7 p.m. to discuss students' transitions to college.\r\n\r\nHarlan Cohen, author of the student handbook on college life <em>The Naked Roommate,<\/em> will hold a free presentation for seniors, juniors and parents in preparation for their upcoming move to college and for the college search process, according to PTSA parent Jennifer Landesmann.\r\n\r\nCohen encourages asking questions, so the audience will be able to text in their questions about any topic concerning the college experience, including making friends, relationships, peer pressure, time management and finances, according to a <a href=\"http:\/\/archive.constantcontact.com\/fs164\/1102270631099\/archive\/1117083571959.html\" target=\"_blank\">PTSA Paly Link email<\/a>.\r\n\r\nCollege advisor Sandra Cernobori praised Cohen's presentation skills.\r\n\r\n\"His book is good, and he's engaging and entertaining,\" Cernobori said.\r\n\r\nCohen has visited more than 400 college campuses and has written five books, according to his <a href=\"http:\/\/www.NakedRoommate.com\/\" target=\"_blank\">website<\/a>.","excerpt":"The Palo Alto High School and Gunn High School Parent Teacher Student Associations are bringing a New York Times bestselling author to Gunn's Spangenberg Theater tonight at 7 p.m. to discuss students' transitions to college.","date":"2014-04-15 14:05:56","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_4.jpeg","categories":["News"],"tags":{"14165":"cernobori","14162":"harlan cohen","14163":"new york times","9019":"PTSA","14164":"the naked roommate"}},{"id":70582,"title":"Voice of the Week: Erik Olah","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/voice-of-the-week-erik-olah\/","content":"[caption id=\"attachment_70587\" align=\"aligncenter\" width=\"576\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg\"><img class=\" wp-image-70587 \" alt=\"erik olah\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg\" width=\"576\" height=\"432\" \/><\/a> Palo Alto High School science teacher Erik Olah poses outside his home at Paly, the science building. Photo by Kate Marinkovich.[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5em;\">This week The Paly Voice sat down with science teacher Erik Olah to talk about northern elephant seals, Prom and Twitter. <\/span><\/p>\r\n<p style=\"text-align: left;\">The Paly Voice: Tell me a little bit about yourself. How would you describe yourself in three words?<\/p>\r\nErik Olah: I hate questions like that. Describe myself in three words? Well if you know if someone repeats the question they're totally stalling. We can come back to that.\r\n\r\nTPV: What's your favorite marine animal?\r\n\r\nEO: Probably the northern elephant seal. There's a difference between northern and southern elephant seals. There's a big difference.\r\n\r\nTPV: Why the northern?\r\n\r\nEO: Well that's the one I studied when I did my studying of marine biology at Santa Cruz. I observed and studied northern elephant seals quite a bit. They're not that different than southern elephant seals, but they are the one's that I've seen.\r\n\r\nPV: How do you like teaching seniors?\r\n\r\nEO: Oh, it's interesting. Seniors are fine, I'm used to it. It's my third year teaching seniors so you start getting used to the pattern.  You kind of see them fall out, some sooner than others, some depending on when they get into college. But usually by this time of year the vast majority are checked out, so it's hard to keep them focused. But that's why with Marine Biology [class] I do marine mammals now, because I think that's the thing people are most interested in, so I try to do the thing people are most interested in when it's most likely they will be checked out of the class.\r\n\r\nPV: What do you like better, marine biology or AP biology?\r\n\r\nEO: That's a tough question. Marine biology is my class, I designed it, I'm the only one's who's teaching it. It's my thing, so that would be the thing I am most excited to do and always thinking about. AP biology is great too, I am really enjoying that.\r\n\r\nPV: When you go to the aquarium what's your favorite animal to see?\r\n\r\nEO: I used to really like sea otters, but they are always there. I don't know if it's my favorite but I always like looking at the sunfish because it's like what the heck, what is that thing? It doesn't look like a thing that should be. I don't think it's my favorite, but I like seeing it and noticing how ridiculous it looks. Also, all the parasites that are on it usually.\r\n\r\nPV: Any words on the Paly boys' basketball season?\r\n\r\nEO: Pretty good season. We had a lot of seniors graduate last year, so pretty much all the guys on this year's team had zero varsity basketball experience. Expectations might have been a little bit lower, but they definitely way overachieved and they did quite well. I think they definitely overachieved. It was a fun year.\r\n\r\nPV: You have a pretty popular Twitter feed that's well-read among the Paly students. Anything to say about that?\r\n\r\nEO: Is it that well-read?\r\n\r\nPV: You were just featured in the Verde.\r\n\r\nEO: I'm always featured in the Verde. I don't know. My thing with it is I know some teachers use it as a teaching tool, and I've thought about that, but you have Schoology for all your work stuff and you can look for that there so I just try to use it as an outlet to connect with students in a more fun way. If kids think it's funny that's great. I try to say a few things here and there that are funny.\r\n\r\nPV: What's your favorite marine-biology-themed pun?\r\n\r\nEO: Whale, I don't know. Let me sea if I can think of one. I otter do better than that.\r\n\r\nPV: You recently helped a student ask another student to Prom. Do you like to stay pretty involved with the student community?\r\n\r\nEO: It was fun. I went to Gunn and I don't remember people doing those crazy fun things like that, so I think it was kind of fun to experience that. I mean I didn't ask the person, but it was fun to be a part of that experience.\r\n\r\nPV: Did you go to Prom?\r\n\r\nEO: I went to my junior Prom but not my senior Prom.\r\n\r\nPV: Did you ask the girl?\r\n\r\nEO: I don't remember. I think I didn't. I know one of the Homecomings, actually both of the Homecomings, I went to I didn't, the girl asked me. I was kind of lazy about that. But to backtrack, I didn't go to my senior Prom because my sister's college graduation was the same weekend. It's not because I couldn't get a date, I'm sure there were plenty of offers. Back to the Prom thing, it was fun. It was fun because it was a student I really liked so it was fun to give her a funny experience that she hopefully remembers. But that's not the only one I did. I did a pop quiz question for a kid up on the projector. Another kid came in and sang, but I wasn't really part of that.\r\n\r\nPV: If you had one thing to say to the Voice audience, what would you want to say?\r\n\r\nEO: I know that Paly can be stressful and that high school is stressful, but try to find the things you enjoy and focus on the positive and get the most out of those things.\r\n\r\nPV: Specifically to seniors?\r\n\r\nEO: Good luck. For the seniors, I feel like the college process is so stressful that it takes the fun out of getting into college, but I hope once fall rolls around you realize what a great opportunity you have. It's fun, and you have a good opportunity to learn a lot. There's so much you can get out of college. I hope you can get past the frustrations that are happening now and get to the good stuff.\r\n\r\nPV: That's really nice.\r\n\r\nEO: I can be really nice.\r\n\r\n<em>If you know a student (or student group) who you think should be interviewed, please leave a comment below.<\/em>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"This week The Paly Voice sat down with science teacher Erik Olah to talk about northern elephant seals, Prom and Twitter.\r\n","date":"2014-04-15 13:31:47","author":"Kate Marinkovich","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg","categories":["Features","Spotlight","Voice of the Week"],"tags":{"13930":"erik olah","8953":"paly","10258":"voice of the week"}},{"id":70409,"title":"Construction continues, with several projects nearly finished","permalink":"http:\/\/palyvoice.com\/2014\/04\/13\/construction-continues-with-several-projects-nearly-finished\/","content":"[caption id=\"attachment_70430\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg\"><img class=\"size-full wp-image-70430\" alt=\"The exterior of the new math building, which could open in just two weeks. Photo by Drew Keller.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg\" width=\"600\" height=\"450\" \/><\/a> The exterior of the new math building, which could open in just two weeks. Photo by Drew Keller.[\/caption]\r\n<p dir=\"ltr\">The new math and social science building and Media Arts Center are nearing completion, while construction work continues on many smaller projects including several that were implemented over the course of Spring Break.<\/p>\r\n<p dir=\"ltr\">The new math and social science building will open soon, according to Assistant Principal Jerry Berkson, with only about two weeks left of preparation.<\/p>\r\n<p dir=\"ltr\">“There’s furniture in the math [and social science] building, so that building is ready to go,” Berkson said. “We could probably do it [open the math and social science building] today … other than phone lines and sewage.”<\/p>\r\n<p dir=\"ltr\">According to Berkson, the administration wants to get math classes in the new building sooner, so that the old math building is ready to <a href=\"http:\/\/palyvoice.com\/2014\/01\/28\/pe-to-invade-math-department-as-construction-comes-to-a-conclusion\/\">accommodate PE students<\/a> next year due to the demolition of the old gym building this summer.<\/p>\r\n<p dir=\"ltr\">Construction on the Media Arts Center will also be finished soon, though not as promptly as construction on the math and social science building.<\/p>\r\n<p dir=\"ltr\">“Construction is definitely done, it’s just more stuff on the inside,” Berkson said. “I’d say if we really wanted to we could move in within a month.”<\/p>\r\n<p dir=\"ltr\">While the building could be open in a month, it may not be ready for all the media arts students until next year. Due to its large size, the Advanced Journalism class (which publishes the Campanile newspaper) will have first priority to move in to the new building if construction is completed before summer.<\/p>\r\n<p dir=\"ltr\">“It’ll be fully functional for next year,” Berkson said.<\/p>\r\n<p dir=\"ltr\">In addition to the ongoing construction of the two new buildings, several small construction projects and changes took place on campus over spring break. These projects included taking down the fences by the east and north side of the campus, relocating trees in the Embarcadero parking lot and adding new walkways between the English building and Library.<\/p>\r\n<p dir=\"ltr\">“They’re [the construction workers] going to be making adjustments for their next projects,” Berkson said regarding the fences.<\/p>\r\n<p dir=\"ltr\">Starting next year, students will also have to take the bike path next to the railroad tracks to get to Town and Country Village because there will be construction at the current Embarcadero Road pedestrian crosswalk.<\/p>\r\n<p dir=\"ltr\">With the Media Arts Center and math and social science building construction coming to a close, work on the school’s next projects will be able to begin, according to Berkson.<\/p>\r\n<p dir=\"ltr\">“New gym construction will start over the summer, hopefully,” Berkson said.<\/p>\r\n<p dir=\"ltr\">Other upcoming construction plans include remodeling the science building to create four additional classrooms and remodeling the library.<\/p>","excerpt":"Many small construction projects have been carried out over the course of Spring Break, while the new media arts and math buildings are nearing completion.","date":"2014-04-13 17:56:58","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg","categories":["News","Spotlight"],"tags":{"8616":"construction","9954":"jerry berkson","11127":"media arts center"}},{"id":70450,"title":"Sophomore and junior testing on Monday","permalink":"http:\/\/palyvoice.com\/2014\/04\/13\/sophomore-and-junior-testing-on-monday\/","content":"Palo Alto High School sophomores and juniors will take the annual science section of the California Standardized Test and the new Smarter Balanced Test starting at 8:15 a.m. Monday.\r\n\r\nAccording to Dean of Students Craig Tuana, the scores from the Smarter Balanced Test will not count since it is a new online standardized test that the California Department of Education is field testing this year. The results from this year, however, will be examined to make any changes to the scored test that will be administered next year.\r\n\r\nThe purpose of the Smarter Balance Test is to test students'  college preparedness, according to Tuana. The Smarter Balance Test is replacing the Early Assessment Program that has been taken annually by juniors in the past. Additionally, Paly has recently changed its common core standards, so this new test will be meeting those new requirements.\r\n\r\nEven though the Smarter Balance Test is not a scored test, this trial will give vulnerable feedback to both Paly and the Department of Education on whether or not online tests of this scale are effective to give at the same time. It will give feedback to teachers as it will reveal if students have learned the material on the test or not, according to Tuana.\r\n\r\n\"[The staff] wants to see if we can handle [the test] and if not, we want to learn from this one to make sure that we can handle it for the test next year,\" Tuana said.\r\n\r\nThe Smarter Balance Test was supposed to have originally been administered to juniors on March 18 and 19, while the sophomores were taking the California High School Exit Examination, but due to the fact that the test was not ready then, the Department of Education decided to postpone its release date.\r\n\r\nThe Smarter Balance Test will be taken on a computer, and it will have a different format than the  Standardized Testing and Reporting test administered in previous years.  The test will consist of multiple choice questions, fill-in-the blank questions and even questions which involve drawing on the computer.\r\n\r\n\"[The test will] benefit students who are taking it,\" Tuana said. \"I think this is a wave of future testing that they could possibly experience [this type of testing] in college.\"\r\n\r\nSophomores, on the other hand will be taking the CST. The CST is not a new test. It is a general science test for sophomores, which contains two parts and will end at 10:20 a.m., according to Tuana.\r\n\r\nThe school expects that students will come for both exams like any other standardized test, according to Dean of Students, Craig Tuana.\r\n\r\n\"[The school] really expects the students to come,\" Tuana said. \"We are just asking for two hours of [the students'] time for the tests and to test our system.\"\r\n\r\nWhile sophomores and juniors will have to attend school Monday, freshmen and seniors will have the day off.\r\n\r\nHere is more information about the <a href=\"www.cde.ca.gov\">Smarter Balance Test<\/a> and the <a href=\"http:\/\/www.cde.ca.gov\/ta\/tg\/sr\/cefstar.asp\">CST<\/a>.<a href=\"http:\/\/www.cde.ca.gov\/ta\/tg\/sr\/cefstar.asp\">\r\n<\/a>","excerpt":"Palo Alto High School sophomores and juniors will take the annual science section of the California Standardized Test and the new Smarter Balanced Test starting at 8:15 a.m. Monday.","date":"2014-04-13 12:44:32","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/test.jpg","categories":["News"],"tags":{"13288":"cst","9760":"juniors","9072":"science","12317":"smarter balance test","9114":"Sophomores","12056":"standardized testing","12319":"test","13289":"testing"}},{"id":70551,"title":"NHSJC Online News Package submission: Feeding the convention","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/nhsjc-online-news-package-submission-feeding-the-convention\/","content":"","excerpt":"Takaaki Sagawa and William Dougall's submission for the National High School Journalism Convention Online News Package contest.","date":"2014-04-11 15:33:47","author":"Takaaki Sagawa","categories":[],"tags":[]},{"id":70388,"title":"Next week dedicated to staff appreciation","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/next-week-dedicated-to-staff-appreciation\/","content":"As second semester begins to dwindle down, Palo Alto High School students will have an opportunity to get on their teachers' good sides with Staff Appreciation Week taking place next week April 14-18.\r\n\r\nAccording to Rebecca Fox, current president of the Parent Student Teacher Association, there will be a latte cart for the staff serving complimentary drinks on Wednesday.\r\n\r\nFox also encouraged students to participate in what she described as a Palo Alto tradition by either sending staff emails or dropping notes into teachers' baskets located in the front office.\r\n\r\n\"We are also encouraging parents and students to write letters of appreciation to teachers and staff,\" Fox said.\r\n\r\nIn addition, Fox said that there will be a luncheon held for staff on Friday.\r\n\r\n\"I certainly think it is well deserved and a good idea,\" Fox said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"As second semester begins to dwindle down, Palo Alto High School students will have an opportunity to get on their teachers' good sides with Staff Appreciation Week taking place next week April 14-18.\r\n","date":"2014-04-11 09:51:48","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo.jpg","categories":["News"],"tags":[]},{"id":70392,"title":"Opinion: Put the arrest talk to rest","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/opinion-put-the-arrest-talk-to-rest\/","content":"<p dir=\"ltr\">Human curiosity is a completely normal tendency. So it is not surprising that following the release of a Palo Alto High School senior’s mugshot on several social media sites during the last days of spring break, the Paly community, along with the larger Palo Alto community, became captivated with searching for a better understanding of the situation.<\/p>\r\n<p dir=\"ltr\">Unfortunately, this search has led the community to gossip and make unfounded assumptions about the arrested student and his actions. This tendency has an even greater effect as the discussions are taking place not only on the Quad or between friends, but also in heated discussions online.<\/p>\r\n<p dir=\"ltr\">The comment sections of websites, such as Facebook in particular, are especially vile as members of the community get heated in their discussions. For example, the mugshot of the student arrested, which the Palo Alto Police Department <a href=\"https:\/\/www.facebook.com\/photo.php?fbid=664812860221181&amp;set=a.349604361742034.72544.288613124507825&amp;type=1&amp;stream_ref=10\">posted<\/a> on its Facebook page, contains racist and threatening comments and plenty of gossip and speculation. This kind of activity sparks rumors and spreads falsities that can negatively affect this student’s reputation. The student already will face repercussions for his actions, so there is no need to further antagonize the situation.<\/p>\r\n<p dir=\"ltr\">In addition to social media blasts, there is then the aspect of the face-to-face gossiping that occurs on Paly campus. Over the past week, Paly students have been telling a variety of different versions of the story, which twists the details of the actual occurrences and subsequently leads others to jump to false conclusions. By spreading these falsities the student body unnecessarily adds on to the problems of the student.<\/p>\r\n<p dir=\"ltr\">While I do not necessarily support the actions of the student, this treatment of the student is simply unacceptable. By resorting to such low methods as gossiping, spreading rumors and racist or threatening remarks, the community is portraying itself in a poor moral-light.<\/p>\r\n<p dir=\"ltr\">A more appropriate response would have included a way for the student to deal with the repercussions more privately without the community members sticking their noses into and judging the situation. In time, the true events of the situation will become apparent, so spreading false information in the mean time is just pointless. I believe that the Paly community can act much better than we are doing so now. We often pride ourselves on being a progressive and supportive high school and this is our opportunity to prove that we really do fulfill that description.<\/p>","excerpt":"Following the arrest of a Palo Alto high school senior over spring break, the Paly campus leaped into heated discussion. This discussion overstepped the line by making unfounded assumptions and spreading rumors. Read on to find out why this response was inappropriate.","date":"2014-04-11 07:34:20","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/photo-2.jpg","categories":["Opinion","Spotlight"],"tags":{"12970":"student arrest"}},{"id":70527,"title":"Former principal subject to disciplinary action, according to PA Weekly investigation","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/former-principal-subject-to-disciplinary-action-according-to-pa-weekly-investigation\/","content":"<div title=\"Page 5\">\r\n\r\n[caption id=\"attachment_70529\" align=\"alignright\" width=\"310\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg\"><img class=\"size-full wp-image-70529 \" alt=\"Former Principal Phil Winston speaking to a American Classics H class in   October, 2013. Photo by Grant Raffel.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg\" width=\"310\" height=\"259\" \/><\/a> Former Principal Phil Winston speaking to an American Classics H class in October 2013. Photo by Grant Raffel.[\/caption]\r\n\r\nThe Palo Alto Weekly released a <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">story<\/a> early Friday morning that contained information about the district's investigation into the behavior of former Palo Alto High School Principal Phil Winston.\r\n\r\nAccording to the Weekly's story, Winston, who is currently a special education teacher at Jordan Middle School, received a formal notice from the Palo Alto Unified School District lawyers on Aug. 13 stating that six student — and four staff — related incidences of misconduct would require him to take actions including \"refraining from using profanity, sexual comments and innuendo, and derogatory terms; commenting on the physical attributes and the dress of students or colleagues; having any physical contact with students or staff; and engaging in actions and language that are flirtatious or sexual in nature; as well as complete a sexual-harassment prevention training within 90 days.\"\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">According to the Weekly, Winston, who resigned from his position at Paly at the end of the 2012-13 school year citing health and personal reasons, was critical of the district's release of a packet to the Weekly that contained information regarding his unprofessional conduct.\r\n<div title=\"Page 28\">\r\n\r\n\"It is important to note that the statements and inferences contained in the packet lack context and are as a result highly misleading,\" Winston said to the Weekly. \"They inaccurately represent me and my character. In addition, they do not represent my performance over time, but rather highlight a short period of time during which I was under extreme pressure, stress and had personal challenges.\"\r\n\r\n<em>We will continue to cover this story as more information becomes available. <\/em>","excerpt":"The Palo Alto Weekly released a story early Friday morning that contained information about the district's investigation into former Palo Alto High School Principal Phil Winston.","date":"2014-04-11 07:32:39","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg","categories":["News","Spotlight"],"tags":{"13735":"former principal","13736":"investigation","8944":"palo alto high school","8952":"palo alto weekly","8984":"Phil Winston","11609":"resignation"}}]