[{"id":72591,"title":"New furniture compensates for postponement of library remodel","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/new-furniture-compensates-for-postponement-of-library-remodel\/","content":"[caption id=\"attachment_75048\" align=\"aligncenter\" width=\"525\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg\"><img class=\" wp-image-75048\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg\" alt=\"Paly students Olivia Musil, Pasha Kamarei, Lydia Barry and Hans Usman use the café-style high tables in the library. Photo by George Lu. \" width=\"525\" height=\"437\" \/><\/a> Paly students Olivia Musil, Pasha Kamarei, Lydia Barry and Hans Usman use the café-style high tables in the library. Photo by George Lu.[\/caption]\r\n\r\nAfter delaying the remodeling of the Palo Alto High School Library, the Paly administration is encouraging students to use the new furniture put in place as compensation.\r\n\r\nThe new furniture includes brand new chairs and tables, which replace the old furniture that had been around for 43 years.\r\n\r\n“I really wanted to push for new furniture for the library,” Paly librarian Rachel Kellerman said. “I thought that we would be able to have this facility remodeled starting now, so we were going to wait for new furniture until the remodeling. But when the job was put off for the next two to three years, I asked Principal Kim Diorio if we could find a donor, and she did.”\r\n\r\nPaly administration members, including Diorio, became aware of issues with the old furniture after using it themselves last year.\r\n\r\n“There were a number of teachers who became students for a day,” Kellerman said. “Diorio said she sat for an hour in our comfortable chairs pretending to be a student and she realized it was just a really tough place to be. The furniture didn’t work, so she understood the need before any other administrator.”\r\n\r\nStudents have mostly enjoyed the new look and feel of the library.\r\n\r\n“I really like some of the new seats,” senior Ken Shin said. “They’re very comfortable, and they’re much nicer than what we had last year.”\r\n\r\nPaly chose the furniture through a selection process in order to create an ideal library environment for students, according to Kellerman.\r\n\r\n“We talked to Shelly Young from Workplace Connections who [designed] the Media Arts Center furniture,” Kellerman said. “I also talked to another company that specializes in library furniture called Demco. We got samples in from both vendors, and kids sat in the chairs and did polls. ... We ended up going with Shelly Young’s design because we were able to get [more of a] variety of colors, and the tables were more flexible.”\r\n\r\nThe library features some new types of furnitures, including café high tables, designed to encourage collaboration, as well as single desks with dividers.\r\n\r\n\"I like the dividers,\" junior Ophir Sneh said. \"The library can be pretty distracting sometimes, so they help keep me focused.\"\r\n\r\nAnother benefit of the new furniture  is its compatibility.\r\n\r\n“All the furniture in the Media Arts Center is the same, so it’s all interchangeable.” Kellerman said.","excerpt":"After delaying the remodeling of the Palo Alto High School Library, Paly administration is encouraging students to use the new furniture put in place as compensation.","date":"2014-09-29 17:23:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10410821_854293477923970_8433335301805375494_n.jpg","categories":["News"],"tags":{"21437":"bond","8616":"construction","21438":"delay","11130":"furniture","21439":"Kellerman","8848":"Library","8912":"new"}},{"id":74066,"title":"Local nonprofit invites community to &#8220;step out of your world&#8221;","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/local-nonprofit-invites-community-to-step-out-of-your-world\/","content":"The Global Lives Project, a San Francisco based nonprofit organization, will exhibit an interactive video display focused on broadening cross-cultural understanding and empathy during the week-long grand opening of the Palo Alto High School Media Arts Center starting Oct. 13.\r\n\r\n[caption id=\"attachment_74683\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg\"><img class=\"wp-image-74683\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg\" alt=\"David Harris, Executive Director of Global Lives, explains the purpose of the Global Lives Project to Palo Alto High School staff at a faculty meeting. Starting Oct. 13, Global Lives will display a video exhibit in the Media Arts Center. The organization's motto is &quot;step out of your world.&quot;\" width=\"400\" height=\"247\" \/><\/a> David Harris, executive director of Global Lives, explains the purpose of the Global Lives Project to Palo Alto High School staff at a faculty meeting. Starting Oct. 13, Global Lives will display a video exhibit in the Media Arts Center. The organization's motto is \"Step out of your world.\"[\/caption]\r\n\r\nThe video exhibit features raw footage from the lives of 20 participants of different ethnicities, ages, education levels and socio-economic backgrounds from around the world. The installation will be displayed in the MAC nonstop throughout the five days of the building's grand opening.\r\n\r\nAccording to the <a href=\"http:\/\/globallives.org\/about\/overview\/\" target=\"_blank\">Global Lives website<\/a>, the purpose of the project is to \"explore the diversity of human experience ... and encourage discussion, reflection,and inquiry about the wide variety of cultures, ethnicities, languages, and religions on this planet.\"\r\n\r\nDavid Harris, the Executive Director of Global Lives and a Mountain View High School alumnus, said Global Lives focuses on two main questions: What could global empathy look like, and what are the boundaries of an individual's moral universe?\r\n\r\nThe exhibit displays the days of the participants in real time to the audience as if they were on the PST time zone, according to teacher Eric Bloom.\r\n\r\n\"In the morning, it'll be their [the participants'] morning, wherever they are in the world, so there's an idea about kids just keep coming back,\" Bloom said. \"They'll see different parts of the day, and they can reflect on what they're doing in their day and what somebody else is doing in their day.\"\r\n\r\nWhile the Paly community is free to view the exhibit throughout the day, teachers may also schedule self-guided, \"Meet the Filmmaker\" and docent-led tours via Schoology. All tours are scheduled to last about 30 minutes.\r\n\r\nIn partnership with curriculum design professor Denise Pope from the Stanford University School of Eduation, Global Lives also developed a teaching curriculum called \"Unheard Stories\" for middle and high school students. It is aligned with the English and history Common Core standards and consists of three parts: Understanding Myself, Barriers to Understanding and Understanding Others.\r\n\r\nSome Paly teachers have integrated the curriculum into their classes, including the Social Justice Pathway.\r\n\r\n\"Erin [Angell] and I used it [the curriculum] in our Social Justice Pathway to give kids an opportunity to think about who they are and what influences them and then give them the chance to look into the lives of others,\" Bloom said.\r\n\r\nHarris encourages the use of the Global Lives website, which includes some of the exhibit videos, biographies of participants and an interactive map that shows connections between participants, to supplement the curriculum.\r\n\r\nPart of the Global Lives Project exhibit is currently on display at the local think tank Institute for the Future in downtown Palo Alto.\r\n\r\nHarris is looking forward to the project being displayed in the MAC.\r\n\r\n\"I have to say, this [the MAC] is one of the most exciting spaces I've had to work with in a long time,\" Harris said. \"Between your [Paly's] 14 different screens built into the walls here and the eight screens Global Lives will be bringing in ... this will be the first place we've ever shown all 20 of the Global Lives videos ... so this is a really cool opportunity for me as a filmmaker and artist, as well.\"","excerpt":"The Global Lives Project, a San Francisco based nonprofit organization, will exhibit an interactive video display focused on broadening cross-cultural understanding and empathy during the week-long grand opening of the Palo Alto High School Media Arts Center starting Oct. 13.","date":"2014-09-29 17:20:55","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_7620.jpg","categories":["News","Spotlight"],"tags":{"29316":"curriculum","29220":"david evan harris","29219":"david harris","29221":"denise pope","29026":"exhibit","29025":"global lives","29222":"global lives project","18366":"mac","11127":"media arts center","8944":"palo alto high school","29027":"project","9653":"stanford","29028":"unheard stories"}},{"id":75059,"title":"What&#8217;s in my bag: Dorothy Han","permalink":"http:\/\/palyvoice.com\/2014\/09\/29\/whats-in-my-bag-dorothy-han\/","content":"<code><iframe src=\"\/\/www.thinglink.com\/card\/573253626114342914\" width=\"620\" height=\"465\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/code>\r\n\r\nThe Paly Voice went around asking students what they have in their bag in order to find out more about who they are. This week we sat down with junior Dorothy Han. Hover around the photo to learn more.","excerpt":"The Paly Voice went around asking students what they have in their bag in order to find out more about who they are. This week we sat down with junior Dorothy Han.","date":"2014-09-29 14:41:03","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0368.jpg","categories":["Multimedia","Spotlight"],"tags":{"29475":"backpack","29473":"dorothy han","29474":"three things","29476":"what's in my bag"}},{"id":74736,"title":"Football Recap: Vikings routed in second home game 35-7","permalink":"http:\/\/palyvoice.com\/2014\/09\/28\/football-recap-vikings-routed-in-second-home-game-35-7\/","content":"The Palo Alto High School football team (1-3, 0-0) failed to snap out of its recent offensive struggles, falling to the Palma High School Chieftains (4-0, 0-0) 35-7 on Friday night, despite a notable change in the offensive lineup.\r\n\r\nJunior quarterback Justin Hull started the game in place of junior Oliver Svirsky, the team's starting quarterback during the its first three games. Hull, a team captain, braved through several rough hits and instigated a few solid drives for the Vikings. Head coach Jake Halas credits Hull's work ethic and attitude every game to the quarterback switch.\r\n\r\n\"<span style=\"color: #3e454c;\">He's a gamer,\" Halas said after the loss. \"That's why he's in there at quarterback. We made the [quarterback] move because on game day, that kid shows up. Number five shows up to play.\" <\/span>\r\n\r\n[caption id=\"attachment_74966\" align=\"alignnone\" width=\"960\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg\"><img class=\"size-full wp-image-74966\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg\" alt=\"Members of the Palo Alto High School football team observe the game action from the home sideline. The Vikings lost their third straight game Friday night vs. Palma \" width=\"960\" height=\"720\" \/><\/a> Members of the Palo Alto High School football team observe the game action from the home sideline. The Vikings lost their third straight game Friday night vs. Palma. Photo by Josh Yuen.[\/caption]\r\n\r\nEven with Hull running the offense, the Chieftains defense held the Vikings scoreless until senior running back Jayshawn Puckett finally broke through for a 23-yard touchdown rush with 9:09 left in the game. Despite watching the Chieftains take full control of the game early in the fourth quarter, Puckett is proud of the way that the team stuck together and kept playing until the end.\r\n\r\n\"Our team kept fighting and pushing,\" Puckett said. \"We just kept fighting and tried to make something happen, something positive. I can say that we worked more as a team tonight, something that we've been struggling do.\"\r\n\r\nThe Chieftains offense, highlighted by sophomore phenom tailback Emilio Martinez, struck for four overpowering touchdowns in the first half. Martinez accounted for three of the team's five touchdowns, sprinting into the end zone in a variety of ways, including a screen pass and an inside run.\r\n\r\nThe Vikings turned the ball over to the Chieftains four times, which continuously crushed any hopes of a Vikings rally. Despite the team's continuous struggles, Hull feels that the team is making improvements and is playing better than what the score might indicate.\r\n\r\n\"We played hard,\" Hull said. \"The first half was closer than what the scoreboard said. The second half we played pretty well actually. We battled and that's all you can really ask for.\"\r\n\r\nThe Vikings will host the Wilcox High School Chargers (2-1, 0-0) for their first division game of the season at 7 p.m. on Friday, Oct. 3 at Hod Ray Field.","excerpt":"Despite starting a different quarterback, the Palo Alto High School football team (1-3, 0-0) was unable to snap out of a two-game scoring drought, falling to the Palma High School Chieftains (4-0, 0-0) 35-7 on Friday night. ","date":"2014-09-28 18:36:32","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/974670_762226977168696_1559327935_n.jpg","categories":["Football","Sports","Sports Recap","Spotlight"],"tags":{"8714":"football","29315":"palma","8939":"palo alto"}},{"id":75016,"title":"Student journalists comment on J-day experience","permalink":"http:\/\/palyvoice.com\/2014\/09\/27\/student-journalists-comment-on-j-day-experience\/","content":"Student journalists at today's Journalism Education Association of Northern California <a href=\"http:\/\/palyvoice.com\/2014\/09\/27\/slideshow-jeanc-j-day\/\" target=\"_blank\">J-day journalism convention<\/a> at Palo Alto High School's Media Arts Center responded to The Paly Voice's questions: What's the coolest thing you've seen or heard here, and how will you apply what you've learned today to your publication?\r\n\r\nHover over the dots to read each student's response.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/572556695549509633\" width=\"620\" height=\"827\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nPhotos by George Lu.","excerpt":"Student journalists at today's Journalism Education Association of Northern California’s J-day journalism convention at Palo Alto High School's Media Arts Center responded to The Paly Voice's questions: What's the coolest thing you've seen or heard here, and how will you apply what you've learned today to your publication?","date":"2014-09-27 23:18:31","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/tmp5725566955495096331.jpg","categories":["Multimedia","Spotlight"],"tags":{"29411":"eagle eye","29410":"el camino fundamental","29389":"el estoque","29391":"georgeluphotography","8751":"gunn","29399":"j-day","29385":"jday","29386":"jeanc","29401":"Journalism Education Association of Northern California","18366":"mac","11127":"media arts center","11288":"monta vista","29402":"mvhs","29400":"norcaljday","29405":"octagon","29403":"oracle","8944":"palo alto high school","8996":"play","29413":"raven report","29404":"sacramento country day school","29409":"san leandro","10667":"santa clara","25428":"sequoia","29406":"stockton early college academy","29408":"the cargo","29412":"the roar","29415":"thing link","29414":"thinglink","29407":"wolves' chronicle"}},{"id":74981,"title":"Slideshow: JEANC J-day","permalink":"http:\/\/palyvoice.com\/2014\/09\/27\/slideshow-jeanc-j-day\/","content":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics. [slideshow post_id=74981]","excerpt":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics.","date":"2014-09-27 16:25:23","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_54291.jpg","categories":["Slideshow","Spotlight"],"tags":{"29389":"el estoque","29390":"elena kadvany","29391":"georgeluphotography","10751":"jack brook","29385":"jday","29386":"jeanc","8814":"journalism","29388":"lisa krieger","8964":"paly voice","29387":"paul kandell","18379":"rowan mcevoy","9202":"verde","9792":"viking"}},{"id":74752,"title":"Liveblog: Football vs. Palma","permalink":"http:\/\/palyvoice.com\/2014\/09\/26\/liveblog-football-vs-palma\/","content":"<em>Check back at 7:30 p.m. for live coverage as Palo Alto high school's football team (1-2, 0-0) takes on Palma High School (3-0, 0-0).<\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School football team (1-2, 0-0) takes on Palma High School (3-0, 0-0) at 7:30 p.m. Friday Sept. 25 at Paly.","date":"2014-09-26 18:18:31","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_3294-1.jpeg","categories":["Sports"],"tags":{"8714":"football","8855":"liveblog","29315":"palma","8953":"paly"}},{"id":74431,"title":"Listen to the sounds of the sea with Paper Islands&#8217; debut EP","permalink":"http:\/\/palyvoice.com\/2014\/09\/25\/listen-to-the-sounds-of-the-sea-with-paper-islands-debut-ep\/","content":"<iframe style=\"border: 0; width: 350px; height: 350px;\" src=\"https:\/\/bandcamp.com\/EmbeddedPlayer\/album=297508888\/size=large\/bgcol=ffffff\/linkcol=2ebd35\/minimal=true\/transparent=true\/\" width=\"300\" height=\"150\" seamless=\"\"><a href=\"http:\/\/paperislands.bandcamp.com\/album\/the-striped-sea-ep\">The Striped Sea EP by Paper Islands<\/a><\/iframe>\r\n\r\nIf you are dying to hear more from that music duo that performed last week on the Quad, wait no longer!\r\n\r\nThe local duo Paper Islands debuted its first extended play album titled \"The Striped Sea EP\" last week, providing listeners with an edgy take on the unique genre of electro indie music.\r\n\r\nPaper Islands, which formed February 2014 produces, writes and records all of their original music. The local duo consists of Palo Alto High School seniors Sally Wang and Fabian Garduño, who joined forces after working on solo projects previously.\r\n\r\n\"The Striped Sea EP\" debuted on Sept. 18 performing selections from the album during lunch on the Paly Quad that day.\r\n\r\nDespite having formed only recently, the duo has been successful, releasing two singles,“Evaporate” and “Survive,” which are both featured on its EP. \"Evaporate\" has received 1,145 listens on Soundcloud and \"Survive\" has received 980 listens so far, with the views increasing every day. They are currently in the top 20 charts under electronic music for <a href=\"http:\/\/paperislands.bandcamp.com\/\">bandcamp<\/a>, an online music store that allows consumers to set their own price. Paper Islands has also performed at The Palo Alto Teen Arts Council's open mic nights, Battle of the Bands and other local gigs around the Bay Area.\r\n\r\n[caption id=\"attachment_74673\" align=\"alignright\" width=\"326\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10370561_1010207329005614_470440216_n1.jpg\"><img class=\" wp-image-74673\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10370561_1010207329005614_470440216_n1.jpg\" alt=\"Wang and Garduño pose for a selfie while listening to friends who are in the band &quot;Forever For a Second.&quot;\" width=\"326\" height=\"440\" \/><\/a> Wang and Garduño show their excitement by posing for a selfie while listening to friends who are in the band \"Forever For a Second.\" Photo by Sally Wang.[\/caption]\r\n\r\nTheir music is a combination of indie and electronic, also known as electro indie.\r\n\r\nThe first song titled “&amp;” provides listeners with a simple melody with vocals by Wang. The lyrics send the message to be yourself and not care about what others think of you. \"&amp;\" captures the essence of a short and sweet song, but with a big message.\r\n\r\nThe album continues, with the next song, “i miss you.” The song is a personal story of Paper Islands that they wanted to share with the public. The track uniquely incorporates a real-life breakup phone call between a girl leaving for college and her then-boyfriend and emphasizes the obstacles of having a long-distance relationship.\r\n\r\nThe conversation, according to Garduño, was recorded through a phone conference with permission. It's full of emotion and all about the true feelings one gets when one has to let go to someone special in one's life. The song is enhanced by sounds of the airport at the beginning and end of the song along with the phone conversation. Wang does an excellent job vocally, showcasing the emotions of desperation and sadness through her voice, to capture and embody what one feels during a breakup.\r\n\r\nThe final song, titled “Survive” was written and produced with Paly senior Will Kast. “Survive” is the perfect ending to the duo’s EP album. The hook is sampled from the National Nuclear Emergency Alert, which one would hear if the United States was under nuclear attack. To dramatize the song, a beat instantly drops once the message is over, and Wang's vocals comes in with the beat. Even though the EP was released only a week ago, I've already found myself singing and humming along to the catchy tune.\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_74563\" align=\"alignnone\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-11.png\"><img class=\"size-full wp-image-74563\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-11.png\" alt=\"Paper Islands performs on Sept. 5 at the Lucie Stern Community Center put on by Teen Art's Council. Photo by Adele Bloch. \" width=\"640\" height=\"360\" \/><\/a> Paper Islands performs on Sept. 5 at the Lucie Stern Community Center put on by Teen Art's Council. Photo by Adele Bloch.[\/caption]\r\n\r\nThe overall theme of the album is the \"songs of the sea,\" which matches perfectly with the name of the duo, Paper Islands, and the title “Striped Sea EP.\" According to Wang and Garduño, they feel a connection to the calmness, mystery and beauty of the ocean. Wang adds that the ocean's constant changes inspire the duo's music.\r\n\r\nThe EP can be played and downloaded above from the bandcamp, with a set-your-own price policy. If you would like to make a donation to Paper Islands enter as much as you would like donate, or simply enter zero to download for free. To stay posted and updated with Paper Islands check out their <a href=\"https:\/\/www.facebook.com\/paperislands\">Facebook<\/a>, <a href=\"https:\/\/soundcloud.com\/paper-islands\">Soundcloud<\/a> and <a href=\"https:\/\/www.youtube.com\/user\/paperislands\">Youtube<\/a>.\r\n\r\nPaper Islands' next event is at 7 p.m. on Oct. 15 at <a href=\"http:\/\/angelicasllc.com\/event.cfm?id=175963\">Angelicas<\/a> in Redwood City.","excerpt":"The local duo Paper Islands debuted its first extended play album titled \"The Striped Sea EP\" last week, providing listeners with an edgy take on the unique genre of electro indie music.","date":"2014-09-25 13:33:12","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10676540_703591269710036_1277732310_o.jpg","categories":["Entertainment","Spotlight"],"tags":{"29374":"andrew lu","29168":"duo","29375":"electro indie","29163":"ep","13032":"fabian garduno","29376":"paper islands","29378":"sally wang","29377":"the striped sea ep","29379":"will kast"}},{"id":74693,"title":"Spirit Dance practice schedule","permalink":"http:\/\/palyvoice.com\/2014\/09\/24\/spirit-dance-practice-schedule\/","content":"<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/2870679-untitled-infographic\" width=\"600\" height=\"1031\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nPalo Alto High School's Spirit Week dance practices begin tomorrow for all four grades in different locations and times throughout the day.\r\n\r\nTomorrow, the Class of 2018 will practice during Lunch in the Dance Studio, 2015 during Advisory in the Dance Studio, 2017 after school in the Dance Studio and 2016 after school on the Lacrosse Field.\r\n\r\n\"Everyone should want to join the dance because it's a really good representation of how unified your class is,\" junior Spirit Commissioner Emma Cole said. \"The class that can rally the most dancers is certainly a class to be respected.\"\r\n\r\nStudents may join the dance team, as long as they <a href=\"http:\/\/palyvoice.com\/2014\/09\/05\/spirit-dance-to-undergo-major-changes\">fulfill the requirement<\/a> of attending at least four hours of dance practice. Any signs of exclusivity results in automatic disqualification from participation in the dancefor a team or its members.\r\n\r\n\"We're not putting up with any coldness this year,\" Cole said. \"Spirit Week is about having fun and building class unity.\"\r\n\r\nChoreographers decide how the time is spent during each practice. <\/span>They may also arrange practices outside of school, according to Cole.\r\n\r\n\"We advise them to spend it [dance practice time] wisely since some dancers may only be spending four hours learning a four-and-a-half minute dance,\" Cole said.\r\n\r\nFor specific rules regarding Spirit Dances, click <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxwYWhzYXNifGd4OmEyOWU3NTliNzUzYzk2Mg\">here.","excerpt":"Times, dates and locations of all Spirit Dance practices for all grades.","date":"2014-09-24 23:19:31","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/CH6A6918.jpg","categories":["News"],"tags":{"11286":"big gym","8626":"dance","29305":"dance studio","9795":"freshman","8816":"junior","29304":"lacrosse field","27705":"october","29300":"practice","29302":"schedule","9085":"senior","29303":"september","29306":"small gym","29301":"sophomore","9764":"spirit","9780":"spirit dance","9119":"Spirit Week"}},{"id":74476,"title":"Opinion: The Fault in Our Entertainment","permalink":"http:\/\/palyvoice.com\/2014\/09\/24\/opinion-the-fault-in-our-entertainment\/","content":"<em><span style=\"color: #3e454c;\">Following a new entertainment trend set by the novel \"The Fault in Our Stars\" and its movie adaptation, a new TV show gives viewers a questionable image of a cancer patient's life.<\/span><\/em>\r\n\r\n[caption id=\"attachment_74709\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Untitled-2.jpg\"><img class=\"size-full wp-image-74709\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Untitled-2.jpg\" alt=\"In the new Fox dramedy &quot;Red Band Society,&quot; Dash (Astro), Jordi (Nolan Sotillo) and Leo (Charlie Rowe) (left to right) visit their coma-stricken friend Charlie (Griffin Cluck) and talk about their current conditions. The three teens have cystic fibrosis, osteosarcoma and an amputated leg, respectively, while Charlie is in a coma for an unspecified reason. &quot;Luck isn't getting what you want,&quot; said Leo, referring to their health. &quot;It's surviving what you don't want.&quot; (FOX)\" width=\"600\" height=\"600\" \/><\/a> In the new Fox dramedy \"Red Band Society,\" Dash (Astro), Jordi (Nolan Sotillo) and Leo (Charlie Rowe) (left to right) visit their coma-stricken friend Charlie (Griffin Cluck) and talk about their current conditions. The three teens have cystic fibrosis, osteosarcoma and an amputated leg, respectively, while Charlie is in a coma for an unspecified reason. \"Luck isn't getting what you want,\" said Leo, referring to their health. \"It's surviving what you don't want.\" Photo courtesy of <a href=\"http:\/\/www.fox.com\/red-band-society\/\">FOX.<\/a>[\/caption]\r\n\r\nI’d be lying if I claimed to be an expert on the topic of cancer and the many debilitating life changes that stem from the disease. But with the recent rise of cancer-based movies and TV shows, I feel like I have a pretty good understanding of what Hollywood thinks it’s like to live with cancer:\r\n\r\nYou live a pretty decent life. You get diagnosed with cancer. You feel like your life is over. You suddenly appreciate life so much more now that you know your days are numbered. You die a tragic, beautiful death.\r\n\r\nThe summer blockbuster “The Fault In Our Stars,” based on the soul-wrenching young-adult novel by John Green, spotlighted the topic of cancer and became the trailblazer for several other shows revolving around cancer and similar life threatening diseases.\r\n\r\nDon’t get me wrong. I thoroughly enjoyed the ups and downs of the Hazel-Gus timeline in “TFIOS;\" it’s the unrealistic portrayal of the disease from the shows that succeed it that confounds me.\r\n\r\nIt’s great that mainstream entertainment is bringing attention to such a serious issue, but the border-line glamorization of cancer is getting out of hand.\r\n\r\nSpecifically, the new Fox dramedy “Red Band Society,” which premiered at 9 p.m. last week, gives viewers a questionable image of life with serious medical issues. This new series tells the story of a diverse group of teen hospital patients bound together by the common trait of being seriously ill. (“The Breakfast Club” much?)\r\n\r\nThese teens try to make the best of their not-so-glamorous life at the hospital, smoking pot in deserted rooms and buying alcohol underage. In one scene of the pilot episode, they throw a “goodbye party” for the leg of a surgery-bound teen, practically singing Kumbaya in a circle on the hospital rooftop. Granted, there are a few touching moments, like when the one-legged main character tearfully reminisces his presurgery life or when the sharp-tongued nurse shows compassion by ordering pizza for one of the kids. (It’s a long story.) For the most part, “Red Band Society” is a heart-warming series but there is definitely room for improvement in terms of the plot line.\r\n\r\nWhat this show — like a couple others — fails to touch on is the painful side of cancer. Shows focus on cliché aspects such as love triangles, friend drama and other basic components of a hit teen story instead of bringing light to the reality of the situation. The colossal range of emotions, the sporadic feelings of nausea, the hair\/weight\/appetite loss, the seemingly endless tests and the side effects of whatever medication a patient needs to take may all be a part of a cancer patient’s life — a part that is not included in the said TV show. While it’s okay that producers hold an optimistic view, the show’s misleading take on life with cancer raises eyebrows.\r\n\r\nAs the narrator of “Red Band Society” so brilliantly says, “Everybody thinks that when you go to a hospital, life stops. But it’s just the opposite — life starts.” The TV show makes it seem like having a serious illness is a great life changing experience. It gives the perception that having cancer is a blessing in disguise, a way for people to truly understand the meaning of life. People need to understand that their “life” can “start” even without being diagnosed with a life-threatening illness and being chained to a hospital bed.\r\n\r\nCancer is not beautiful. Cancer is not the ID that lets you get past the bouncer of the exclusive learn-the-value-of-life club. Cancer should not be romanticized. And most of all, the gravity of cancer should not be downplayed simply for the sake of appealing to teenagers across the nation.","excerpt":"A summer blockbuster pioneers a new genre in mainstream entertainment. Read on to find out how the recent approach may be faulty.","date":"2014-09-24 21:27:00","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/red-band-society.jpg","categories":["Opinion","Spotlight"],"tags":{"29183":"cancer","29181":"john green","29182":"red band society","29184":"television","29180":"the fault in our stars"}}]