[{"id":74981,"title":"Slideshow: JEANC J-day","permalink":"http:\/\/palyvoice.com\/2014\/09\/27\/slideshow-jeanc-j-day\/","content":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics. [slideshow post_id=74981]","excerpt":"Around 250 high school student journalists and advisers from across the West Coast gathered at Palo Alto High School's Media Arts Center for the Journalism Education Association of Northern California's journalism day. Both students and advisers from multiple publications presented on different journalism-related topics.","date":"2014-09-27 16:25:23","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_54291.jpg","categories":["Slideshow","Spotlight"],"tags":{"29389":"el estoque","29390":"elena kadvany","29391":"georgeluphotography","10751":"jack brook","29385":"jday","29386":"jeanc","8814":"journalism","29388":"lisa krieger","8964":"paly voice","29387":"paul kandell","18379":"rowan mcevoy","9202":"verde","9792":"viking"}},{"id":74752,"title":"Liveblog: Football vs. Palma","permalink":"http:\/\/palyvoice.com\/2014\/09\/26\/liveblog-football-vs-palma\/","content":"<em>Check back at 7:30 p.m. for live coverage as Palo Alto high school's football team (1-2, 0-0) takes on Palma High School (3-0, 0-0).<\/em>\r\n\r\n[liveblog]","excerpt":"The Palo Alto High School football team (1-2, 0-0) takes on Palma High School (3-0, 0-0) at 7:30 p.m. Friday Sept. 25 at Paly.","date":"2014-09-26 18:18:31","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_3294-1.jpeg","categories":["Sports"],"tags":{"8714":"football","8855":"liveblog","29315":"palma","8953":"paly"}},{"id":74431,"title":"Listen to the sounds of the sea with Paper Islands&#8217; debut EP","permalink":"http:\/\/palyvoice.com\/2014\/09\/25\/listen-to-the-sounds-of-the-sea-with-paper-islands-debut-ep\/","content":"<iframe style=\"border: 0; width: 350px; height: 350px;\" src=\"https:\/\/bandcamp.com\/EmbeddedPlayer\/album=297508888\/size=large\/bgcol=ffffff\/linkcol=2ebd35\/minimal=true\/transparent=true\/\" width=\"300\" height=\"150\" seamless=\"\"><a href=\"http:\/\/paperislands.bandcamp.com\/album\/the-striped-sea-ep\">The Striped Sea EP by Paper Islands<\/a><\/iframe>\r\n\r\nIf you are dying to hear more from that music duo that performed last week on the Quad, wait no longer!\r\n\r\nThe local duo Paper Islands debuted its first extended play album titled \"The Striped Sea EP\" last week, providing listeners with an edgy take on the unique genre of electro indie music.\r\n\r\nPaper Islands, which formed February 2014 produces, writes and records all of their original music. The local duo consists of Palo Alto High School seniors Sally Wang and Fabian Garduño, who joined forces after working on solo projects previously.\r\n\r\n\"The Striped Sea EP\" debuted on Sept. 18 performing selections from the album during lunch on the Paly Quad that day.\r\n\r\nDespite having formed only recently, the duo has been successful, releasing two singles,“Evaporate” and “Survive,” which are both featured on its EP. \"Evaporate\" has received 1,145 listens on Soundcloud and \"Survive\" has received 980 listens so far, with the views increasing every day. They are currently in the top 20 charts under electronic music for <a href=\"http:\/\/paperislands.bandcamp.com\/\">bandcamp<\/a>, an online music store that allows consumers to set their own price. Paper Islands has also performed at The Palo Alto Teen Arts Council's open mic nights, Battle of the Bands and other local gigs around the Bay Area.\r\n\r\n[caption id=\"attachment_74673\" align=\"alignright\" width=\"326\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10370561_1010207329005614_470440216_n1.jpg\"><img class=\" wp-image-74673\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10370561_1010207329005614_470440216_n1.jpg\" alt=\"Wang and Garduño pose for a selfie while listening to friends who are in the band &quot;Forever For a Second.&quot;\" width=\"326\" height=\"440\" \/><\/a> Wang and Garduño show their excitement by posing for a selfie while listening to friends who are in the band \"Forever For a Second.\" Photo by Sally Wang.[\/caption]\r\n\r\nTheir music is a combination of indie and electronic, also known as electro indie.\r\n\r\nThe first song titled “&amp;” provides listeners with a simple melody with vocals by Wang. The lyrics send the message to be yourself and not care about what others think of you. \"&amp;\" captures the essence of a short and sweet song, but with a big message.\r\n\r\nThe album continues, with the next song, “i miss you.” The song is a personal story of Paper Islands that they wanted to share with the public. The track uniquely incorporates a real-life breakup phone call between a girl leaving for college and her then-boyfriend and emphasizes the obstacles of having a long-distance relationship.\r\n\r\nThe conversation, according to Garduño, was recorded through a phone conference with permission. It's full of emotion and all about the true feelings one gets when one has to let go to someone special in one's life. The song is enhanced by sounds of the airport at the beginning and end of the song along with the phone conversation. Wang does an excellent job vocally, showcasing the emotions of desperation and sadness through her voice, to capture and embody what one feels during a breakup.\r\n\r\nThe final song, titled “Survive” was written and produced with Paly senior Will Kast. “Survive” is the perfect ending to the duo’s EP album. The hook is sampled from the National Nuclear Emergency Alert, which one would hear if the United States was under nuclear attack. To dramatize the song, a beat instantly drops once the message is over, and Wang's vocals comes in with the beat. Even though the EP was released only a week ago, I've already found myself singing and humming along to the catchy tune.\r\n\r\n&nbsp;\r\n\r\n[caption id=\"attachment_74563\" align=\"alignnone\" width=\"640\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-11.png\"><img class=\"size-full wp-image-74563\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-11.png\" alt=\"Paper Islands performs on Sept. 5 at the Lucie Stern Community Center put on by Teen Art's Council. Photo by Adele Bloch. \" width=\"640\" height=\"360\" \/><\/a> Paper Islands performs on Sept. 5 at the Lucie Stern Community Center put on by Teen Art's Council. Photo by Adele Bloch.[\/caption]\r\n\r\nThe overall theme of the album is the \"songs of the sea,\" which matches perfectly with the name of the duo, Paper Islands, and the title “Striped Sea EP.\" According to Wang and Garduño, they feel a connection to the calmness, mystery and beauty of the ocean. Wang adds that the ocean's constant changes inspire the duo's music.\r\n\r\nThe EP can be played and downloaded above from the bandcamp, with a set-your-own price policy. If you would like to make a donation to Paper Islands enter as much as you would like donate, or simply enter zero to download for free. To stay posted and updated with Paper Islands check out their <a href=\"https:\/\/www.facebook.com\/paperislands\">Facebook<\/a>, <a href=\"https:\/\/soundcloud.com\/paper-islands\">Soundcloud<\/a> and <a href=\"https:\/\/www.youtube.com\/user\/paperislands\">Youtube<\/a>.\r\n\r\nPaper Islands' next event is at 7 p.m. on Oct. 15 at <a href=\"http:\/\/angelicasllc.com\/event.cfm?id=175963\">Angelicas<\/a> in Redwood City.","excerpt":"The local duo Paper Islands debuted its first extended play album titled \"The Striped Sea EP\" last week, providing listeners with an edgy take on the unique genre of electro indie music.","date":"2014-09-25 13:33:12","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10676540_703591269710036_1277732310_o.jpg","categories":["Entertainment","Spotlight"],"tags":{"29374":"andrew lu","29168":"duo","29375":"electro indie","29163":"ep","13032":"fabian garduno","29376":"paper islands","29378":"sally wang","29377":"the striped sea ep","29379":"will kast"}},{"id":74693,"title":"Spirit Dance practice schedule","permalink":"http:\/\/palyvoice.com\/2014\/09\/24\/spirit-dance-practice-schedule\/","content":"<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/2870679-untitled-infographic\" width=\"600\" height=\"1031\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nPalo Alto High School's Spirit Week dance practices begin tomorrow for all four grades in different locations and times throughout the day.\r\n\r\nTomorrow, the Class of 2018 will practice during Lunch in the Dance Studio, 2015 during Advisory in the Dance Studio, 2017 after school in the Dance Studio and 2016 after school on the Lacrosse Field.\r\n\r\n\"Everyone should want to join the dance because it's a really good representation of how unified your class is,\" junior Spirit Commissioner Emma Cole said. \"The class that can rally the most dancers is certainly a class to be respected.\"\r\n\r\nStudents may join the dance team, as long as they <a href=\"http:\/\/palyvoice.com\/2014\/09\/05\/spirit-dance-to-undergo-major-changes\">fulfill the requirement<\/a> of attending at least four hours of dance practice. Any signs of exclusivity results in automatic disqualification from participation in the dancefor a team or its members.\r\n\r\n\"We're not putting up with any coldness this year,\" Cole said. \"Spirit Week is about having fun and building class unity.\"\r\n\r\nChoreographers decide how the time is spent during each practice. <\/span>They may also arrange practices outside of school, according to Cole.\r\n\r\n\"We advise them to spend it [dance practice time] wisely since some dancers may only be spending four hours learning a four-and-a-half minute dance,\" Cole said.\r\n\r\nFor specific rules regarding Spirit Dances, click <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxwYWhzYXNifGd4OmEyOWU3NTliNzUzYzk2Mg\">here.","excerpt":"Times, dates and locations of all Spirit Dance practices for all grades.","date":"2014-09-24 23:19:31","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/CH6A6918.jpg","categories":["News"],"tags":{"11286":"big gym","8626":"dance","29305":"dance studio","9795":"freshman","8816":"junior","29304":"lacrosse field","27705":"october","29300":"practice","29302":"schedule","9085":"senior","29303":"september","29306":"small gym","29301":"sophomore","9764":"spirit","9780":"spirit dance","9119":"Spirit Week"}},{"id":74476,"title":"Opinion: The Fault in Our Entertainment","permalink":"http:\/\/palyvoice.com\/2014\/09\/24\/opinion-the-fault-in-our-entertainment\/","content":"<em><span style=\"color: #3e454c;\">Following a new entertainment trend set by the novel \"The Fault in Our Stars\" and its movie adaptation, a new TV show gives viewers a questionable image of a cancer patient's life.<\/span><\/em>\r\n\r\n[caption id=\"attachment_74709\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Untitled-2.jpg\"><img class=\"size-full wp-image-74709\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Untitled-2.jpg\" alt=\"In the new Fox dramedy &quot;Red Band Society,&quot; Dash (Astro), Jordi (Nolan Sotillo) and Leo (Charlie Rowe) (left to right) visit their coma-stricken friend Charlie (Griffin Cluck) and talk about their current conditions. The three teens have cystic fibrosis, osteosarcoma and an amputated leg, respectively, while Charlie is in a coma for an unspecified reason. &quot;Luck isn't getting what you want,&quot; said Leo, referring to their health. &quot;It's surviving what you don't want.&quot; (FOX)\" width=\"600\" height=\"600\" \/><\/a> In the new Fox dramedy \"Red Band Society,\" Dash (Astro), Jordi (Nolan Sotillo) and Leo (Charlie Rowe) (left to right) visit their coma-stricken friend Charlie (Griffin Cluck) and talk about their current conditions. The three teens have cystic fibrosis, osteosarcoma and an amputated leg, respectively, while Charlie is in a coma for an unspecified reason. \"Luck isn't getting what you want,\" said Leo, referring to their health. \"It's surviving what you don't want.\" Photo courtesy of <a href=\"http:\/\/www.fox.com\/red-band-society\/\">FOX.<\/a>[\/caption]\r\n\r\nI’d be lying if I claimed to be an expert on the topic of cancer and the many debilitating life changes that stem from the disease. But with the recent rise of cancer-based movies and TV shows, I feel like I have a pretty good understanding of what Hollywood thinks it’s like to live with cancer:\r\n\r\nYou live a pretty decent life. You get diagnosed with cancer. You feel like your life is over. You suddenly appreciate life so much more now that you know your days are numbered. You die a tragic, beautiful death.\r\n\r\nThe summer blockbuster “The Fault In Our Stars,” based on the soul-wrenching young-adult novel by John Green, spotlighted the topic of cancer and became the trailblazer for several other shows revolving around cancer and similar life threatening diseases.\r\n\r\nDon’t get me wrong. I thoroughly enjoyed the ups and downs of the Hazel-Gus timeline in “TFIOS;\" it’s the unrealistic portrayal of the disease from the shows that succeed it that confounds me.\r\n\r\nIt’s great that mainstream entertainment is bringing attention to such a serious issue, but the border-line glamorization of cancer is getting out of hand.\r\n\r\nSpecifically, the new Fox dramedy “Red Band Society,” which premiered at 9 p.m. last week, gives viewers a questionable image of life with serious medical issues. This new series tells the story of a diverse group of teen hospital patients bound together by the common trait of being seriously ill. (“The Breakfast Club” much?)\r\n\r\nThese teens try to make the best of their not-so-glamorous life at the hospital, smoking pot in deserted rooms and buying alcohol underage. In one scene of the pilot episode, they throw a “goodbye party” for the leg of a surgery-bound teen, practically singing Kumbaya in a circle on the hospital rooftop. Granted, there are a few touching moments, like when the one-legged main character tearfully reminisces his presurgery life or when the sharp-tongued nurse shows compassion by ordering pizza for one of the kids. (It’s a long story.) For the most part, “Red Band Society” is a heart-warming series but there is definitely room for improvement in terms of the plot line.\r\n\r\nWhat this show — like a couple others — fails to touch on is the painful side of cancer. Shows focus on cliché aspects such as love triangles, friend drama and other basic components of a hit teen story instead of bringing light to the reality of the situation. The colossal range of emotions, the sporadic feelings of nausea, the hair\/weight\/appetite loss, the seemingly endless tests and the side effects of whatever medication a patient needs to take may all be a part of a cancer patient’s life — a part that is not included in the said TV show. While it’s okay that producers hold an optimistic view, the show’s misleading take on life with cancer raises eyebrows.\r\n\r\nAs the narrator of “Red Band Society” so brilliantly says, “Everybody thinks that when you go to a hospital, life stops. But it’s just the opposite — life starts.” The TV show makes it seem like having a serious illness is a great life changing experience. It gives the perception that having cancer is a blessing in disguise, a way for people to truly understand the meaning of life. People need to understand that their “life” can “start” even without being diagnosed with a life-threatening illness and being chained to a hospital bed.\r\n\r\nCancer is not beautiful. Cancer is not the ID that lets you get past the bouncer of the exclusive learn-the-value-of-life club. Cancer should not be romanticized. And most of all, the gravity of cancer should not be downplayed simply for the sake of appealing to teenagers across the nation.","excerpt":"A summer blockbuster pioneers a new genre in mainstream entertainment. Read on to find out how the recent approach may be faulty.","date":"2014-09-24 21:27:00","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/red-band-society.jpg","categories":["Opinion","Spotlight"],"tags":{"29183":"cancer","29181":"john green","29182":"red band society","29184":"television","29180":"the fault in our stars"}},{"id":74525,"title":"School board to discuss library renovation design","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/school-board-to-discuss-library-renovation-design\/","content":"[caption id=\"attachment_74576\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png\"><img class=\"wp-image-74576\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png\" alt=\"Screen Shot 2014-09-20 at 9.51.58 PM\" width=\"600\" height=\"349\" \/><\/a> The renovated Palo Alto High School library will retain its foundational exterior design, while bringing major changes to the interior, according to the <a href=\"http:\/\/pausd.org\/community\/board\/downloads\/brd_packet\/item_013.pdf\">PAUSD Board of Education meeting agenda<\/a>. The distinctive change in glass exterior walls will allow natural light, something that is absent in the current library, according to Librarian Rachel Kellerman. \"I'm most looking forward to the natural lighting,\" Kellerman said. \"We're trying to be as green as possible in the design, and this is a big part of that.\" Illustration courtesy of DLM Architecture.[\/caption]\r\n\r\nBond Program Manager Bob Golton will present revised conceptual designs of the Library Renovation Project for Palo Alto High School at 9:35 p.m. tonight at the Palo Alto Unified School District Board of Education meeting.\r\n\r\nThe design of the new library includes a renovation of the entire 500 building, moving the Guidance Office as well as the College and Career Center to create a 'Campus Hub' of learning at Paly, according to the <a href=\"http:\/\/pausd.org\/community\/board\/downloads\/brd_packet\/item_013.pdf\">meeting agenda<\/a>.\r\n\r\nLibrarian Rachel Kellerman explained that the renovated building will promote a center for various student activities at the core of the campus.\r\n\r\n[caption id=\"attachment_74577\" align=\"alignright\" width=\"412\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.32.16-PM.png\"><img class=\"wp-image-74577 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.32.16-PM.png\" alt=\"Screen Shot 2014-09-20 at 9.32.16 PM\" width=\"412\" height=\"405\" \/><\/a> The proposed library plan will include collaboration rooms as well as a 'maker space' to promote innovative learning. Illustration courtesy of  DLM Architecture.[\/caption]\r\n\r\n\"The idea is that this is the hub of student activity, interaction and information,\" Kellerman said. \"It's got a lot going on, not just the library. The students activities office will also be here, which is great because it will go directly out to the Quad where they do a lot of activities. There will also be a maker space  in the back that teachers can book online for their classes, so that will be an interesting work space where students and teachers can come together in this facility.\"\r\n\r\nThe building will be separated by glass walls on the interior and the exterior to allow natural light into the building and long views out onto the Quad. The library will also include an upper level mezzanine and collaboration spaces for both students and teachers.\r\n\r\nAccording to Kellerman, the library design was developed after extensive research to provide for future demands.\r\n\r\n\"We've been working on the designs for a couple of years,\" Kellerman said. \"It's very well researched. We've looked at many libraries all the way from high school to colleges to public libraries to make sure we have everything we need not necessarily now, but moving forward into the future.\"\r\n\r\nThe board will also discuss the proposed project budget and the authorization to proceed with schematic design, which the Bond Program plans to propose in December 2014 or January 2015. The overall expense of this project adds up to $9.35 million, which will come from the Strongs Schools Bond passed in June 2008.\r\n\r\nAccording to Assistant Principal Jerry Berkson, the library is set to move into the 700 building before the planned 13 month-long construction begins in June 2016.\r\n\r\n\"Most likely, the library will be moved to the 700 building,\" Berkson said. \"We'll have to wait for the gym to be done because PE [physical education] is moving there now.\"\r\n\r\n[caption id=\"attachment_74584\" align=\"alignleft\" width=\"437\"]<img class=\"wp-image-74584\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-23-at-5.02.31-PM.png\" alt=\"Screen Shot 2014-09-23 at 5.02.31 PM\" width=\"437\" height=\"254\" \/> Guidance Office and the College and Career Center will move to the 500 building, allowing space for a Meeting Room and Alumni Room respectively in the Tower Building, according to the board meeting agenda. Illustration courtesy of DLM Architecture.[\/caption]\r\n\r\nAccording to Berkson, the library construction is dependent on the gym construction because of the limited substitute space. This poses a threat to the planned construction time as the recent delay in the gym construction has pushed back its proposed finishing date to Dec. 2016.\r\n\r\nThe board will vote to approve the conceptual design, budget and contract for the schematic design in the next meeting on Oct. 7 at the PAUSD office.","excerpt":"The Strong Schools Bond Program will present revised conceptual designs for the 500 building, including a new library and collaboration spaces.","date":"2014-09-23 18:44:31","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png","categories":["News","Spotlight"],"tags":{"29186":"500 building","8458":"administration","21437":"bond","29193":"budget","8558":"campus","9678":"career","8570":"center","8604":"college","29189":"conceptual","8616":"construction","29188":"design","8748":"Guidance","29191":"hub","8848":"Library","25038":"McGee","29190":"mezzanine","8912":"new","29192":"office","9681":"PLAN","11895":"plans","9021":"quad","29187":"renovation","9069":"School Board","9177":"tower building"}},{"id":74598,"title":"Deadline for dropping a class Oct. 9","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/deadline-for-dropping-a-class-oct-9\/","content":"","excerpt":"","date":"2014-09-23 17:47:04","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8589":"class","8636":"deadline","29215":"drop","8658":"dropping"}},{"id":74529,"title":"Liveblog: Paly girls&#8217; volleyball takes on rival in first game of season","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/live-blog-paly-girls-volleyball-takes-on-rival-in-first-game-of-season\/","content":"[caption id=\"attachment_74618\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg\"><img class=\"size-full wp-image-74618\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg\" alt=\"Palo Alto High School girls' volleyball team cheers in their huddle right before their first league game against rival, Gunn High School. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> Palo Alto High School girls' volleyball team cheers in their huddle right before their first league game against rival Gunn High School. Photo by Amy Leung.[\/caption]\r\n\r\n<em>Check back at 7 p.m. tonight for live coverage of Palo Alto High School girls' volleyball's first league game against Gunn High School.<\/em> [liveblog]","excerpt":"Check back at 7 p.m. tonight for live coverage of Palo Alto High School girls&#8217; volleyball&#8217;s first league game against Gunn High School.","date":"2014-09-23 14:56:02","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg","categories":["Sports"],"tags":{"8734":"girls","11244":"girls volleyball","8751":"gunn","27175":"live","8855":"liveblog","9216":"volleyball"}},{"id":74415,"title":"Girls&#8217; volleyball to play first season game against crosstown rival","permalink":"http:\/\/palyvoice.com\/2014\/09\/22\/girls-volleyball-to-play-first-season-game-against-crosstown-rival\/","content":"[caption id=\"attachment_74472\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg\"><img class=\"wp-image-74472\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg\" alt=\"The Palo Alto High School girls' volleyball team discusses season plans before practice. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> The Palo Alto High School girls' volleyball team discusses season plans before one of their first practices of the season in the Paly gym. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School girls' volleyball team (10-3, 0-0) will play its crosstown rival Gunn High School (5-3, 0-0) in its first league game tomorrow at Gunn.\r\n\r\n“The first [league] match is always exciting,” sophomore setter Jessica Lee said. “Playing Gunn is always a fun game because of the team rivalry.”\r\n\r\nSenior captain and outside hitter Jade Schoenberger agreed with Lee.\r\n\r\n“I’m always excited for Gunn because both teams want to win so bad, mainly for bragging rights,” Schoenberger said.\r\n\r\nEven so, Schoenberger says that she holds no strict expectations for the outcome.\r\n\r\n“I can’t predict how we’re going to do,” Schoenberger said. “If we play our game, we’ll be fine and hopefully pull out a win.”\r\n\r\nLee expresses concern after junior middle blocker Claire Dennis badly sprained her ankle during last Monday's practice.\r\n\r\n“Not having Claire Dennis will be a little more difficult because she’s our tallest player and main blocker,” Lee said. “We are definitely going to miss her on the court, but we aren’t going to let that affect our playing.”\r\n\r\nSo far, the team has only lost to Sacred Heart Prep, Pleasant Grove and Acalanes in both the Deer Valley and Harbor tournaments on Sept. 13 and Sept. 20, respectively.\r\n\r\nAcross town, Gunn senior captain and setter Nicole Brigham expressed their concerns about strong Paly players.\r\n\r\n“We are looking out for Jade [Schoenberger] — she is one of their strongest hitters,” Brigham said. “So we are going to put a good block up on her.”\r\n\r\nEven though key players Keri Gee, Lauren Kerr, Sarah Limb and Becca Raffel all graduated last year, Schonenberger still has high hopes for an exciting season.\r\n\r\n“The loss of last year’s seniors was a bummer — they were all so talented,” Schonenberger said. “But some younger players on the team have really stepped up this year, so I’m confident we will have a fun season, win or lose.”\r\n\r\nWatch the game at 6:45 p.m. tomorrow at Gunn or read The Paly Voice's live blog.","excerpt":"The girl's volleyball team will play Gunn High School in its first game of the season. ","date":"2014-09-22 21:56:53","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg","categories":["Sports"],"tags":{"10618":"first game","11244":"girls volleyball","8751":"gunn","9880":"jade schoenberger","8809":"jessica lee","11391":"new season","29185":"rivals","9216":"volleyball"}},{"id":73691,"title":"What is WASC?","permalink":"http:\/\/palyvoice.com\/2014\/09\/21\/what-is-wasc\/","content":"[caption id=\"attachment_74102\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg\"><img class=\"wp-image-74102\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg\" alt=\"Teacher on Special Assignment Eric Bloom talks to a group of teachers during a WASC meeting. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> Teacher on Special Assignment Eric Bloom talks to a group of teachers during a WASC meeting with the School Culture sub-group. Photo by Amy Leung.[\/caption]\r\n\r\nRecently, students have been taking a WASC survey in their English classes. But many students find themselves wondering: what is WASC?\r\n\r\nAccording to the Palo Alto High School WASC Coordinator and Spanish teacher Emily Garrison, WASC stands for the Western Association of Schools and Colleges.\r\n\r\n“WASC is a non-profit organization,” Garrison said. “It works very closely with the California Department of Education, but it doesn’t have any other affiliations besides that really.”\r\n\r\nWhat exactly does WASC do then?\r\n\r\n“In order to make your transcript valid for college, we have to be WASC accredited,” Garrison said. “Everybody wants to have WASC accreditation because basically what that says is the coursework, what’s happening on campus, is valid.”\r\n\r\nThe surveys administered in English classes provide guidance for improving the school.\r\n\r\n“At the end of the year, we’re going to be done with one of our six-year cycles, and the reviews that students have done are going to be part of the process that we go through in deciding how well the school has done and where we can move on from this point,” said junior Molly Kraus, a member of the student WASC group.\r\n\r\n“Our job is to do two things — what’s Paly doing really well?” Garrison said. “We really are an amazing school. But with any school, or with any student or any person, even if that person is amazing, there’s still always things that you can improve upon. So that’s the second part of WASC.”\r\n\r\nCurrently, the Paly WASC group is finishing up the last cycle and starting a new one, according to Garrison. Students, parents and staff discussed the big pictures of what’s going on at Paly at the most recent focus group meetings.\r\n\r\n“We really analyze that [information] and we think about it,\" Garrison said. \"Then what we’re going to do is put it in a much larger context and say OK, we want to try to focus in on three to five major goals. We don’t know what those are yet — we’re not quite there yet, but we’ll be there soon. In the next month or so, those goals should be developed.\"\r\n\r\nAfter creating these goals, Garrison says that the next step is a commitment to working towards those objectives for the next six years until the next WASC cycle. For the time being, the group is gathering as much data as possible.\r\n\r\n“All this stuff we’re doing right now goes into a big report that’s probably going to be about 300 pages long,\" Garrison said. \"It’ll be finished probably by the end of December. And then that whole report of those two big pieces — what does Paly look like and then how can we improve — that can then get sent to WASC.”\r\n\r\nAfter reading the Paly WASC report, WASC will send a team in early March to validate the information.\r\n\r\n“They [WASC] are here to help support us,\" Garrison said. \"And they’re going to be on campus, they’re going to be in classes, they’re going to want to talk to students.”\r\n\r\nGarrison says that this month will be important for WASC updates because it's the starting point for the new cycle of this upcoming year.\r\n\r\n\"In the next month, things are really going to start getting interesting with WASC,\" Garrison said. \"We just want to make things better for students.\"","excerpt":"WASC is beginning its new six-year cycle this upcoming school year. Read more to find out what WASC is.","date":"2014-09-21 13:27:05","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg","categories":["Features","Uncategorized"],"tags":{"27775":"emily garrison","13035":"molly kraus","11646":"survey","27774":"WASC"}}]