[{"id":71017,"title":"Swimming towards CCS","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/swimming-towards-ccs\/","content":"As the swim season comes to a strong close, the Palo Alto High School swim team will compete against Gunn High School at 4 p.m. today at Gunn.\r\n\r\nAfter coming off a Thursday win against Los Gatos for the boys' team and a loss for the girls', both of the teams look to score well at the Central Coast Section Championships.\r\n\r\nPaly senior and swim co-captain Caroline Moser admits that although the team is relatively young compared to previous years, it has been performing well.\r\n\r\n[caption id=\"attachment_54515\" align=\"alignright\" width=\"436\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg\"><img class=\" wp-image-54515\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg\" alt=\"Paly Boy's swimming pose with each other after winning second at CCS in 2013. Photo by Sam Kelley.\" width=\"436\" height=\"325\" \/><\/a> Paly Boys swimming pose with each other after winning second at CCS in 2013. Kevin Bowers, Ethan Look, Alex Francis, Bo Fields, Andrew Liang, Andrew Cho, Willy Lee, Omri Newman and Bret Pinksker are all smiles after the victory. Photo by Sam Kelley.[\/caption]\r\n\r\n\"<span class=\"Apple-style-span\" style=\"color: #3e454c;\">The final score was 94-92, with Los Gatos taking the win, but our freshmen and sophomore class has really stepped up this season in both leadership and work ethic,\" Moser said. <\/span>\r\n\r\nSenior and co-captain for boys swimming, Omri Newman, is happy with his team's performance and development.\r\n\r\n\"I think the major improvement from last season in my opinion is the work ethic and morale of the team,\" Newman said. \"It's clear that the guys care about what we are trying to accomplish, and everyone has set goals they are working for.\"\r\n\r\nThe team's first meet, which was the Spring Invite held back in March, helped show off the Vikings' potential. The boys' team beat Saint Francis, 216-180, and the girls fell to Monta Vista 177-154.\r\n\r\nBoth Moser and Newman agree that their coach Danny Dye has stepped up and showed commitment to both teams.\r\n\r\n\"He has performed as expected but also has improved as a coach,\" Newman said. \"He talks about evolving with the team, and I feel he has been putting an effort in doing so, as well as succeeding in it.\"\r\n\r\n<span style=\"color: #3e454c;\">\"I've been with Danny for four years and this is the first time I've seen him fully involved with our team,\" Moser said. \"We even did a team bonding event with him.\"<\/span>\r\n\r\nEarlier in the season, the Paly team gained confidence when the boys beat defending CCS champions Monta Vista and the girls' team placed in second.\r\n\r\n\"The girls still feel positive about their meet and their chance to win the league championship come the end of the year,\" Dye reflected in a <a href=\"http:\/\/www.palyswim.com\/2014\/03\/boys-improve-to-4-0-while-the-girls-go-to-3-1-against-monta-vista\/\">blog post<\/a> after the meet.\r\n\r\n&nbsp;","excerpt":"As the swim season comes to a strong close, the Palo Alto High School swim team will compete against Gunn High School at 4 p.m. today at Gunn.","date":"2014-05-01 18:55:20","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/05\/Paly-Voice-swimming.jpg","categories":["Sports","Sports Recap"],"tags":{"15679":"alex francis","15680":"andrew cho","11364":"andrew liang","15683":"bo fields","15682":"brett pinsker","15678":"ethan look","15677":"kevin bowers","8923":"Omri Newman","8944":"palo alto high school","15610":"paly swimming","9120":"sports","9143":"Swimming","15681":"willy lee"}},{"id":71016,"title":"May Fete Parade to march through Palo Alto","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/may-fete-parade-to-march-through-palo-alto\/","content":"[caption id=\"attachment_71277\" align=\"alignright\" width=\"375\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-1.56.43-PM.png\"><img class=\"wp-image-71277\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-1.56.43-PM.png\" alt=\"The annual May Fete Parade will be held on Saturday from downtown Palo Alto to Heritage Park. This is the ninety-second annual parade and the parade is the oldest children's parade in Northern California. Picture by the City of Palo Alto.\" width=\"375\" height=\"306\" \/><\/a> The annual May Fete Parade will be held on Saturday from downtown Palo Alto to Heritage Park. This is the ninety-second annual parade, making it the oldest children's parade in Northern California. Picture by the City of Palo Alto.[\/caption]\r\n\r\nPalo Alto will host its 92nd annual May Fete Parade starting at 10 a.m. on Saturday, May 3 at University Avenue and Emerson Street.\r\n\r\nThe May Fete Parade and Faire are popular events among the citizens of Palo Alto. The Parade is the oldest children’s parade in Northern California. This year’s theme for the event is “Let Me Be Your Neighbor,” according to parade event planner Ali Williams.\r\n\r\nAll of the public middle and high schools of Palo Alto are performing in the parade. During the parade, multiple groups will be marching through the streets, including the Viking Pep Band from Palo Alto High School. The Viking Pep Band will be playing the song “In the Stone” by Earth, Wind &amp; Fire, according to band member and junior Andrew Lu.\r\n\r\n“We’ve got tons of spirit when it comes to playing outside,” Lu said. “We’ll do yells and cheers, and we have the signature kick during the drum cadence.”\r\n\r\nWhile Lu has participated in the Parade in past years for the marching band, he has also attended the event with his family when he was younger, according to Lu.\r\n\r\n“It’s a really great community event [and] brings everyone in town together,” Lu said. “The groups are diverse, ranging from musicians to martial artists to middle schoolers who’ve built go-carts at school.”\r\n\r\nDuring the parade, eight floats are going to compete for the Palo Alto Weekly Awards, along with clowns, stilt walkers, hula artists and other entertainers who will participate in the parade. Different schools, youth groups, dance teams and sports teams will also march in the parade, according to Williams.\r\n\r\n“Numerous preschool groups and elementary schools are joining the fun to show school pride,” Williams said. “The parade kicks off with the motorcycle police and ends with the shiny fire engine.”\r\n\r\nAlong with those showing their spirit for the town, there will also be groups who are promoting their organization. The Palo Alto Children’s Theater will be promoting their upcoming performance and the Humane Society will be walking through the parade, showcasing local pets in need. Representatives from the Palo Alto Historical Association will also be riding in the antique cars from the Museum of American Heritage to celebrate its one hundredth anniversary.\r\n\r\nThe parade will end at around noon at Heritage Park, where the May Fete Faire will begin. At the park, all of the bands will perform as they arrive. The Faire will also have food trucks and games, according to Williams.\r\n\r\nWilliams stressed the importance of community building within the city.\r\n\r\n“[The event is] a community event that celebrates all that we strive in Palo Alto,” Williams said. “What’s important is that it’s a place where people care and connect with each other to create a supportive community.”\r\n\r\nFor more information on the event, click <a href=\"www.cityofpaloalto.org\/gov\/depts\/csd\/events\/parade.asp\">here<\/a>.<b> <\/b>","excerpt":"The Palo Alto City will host its ninety-second annual May Fete Parade starting at 10 a.m. on Saturday, May 3 at University and Emerson Street.","date":"2014-05-01 14:46:36","author":"Julianna Heron","categories":["News"],"tags":{"15095":"fair","15099":"float","15097":"heritage","15098":"heritage park","15093":"may fete","15096":"museum","15094":"parade"}},{"id":71222,"title":"Slideshow: Underclassmen dominate powderpuff","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/slideshow-underclassmen-dominate-powderpuff\/","content":"The annual powderpuff games started yesterday with the seniors against the freshmen. The freshmen won with a score of 7-0. Today, the sophomores went up against the juniors, winning with a score of 21-0. Tomorrow is an alternate schedule for a long lunch so that the freshmen and sophomores can play each other for the champion title on the soccer field.\r\n\r\n[slideshow post_id=71222]","excerpt":"The annual powderpuff games started yesterday with the seniors against the freshmen. The freshmen won with a score of 7-0. Today, the sophomores went up against the juniors, winning with a score of 21-0. Tomorrow is an alternate schedule for a long lunch so that the freshmen and sophomores can play each other for the champion title on the soccer field.","date":"2014-05-01 14:40:19","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0723.jpg","categories":["Multimedia","Spotlight"],"tags":{"8574":"Championships","8714":"football","15846":"powderpuff","15848":"soccer field","15847":"tackle"}},{"id":71120,"title":"Track and field races to the finish line","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/track-and-field-races-to-the-finish-line\/","content":"The Palo Alto High School track and field teams are looking to win their upcoming meet at 3:15 p.m. today at Milpitas High School and prepare for post-season meets after a challenging season performance.\r\n\r\nThe Paly boys (1-4) are currently in sixth place in the De Anza League after their only win against Los Altos High School (3-2), while the girls' team (3-2) holds a fourth place position. The Milpitas boys' team (0-5) is in seventh, and the girls (1-4) are in fifth.\r\n\r\nSophomore sprinter Eli Givens believes the team will build off of the momentum gained from its recent win against Los Altos.\r\n\r\n\"We all did a good job of making our way up to where we are now,\" Givens said. \"We're all going to do pretty well because it's the last meet, so we're all going to have that feeling that we need to give it our all.\"\r\n\r\nAccording to sophomore mid-distance runner Portia Barrientos, the girls' team plans on changing up its lineup to give athletes the opportunity to try out new events.\r\n\r\n\"Milpitas as a team is not as strong as the other teams that we've had meets against, so at this meet, we're having people try different events to see if we can get different results,\" Barrientos said.\r\n\r\nThis year, the track team has also overcome a variety of issues, such as the introduction of <a href=\"http:\/\/palyvoice.com\/2014\/03\/03\/season-preview-new-coaches-to-keep-team-on-track-and-field\/\" target=\"_blank\">new coaches<\/a>, the prevalence of injuries and the loss of senior runners. Boys' head coach Kelsey Feeley reflected on the regular season regarding the team's recovery.\r\n\r\n\"For the most part, everyone's healthy now,\" Feeley said. \"That was definitely a big issue at the beginning of the season – people coming off of injuries or getting injured.\"\r\n\r\nBarrientos noted that injuries have hindered the girls' season.\r\n\r\n\"On the girls' side, a lot of injuries have gotten in the way of our runners' performances,\" Barrientos said. \"It's really hard to come back from injuries.\"\r\n\r\nDespite the loss of seniors, the team has had to count on the younger runners this year, according to Feeley.\r\n\r\n\"Mostly on the boys' side, it was a big rebuilding year,\" Feeley said. \"We lost a lot of talented boys to graduation last year – more or less our jumping and sprinting crew – but we've had some kids really step up when they needed to, fill in spots and rise to the occasion.\"\r\n\r\nA lack of throwers has also contributed to a difficult season, according to senior captain Nick Sullivan.\r\n\r\nHowever, Feeley is confident about the team's trajectory concerning post-season meets, including leagues, Santa Clara Valley Athletic League and Central Coast Section events.\r\n\r\n\"I feel great going into leagues,\" Feeley said. \"Both of our relays are pretty solid right now, especially our 4x400 [relay], and we even have a few alternates for those races.\"\r\n\r\nFeeley believes that the following meets will give runners the opportunity to shine after a season of hard work.\r\n\r\n\"Individually, we have a lot of kids who are peaking at the right time,\" Feeley said. \"For the older kids, it's a time for them to show what they've been working at all season and will be a good practice for upcoming meets after leagues, such as SCVAL and CCS, and even States for some kids.\"","excerpt":"The Palo Alto High School track and field teams are looking to win their upcoming meet at 3:15 p.m. today at Milpitas High School and prepare for post-season meets after a challenging season performance.","date":"2014-05-01 14:39:18","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/04\/track5.jpg","categories":["Sports"],"tags":{"15412":"de anza","15411":"leagues","8889":"milpitas","8944":"palo alto high school","15101":"season update","9120":"sports","9181":"track","9183":"track and field"}},{"id":71274,"title":"Badminton Preview: Paly seeks to defeat Gunn a second time","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/badminton-preview-paly-seeks-to-defeat-gunn-a-second-time\/","content":"Palo Alto High School’s badminton team (3-5) will face its cross-town rival Henry M. Gunn High School today in the Big Gym at Palo Alto High School.\r\n\r\nAccording to sophomore and mixed doubles player Alby Leng, the competition between the Gunn and Paly badminton teams this season has been more heated than usual due to an unexpected upset.\r\n\r\n“The reason there is a rivalry this season is because we beat them them [Gunn] when we weren't supposed to,\" Leng said.\r\n\r\nDefeating Gunn, one of the highest ranked teams in the league, served as an important turning point in the Viking’s season. Paly is still currently unseeded, but doing much better than expected, according to sophomore player Angus Huang.\r\n\r\n“We still have quite a few games to play, but as long as we don’t lose them, the upper league’s opinion of our badminton team will change for the better,” Huang said.\r\n\r\nIn addition to winning their last matchup against Gunn, Viking morale has increased after winning their last fews matches and has helped the team develop and really mesh together, according to Leng.\r\n\r\n“Players on varsity tend to talk with each other a lot more now [compared to earlier in the season],” Leng said.\r\n\r\nThe Vikings will face the Titans at 3:30 p.m. today in the Big Gym at Palo Alto High School.","excerpt":"Palo Alto High School’s badminton team (3-5) will face its cross-town rival Henry M. Gunn High School today in the Big Gym at Palo Alto High School.\r\n","date":"2014-05-01 14:02:37","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_4.jpeg","categories":["Sports"],"tags":{"15905":"badminton","15410":"game","8751":"gunn","8953":"paly","9012":"preview"}},{"id":70304,"title":"Feature: Radio journalism joins ranks of Paly publications","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/feature-radio-journalism-joins-ranks-of-paly-publications\/","content":"[caption id=\"attachment_71205\" align=\"alignleft\" width=\"226\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Round-Radio.png\"><img class=\"wp-image-71205\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Round-Radio.png\" alt=\"Paly Radio Club strives to create a professional-grade broadcast with help from KZSU. Photo provided by Creative Commons.\" width=\"226\" height=\"226\" \/><\/a> Paly Radio Club strives to create a professional-grade broadcast with help from KZSU. Photo provided by Creative Commons.[\/caption]\r\n\r\nOne would have to be living under a rock to not notice the plethora of award-winning publications that grace Palo Alto High School campus. We have everything from a newspaper (The Campanile) to a foreign policy magazine (Agora) and everything in between. So what's next for Paly journalism? A radio show?  A news program via a complicated combination of carrier pigeons, smoke signals and morse code? Hint: it's the first one.\r\n\r\nPaly sophomores Zoe Limbrick, Maya Kandell and Esme Ablaza, along with the help of KZSU, Stanford's own radio channel, are working together to create Paly's very first audio publication.\r\n\r\nAccording to Limbrick, it was Kandell who first thought of the idea last semester while taking Beginning Journalism.\r\n\r\n\"The idea was brought up last semester sometime during Beginning Journalism, and then Maya [Kandell] contacted me shortly after to see if I was interested,\" Limbrick said.\r\n\r\nThe idea took off from there as the girls formed an official club with English teacher Lucy Fillipu as the advisor, as well as contacted KZSU.\r\n\r\n\"Six of us took a class to get air cleared at KZSU and they've been really supportive to help us get a show,\" Limbrick said.\r\n\r\nThe members of Radio Club have been working on straightening out the logistics of their new publication.\r\n\r\n\"We're going to loosely base our meetings off of a production cycle for a publication. We're going to work on story ideas and develop them during our meeting times,\" Limbrick said. \"Then we can conduct the actual interviews and do the initial editing outside of class. Our meetings will mostly be spent on creating the ideas and editing the stories.\"\r\n\r\nRadio Club's first broadcast was Sunday, April 13. Eventually, Limbrick and the others hope to have a fully-functioning publication to stand alongside the ranks of the rest of the Paly journalism program.\r\n\r\n\"We just want to produce a successful and professional show each week,\" Limbrick said.\r\n\r\nInterested in the club? Limbrick assures that it is not too late to sign up and participate.\r\n\r\n\"We're really welcoming for anyone who wants to join and you don't have to have any experience with radio or journalism,\" she said.","excerpt":"Paly sophomores Maya Kandell, Zoe Limbrick and Esme Ablaza, along with the help of KZSU, Stanford's own radio channel, are working together to create Paly's very first audio publication. \r\n","date":"2014-05-01 13:09:54","author":"Paige Esterly","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Round-Radio.png","categories":["Features"],"tags":[]},{"id":71143,"title":"Voice Verbatim: What are your opinions on the Los Angeles Clippers&#8217; owner&#8217;s racist remarks?","permalink":"http:\/\/palyvoice.com\/2014\/05\/01\/voice-verbatim-what-are-your-opinions-on-the-los-angeles-clippers-owners-racist-remarks\/","content":"Los Angeles Clippers' owner Donald Sterling recieved a lifetime ban from the National Basketball Association over racist remarks he made that were recently released to the public, according to the NBA. The Paly Voice asked Palo Alto High School students and teachers what thoughts they have about the scandal involving Clippers' owner Donald Sterling. Check the video below.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/E_Wvu-Yz158?list=UUVOXMqsivga_Tqan2Iuqr6w\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asked Palo Alto High School students and teachers what thoughts they have about the scandal involving Clippers' owner Donald Sterling. Check the video below.","date":"2014-05-01 12:35:17","author":"Edward Mei","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-01-at-12.31.11-PM.png","categories":["Multimedia","Spotlight"],"tags":{"15673":"clippers","15675":"donald sterling","15674":"nba","15676":"racist","9201":"verbatim"}},{"id":71141,"title":"Feature: The “shark fetus guy”","permalink":"http:\/\/palyvoice.com\/2014\/04\/30\/feature-the-shark-fetus-guy\/","content":"Collecting has the ability to connect people. It brings people together by giving them a common goal as they strive to find dollar coins, rare postage stamps, out-of-print comic books or whatever else they fancy. Collectors rejoice with each new addition to their collections and take pride in showing off their finds.\r\n\r\n[caption id=\"attachment_71172\" align=\"alignright\" width=\"336\"]<img class=\"wp-image-71172 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose1.png\" alt=\"alexrose1\" width=\"336\" height=\"448\" \/> Palo Alto High School sophomore Alex Rose proudly holds his prized shark fetus that started his interest in collecting animal taxidermies and also earned him a unique nickname. Throughout his life, Rose has been called multiple nicknames, including Rosy (for his rosy cheeks after Physical Education class), “the Costco guy” (when he used to share his lunch in elementary school) and now is known as “the shark fetus guy.” “I like being the guy with all the nicknames,” he said. Photo by Bethany Wong.[\/caption]\r\n\r\nFor Palo Alto High School sophomore Alex Rose, the thrill comes from collecting objects that surprise people. Everything in his collection screams unusual, whether it be a prickly dead pufferfish, a puzzle box that seems to have no obvious opening, a miniature model of a Volkswagen car or even the seemingly ordinary ring around his finger.\r\n\r\nAt first glance, the ring, a woven tangle of sterling silver strands, looks like any other piece of jewelry. As Rose slides it off and performs a complicated algorithm, the ring detaches into eight separate hoops, revealing that this is actually a puzzle ring.\r\n\r\nAccording to Rose, his love for collecting oddities fits nicely with his love of meeting and befriending other people because items like the ring are perfect conversation starters.\r\n\r\n“I collect oddities ... because I want people to remember me for owning them,” Rose said.\r\n\r\nBy most standards, Rose’s collection is indeed memorable. People who see his shelves are especially drawn to the display of animal taxidermies such as a frog, various animal brains and a unique shark fetus.\r\n\r\n“His friends ... think his shelf is super original and fun,” Rose’s girlfriend sophomore Hannah Subega said. \"There's always something there for his friends to look at.”\r\n\r\nRose’s interest for collecting animal preserves began when he received a shark fetus from Subega’s younger brother, the previous owner. According to Subega, Rose was the ideal recipient of the shark fetus because he, unlike others, did not cringe at the sight of the unborn shark.\r\n\r\n“I wasn't too surprised that Alex was glad to take it off my brother's hands,” Subega said.\r\n\r\nAccording to Subega, the shark fetus used to be a Christmas gag gift that was regifted yearly, but “luckily, we [Subega’s family] found someone who actually wants it,” Subega said.\r\n\r\nAlthough Rose now collects objects that can make people scream with disgust, when he first began collecting as an Escondido Elementary School student, Rose collected more ordinary items.\r\n\r\nIn elementary school, the pockets of his cargo pants held all the crystals, rocks, seashells, watches and coins he brought to school to show his friends, according to Rose.\r\n\r\n“I wore cargo pants ... because I could fill the pockets with stuff,” Rose said.\r\n\r\nIf Rose could not carry all the knick-knacks in his pockets, he kept them at home in a box which he called his “special things box.” Originally, Rose said the box contained a small conglomeration of puzzles, such as uncommon Rubik’s cubes. However, once his father began bringing home souvenirs from his business trips, the items found a new home in a larger container.\r\n\r\n[caption id=\"attachment_71169\" align=\"alignleft\" width=\"255\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose4.png\"><img class=\"wp-image-71169\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose4.png\" alt=\"alexrose4\" width=\"255\" height=\"340\" \/><\/a> Rose devotes twelve full shelves to his collection with separate shelves for his animal display, Rubik’s cubes, puzzles and French antiques. His collection has outgrown the box he once used – his “special things box\" – and has become a striking ceiling-floor display. Photo by Bethany Wong.[\/caption]\r\n\r\nIn eighth grade, Rose moved into a new bedroom that featured a set of empty shelves on which he started displaying his favorite collections.\r\n\r\nWhen people complimented him on his shelf, Rose found that he enjoyed watching their reactions. Particularly, Rose said that he has always appreciated the way his eccentricities have earned him nicknames.\r\n\r\n“In fifth grade, people called me 'the Costco guy,'” Rose said. “I would hand out parts of my entire lunch [like Costco food samples] to my friends because it gave me attention.”\r\n\r\nLong gone are the days of being jokingly associated with the food sample dispensers at Costco. Today, Rose is better known as a collector of oddities.\r\n\r\nOn a vacation in Paris during the summer of 2012, Rose’s collection grew immensely. While the rest of his family wanted to shop for clothing, Rose preferred to scrounge through the antique shops. It was on this trip that he realized that accumulating oddities could actually become a rewarding hobby.\r\n\r\n“I spent all my money on these outrageous antiques, such as pickle flavored toothpaste, an optical illusion that looks like a melting clock, puzzle boxes and a Frankenstein-like figurine with parts from a baby doll, a skull face, a crown and a rib cage, but it was so worth it,” Rose said.\r\n\r\nAccording to Rose, his most prized piece from Paris is a crystal that shows the face of a clock from one side and looks like a compass from the other side.\r\n\r\nHaving depleted his spending money in Paris, Rose slowed down on his collecting spree once he returned to Palo Alto. Consequently, his family thought his collecting was just a temporary obsession, according to Rose.\r\n\r\n“My family thought it was pretty amusing and didn’t think I was serious,” Rose said\r\n\r\nHowever, everything changed on Christmas Day of his freshman year when he opened a present from Subega’s brother. Noticing Rose’s fascination with trinkets like his puzzle ring, the brother gave Rose a bottle containing a shark fetus that still had its eyes covered with skin. Rose said this gift rekindled his passion for collecting.\r\n\r\n[caption id=\"attachment_71171\" align=\"alignleft\" width=\"261\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose2.png\"><img class=\"wp-image-71171\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose2.png\" alt=\"alexrose2\" width=\"261\" height=\"347\" \/><\/a> Rose’s shark fetus, preserved in a glass bottle, rests on one of the shelves directly at eye level. The shark fetus, young enough to still have its eyes covered with skin, was given to Rose as a Christmas present. “I’ll always remember this gift as the beginning of an addiction,” Rose said. Photo by Bethany Wong.[\/caption]\r\n\r\nAccording to Rose, he had never been this excited about a gift before.\r\n\r\nHe soon discovered a television program called “Oddities,” which showcased animal taxidermy collectors’ items like pig fetuses and double-headed monkeys. This program sparked Rose’s passion for finding more animal parts that make people’s eyes boggle with both gruesome interest and fascination, according to Rose. His collection now includes a diverse range of animal parts and preserves.\r\n\r\n<span class=\"Apple-style-span\" style=\"font-weight: 800;\">\"<\/span>Here are my brains,” Rose said, as he pointed to snake, rabbit, frog and bird brains sitting on a shelf.\r\n\r\nNowadays, Rose basks in the attention he gets from being known as the “shark fetus guy.”\r\n\r\n“I like it when people are able to say, ‘I remember Alex Rose. He’s the guy with the shark fetus,’” Rose said.\r\n\r\nOver time, Rose realized that part of what inspires him to keep collecting is the satisfaction of learning the story behind each item.\r\n\r\nAccording to Rose, he likes being able to say, “This isn't only a ring, but a ring that is also a puzzle.”\r\n\r\nRose delights in seeing the others’ reactions when they find out that his ring is a more than what meets the eye. With eyes aglow, Rose explains the historical significance of puzzle rings. In medieval times, kings gave their wives the puzzle rings as wedding bands, according to Rose. If a wife cheated on her husband and wanted to remove the ring, the ring would fall apart and the king would know his wife had been disloyal.\r\n\r\n“I enjoy surprising people with something they wouldn’t expect,” Rose said.\r\n\r\nDespite his interest in oddities, it is very unlikely for his collecting to become his future career, Rose said.\r\n\r\n[caption id=\"attachment_71170\" align=\"alignleft\" width=\"289\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose3.png\"><img class=\"wp-image-71170 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose3.png\" alt=\"Rose’s puzzle ring lies on a table showing its two different forms. Rose frequently wears his puzzle ring because it serves as a great way to begin a conversation. The ring was a gift from Rose’s girlfriend, Hannah Subega. Photo by Bethany Wong.\" width=\"289\" height=\"217\" \/><\/a> Rose’s puzzle ring lies on a table in its two different forms. Rose frequently wears his puzzle ring because it serves as a great way to begin a conversation. The ring was a gift from Rose’s girlfriend, Hannah Subega. Photo by Bethany Wong.[\/caption]\r\n\r\n“It is a very expensive hobby, no doubt,” Rose said. “I think it [my collection] will just be the kind of thing I keep in the office, not a professional career.”\r\n\r\nAccording to Rose, he is more inclined to pursue a career in application development and dreams of one day starting his own technology business. Regardless of what career path he chooses, Rose says he believes he will find a way to engage his appreciation of creativity and his love of the bizarre.\r\n\r\nRose carries his love for trinkets wherever he goes. He always has his daily essentials: his phone, his wallet and two to three trinkets that might be handy conversation starters.\r\n\r\n“I never leave the house without full pockets,” Rose said.\r\n\r\n&nbsp;","excerpt":"While many students engage in more \"normal\" hobbies, sophomore Alex Rose finds gratification in collecting oddball trinkets and novelties.","date":"2014-04-30 18:23:43","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-Shot-2014-04-30-at-5.52.16-PM.png","categories":["Features","Spotlight"],"tags":{"15665":"alex rose","15667":"collection","15668":"collector","15670":"hannah subega","15669":"oddities","8944":"palo alto high school","15671":"personality profile","15666":"shark fetus guy","15672":"trinkets"}},{"id":71119,"title":"Missed opportunities send Vikings to fourth straight loss; Wildcats clinch division title","permalink":"http:\/\/palyvoice.com\/2014\/04\/29\/missed-opportunities-send-vikings-to-fourth-straight-loss-wildcats-clinch-division-title\/","content":"[caption id=\"attachment_71122\" align=\"alignnone\" width=\"618\"]<img class=\"size-full wp-image-71122\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/baseballrecaplosgatos.png\" alt=\"The Lone Viking: Right fielder Phil Lewis (#25) watches dolefully as Los Gatos celebrates it’s De Anza division title following a 4-3 win in extra innings over Paly. Photo by Josh Yuen. \" width=\"618\" height=\"464\" \/> The Lone Viking: Right fielder Phil Lewis (#25) watches dolefully as Los Gatos celebrates its De Anza division title following a 4-3 win in extra innings over the Vikings Saturday at Paly. Photo by Josh Yuen.[\/caption]\r\n\r\nDespite multiple chances to take the lead late in the game, the Palo Alto High School Vikings varsity baseball team (11-12, 5-5) fell once again to the Los Gatos Wildcats (20-4, 11-1) in extra innings by a score of 4-3 Saturday at Paly.\r\n\r\nThe Wildcats finished with 14 hits, scoring early in the second inning on Campbell Robertson’s sacrifice fly. They battered Vikings starter Brian Kannappan in the fourth, when they took advantage of a throwing error by scoring two runs. While Los Gatos threatened to score in the later innings, pitchers Justin Hull and Chris Smith of the Vikings used key strikeouts and timely double plays to prevent the Wildcats from scoring any more.\r\n\r\nThe Vikings squandered several opportunities to score runs and win the game, but got on the scoreboard in the third when right fielder Phil Lewis hit a sharp ground-ball to the left of shortstop to score center fielder Bowen Gerould.\r\n\r\nIn the fifth inning, Lewis advanced Gerould to second on a single after Gerould chased starter Johnny Breidenthal by drawing a walk. A wild pitch set up both runners in scoring position, and Cleasby proceeded to score Gerould on an RBI single to center field. Cleasby later came around to score on a wild pitch by the new pitcher Bigge, tying the game at three apiece.\r\n\r\nThe sixth and seventh innings featured the Vikings getting runners on base, only to have Bigge pitch out of each jam and keep the game tied. With runners at second and third with just one out in the seventh, Bigge got catcher Austin Kron to ground-out softly, before striking out third baseman Noah Phillips.\r\n\r\nWhen Robertson, the Wildcats’ no. 8 hitter in the lineup, stepped into the box to lead off the top of the eighth inning, his one goal was to get on base and represent the go-ahead run. Robertson, a senior, was yet to hit a home run on the season coming into the at-bat. The entire Wildcats’ team had only two total coming into Saturday’s game.\r\n\r\n“I looked down at my third base coach and he said that [he] was just giving me the sign to get on base, so I was just trying to get on base,” Robertson said.\r\n\r\nWith the wind blowing out towards left, Robertson ended up drilling Bicknell’s fastball over the left field fence to give his team a one-run lead. Clapping his hands as he rounded third, the team rushed out of the dugout to greet him at home plate.\r\n\r\n“In the eighth, I thought I made a good pitch and he got down to it and hit it out,” Bicknell said, after taking the loss.\r\n\r\nPitcher Hunter Bigge closed out the game with a shut-down bottom of the eighth, securing his team the one-run victory. When Gerould was tagged out at first to end the game, the Wildcats poured onto the diamond once again, mobbing Bigge and crushing him under a dog-pile of ecstatic players. To the great dismay of the Vikings home crowd, the Wildcats had clinched the division title.\r\n\r\n“We’ll go out and celebrate a little, come back, get back to work, keep winning, and now we’re looking forward to the league tournament now,” said Robertson, who finished with a team-leading three RBI’s.\r\n\r\nEven an extra fly-ball or a ball put into play past the pitcher was the difference between a Vikings win or loss. According to designated hitter Lawrence Han, the team played well against the division’s top team, but ultimately made a few too many mistakes.\r\n\r\n“I think we played pretty well but we just had a few bad breaks and there were some things that could have gone our way but didn’t,” Han said.\r\n\r\nWith just two games remaining on the schedule and a four-game losing streak, the Vikings find themselves sitting in fifth place, one spot outside the playoffs. They take on the Spartans of Mountain View next week, looking to get back to their winning ways.\r\n\r\n&nbsp;","excerpt":"Despite multiple chances to take the lead late in the game, the Palo Alto High School Vikings varsity baseball team (11-12, 5-5) fell once again <a href=\"http:\/\/palyvoice.com\/2014\/04\/29\/missed-opportunities-send-vikings-to-fourth-straight-loss-wildcats-clinch-division-title\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-04-29 13:05:06","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/baseballrecaplosgatos.png","categories":["Sports","Spotlight"],"tags":{"8410":"Baseball","15410":"game","9914":"los gatos","8953":"paly","9210":"vikings"}},{"id":71095,"title":"Paly students to compete in app showcase","permalink":"http:\/\/palyvoice.com\/2014\/04\/26\/paly-students-to-compete-in-app-showcase\/","content":"<p>[caption id=\"attachment_71102\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg\"><img class=\"wp-image-71102\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg\" alt=\"Students from Palo Alto High School are going to take part in the Applications Challenge Showcase finals tomorrow at the Palo Alto Arts Center. Photo by Julianna Heron.\" width=\"350\" height=\"283\" \/><\/a> Students from Palo Alto High School are going to take part in the Applications Challenge Showcase finals tomorrow at the Palo Alto Arts Center. Photo by Julianna Heron.[\/caption]<\/p>\r\n<p>Students from Palo Alto High School are participating in the Applications Challenge Showcase finals with the ClickPA Mobile app. The showcase will take place from 1 p.m. to 4 p.m. tomorrow at the Palo Alto Art Center.<\/p>\r\n<p>ClickPA Mobile is an app where teenagers can pull up events and activities to do around the city, according to app team member  junior Fabian Garduño.<\/p>\r\n<p>“We [the ClickPA team] put all the events and opportunities in Palo Alto for teens in one easy, one-stop place,” Garduño said. “We basically funnel all teen events in the area.”<\/p>\r\n<p>The Paly students who are a part of making the app are juniors Charlie Mihran, Ryan Huang, Fabian Garduño, Bryan Wong and Charles Yu. There are also some students from Gunn High School who are a part of the ClickPA Mobile team.<\/p>\r\n<p>ClickPA Mobile is in the finals against nine other applications. The other applications in the competition vary in function from showing people where the nearest parking space is to helping dog owners communicate about dog-related activities. While the team is up against some competition, it is hoping to do well in the Showcase, according to Garduño.<\/p>\r\n<p>“I think we have a very good chance of winning, but I'm not getting my hopes up too high,” Garduño said.<\/p>\r\n<p>The ClickPA Mobile team has been working on the application for a couple of months, but the idea originally came from the group’s <a href=\"clickpa.org\">website<\/a>.<\/p>\r\n<p>To learn more about the ClickPA Mobile team, click <a href=\"www.youtube.com\/watch?v=4wJbd72nW_k\">here<\/a>.<\/p>\r\n","excerpt":"Students from Palo Alto High School are participating in the Applications Challenge Showcase finals with the ClickPA Mobile app. The showcase will take place from 1 p.m. to 4 p.m. tomorrow at the Palo Alto Art Center.","date":"2014-04-26 17:19:26","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg","categories":["News"],"tags":{"8488":"applications","15397":"applications challenge showcase","15394":"apps","15396":"clickpa","15395":"clickpa moile","13032":"fabian garduno","11979":"hack","15393":"showcase"}}]