[{"id":76377,"title":"Girls&#8217; volleyball to play Dig Pink match","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/girls-volleyball-to-play-dig-pink-match\/","content":"[caption id=\"attachment_76411\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg\"><img class=\"size-full wp-image-76411\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg\" alt=\"Junior Claire Krugler, sophomore Katie Passarello, senior Molly Fogarty, and alumna Becca Raffel sit in assistant coach Jekara Wilson-Gaines's pink car during last year's Dig Pink event. Dig Pink matches include more decorations and  than normal games. Photo courtesy of Molly Fogarty.\" width=\"600\" height=\"480\" \/><\/a> Junior Claire Krugler, sophomore Katie Passarello, senior Molly Fogarty and alumna Becca Raffel (left to right) sit in assistant coach Jekara Wilson-Gaines's pink car during last year's Dig Pink event. Dig Pink matches include more decorations and exciting activities than normal games. Photo courtesy of Molly Fogarty.[\/caption]\r\n\r\nPalo Alto High School's girls' volleyball team (15-8, 1-5) will play Los Altos High School (21-3, 6-0) in its third annual Dig Pink match 6:45 p.m. tomorrow at Los Altos.\r\n\r\nAccording to the press release, Dig Pink aims to promote breast cancer awareness as well as raise money to fund research to find a cure. This event donates money to the Side-Out Foundation, a non-profit organization that advocates breast cancer awareness through volleyball.\r\n\r\nPaly has collaborated with Los Altos for the last two years, and has raised over $4,600 total through the previous annual events, according to the press release.\r\n\r\nSenior outside hitter Hayley Poore said that there are multiple ways that Dig Pink raises money.\r\n\r\n\"<span style=\"color: #3e454c;\">We have a bake sale during the game and sell baked goods, water, and t-shirts,\" Poore said. \"All the money we raise from that goes to the Side-Out foundation. We also collect cash and check donations at the match, or people can donate directly to the Side-Out foundation online.\"<\/span>\r\n\r\nThis year, the coordinators decided to fund-raise a little differently.\r\n\r\n<span style=\"color: #3e454c;\">\"We used to count digs and people could make a pledge to donate per dig, but most people preferred to just pick a specific amount of money to donate,\" Poore said. \"This year, we are not going to be tying donations to the number of digs.\"<\/span>\r\n\r\nWhile this match is scored like a normal game, it's much more exciting, according to Poore.\r\n\r\n<span style=\"color: #3e454c;\">\"It is a regular league match, but the gym is decorated in pink, students perform the National Anthem, in between sets the Los Altos dance team performs, and the game will be filmed by Cal-Hi Sports,\" Poore said.<\/span>\r\n\r\nAccording to sophomore setter Julie Chandler, the teams have fun with this event by dressing up.\r\n\r\n\"We wear the Dig Pink shirts and pink ribbons, and so does the other team,\" Chandler said.\r\n\r\nIn addition to the important charity event, the game will be exciting as Los Altos is one of the strongest teams in the league, according to Poore. Although their last meeting resulted in a Paly loss, Chandler hopes to fight hard this game.\r\n\r\n\"Last time against Los Altos we had a slow start, which made it harder for us to win,\" Chandler said. \"If we can have a strong start and play as a team, we can compete with them and do well.\"\r\n\r\nAccording to Chandler, Los Altos senior Carmen Annevelink will be a huge threat. She committed to UC Berkeley in November of her junior year to play volleyball, according to Annevelink.\r\n\r\n\"A key player to look out for on the other team is Carmen, their big outside hitter,\" Chandler said. \"Getting a good block up on her will be really important.\"\r\n\r\nDespite the strong opposing team, Poore expresses her excitement for the Dig Pink match.\r\n\r\n<span style=\"color: #3e454c;\">\"It's a great way to help a good cause,\" Poore said. \"Lots of people show up and it's fun to see everyone in pink.\"\r\n<\/span>\r\n\r\nClick <a href=\"https:\/\/www.side-out.org\/cb\/campaigns\/campaign\/9095\" target=\"_blank\">here<\/a> to donate to Paly's campaign.","excerpt":"Palo Alto High School girls' volleyball is playing Los Altos High School in the third annual Dig Pink event to raise breast cancer awareness and money for research.","date":"2014-10-15 19:31:33","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg","categories":["Sports"],"tags":{"29491":"breast cancer awareness","30048":"carmen annevelink","8642":"Dig Pink","8725":"fundraiser","11244":"girls volleyball","30049":"hayley poore","30050":"julie chandler","9849":"los altos"}},{"id":76174,"title":"Voice of the Week: James Franco","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/voice-of-the-week-james-franco\/","content":"<i>The Paly Voice and the <a href=\"https:\/\/soundcloud.com\/palyradio%20\">Paly Radio Club<\/a> met up with celebrity alumnus James Franco to discuss his murals on Paly's student center, his love for academic environments and whether he would prefer bananas for feet or for hands.<\/i>\r\n\r\n[caption id=\"attachment_76211\" align=\"alignnone\" width=\"445\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.25.08-PM.png\"><img class=\"wp-image-76211\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.25.08-PM.png\" alt=\"The mural painted by actor and alumnus James Franco is inspired by photos from Palo Alto High School’s 1993 yearbook, when Franco was a freshman. On the right lies the original yearbook photo where &quot;Mike Smith throws one of many touchdown passes.&quot; On the left lies James Franco's mural of the image that is now painted on the exterior of the Student Center. Photo by Adele Bloch and Ana Caklovic.\" width=\"445\" height=\"254\" \/><\/a> The mural painted by actor and alumnus James Franco is inspired by photos from Palo Alto High School’s 1993 yearbook, when Franco was a freshman. Right: The original yearbook photo in which “Mike Smith throws one of many touchdown passes.” Photo by Madrono Staff. Left: James Franco’s mural of the image that is now painted on the exterior of the Student Center. Photo by Adele Bloch.[\/caption]\r\n\r\nThe Paly Voice\/Paly Radio Club: What prompted you to paint this mural?\r\n\r\nJames Franco: I have done a lot of work with writing and artwork and even films that are inspired by teenagers or coming of age, and because I went to Paly, this is my main source of reference for this time. I just liked them [the photos in his freshman yearbook in 1993] because when they were in the yearbook, they were just photos of people going to school. But as time goes by, at least for me, my high school years became this weird mythical place. When I was a teenager, it seemed like I felt so much; everything seemed so important and there was so much pressure of all kinds and I was experiencing certain things for the first time. And so, the paintings, for me at least, captured that. Even though they're just paintings of a football game or a volleyball game or The Campanile, to me it evokes the feelings of that time. ... Instead of rebuilding a part of Paly, I could show the art work that was inspired by Paly at Paly.\r\n\r\nPV\/RC: Did your high school and your youth tend to have a big influence on your work?\r\n\r\nJF: It [high school] continues to inspire me. When I focus in on high school, the characters for me are much more alive in some ways than older characters. When you get older, you get a little bit more set in your ways. But when you're young, your life is still ahead of you. You haven't made all your most serious decisions about life yet and you're discovering things for the time. I just find that those kind of characters are the most alive when you work with them.\r\n\r\nPV\/RC: What's it like coming back to Paly and seeing everything again?\r\n\r\nJF: I love school, and I love being around academic environments. Woj [journalism teacher Esther Wojcicki] and I are even talking about a class that I might teach here in a year [at Paly]. I love it here. When I was in high school, I had a bit of a hard time, but I was just figuring out who I was. But now I love coming back.\r\n\r\n[caption id=\"attachment_76215\" align=\"alignnone\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.31.07-PM.png\"><img class=\"wp-image-76215\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.31.07-PM.png\" alt=\"Screen Shot 2014-10-14 at 6.31.07 PM\" width=\"393\" height=\"383\" \/><\/a> Franco signs his name and class graduation date on the mural that he painted on the outside of the Student Center. “We wanted to tie it [the mural] in as something that was cool to look at and something that people could feel proud to have as a part of their campus,” Franco’s art studio manager Anna Kooris said.[\/caption]PV\/RC: What first got you interested in being an actor and being a part of the entertainment industry?\r\n\r\nJF: I've always loved movies and theater. When I was at Paly, I'd drive to San Francisco to see ACT [American Conservatory Theatre] productions. I'd see David Stratton do the \"Tempest\" there, and I think I saw \"Phantom of the Opera\" there, and \"Chicago\" and stuff like that. That was the only thing that was offered around here. And I've loved it for a long time, but I was very shy. And then in my senior year, I joined the drama class and I did two plays. ... Then I went to UCLA. Once I was in LA and I saw that everyone was trying to get into the movies, so I decided to give it a shot.\r\n\r\nPV\/RC: Did any specific teacher help shape your dreams and plans at Paly?\r\n\r\nJF: Since Paly, I've had many very influential teachers. I've been very lucky and I've got to go to a lot of great great schools, so I've had tons of great professors. At Paly, Woj is a big influence.\r\n\r\n[caption id=\"attachment_76207\" align=\"alignnone\" width=\"430\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg\"><img class=\"wp-image-76207\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg\" alt=\"IMG_9080\" width=\"430\" height=\"286\" \/><\/a> Paly alumnus Franco and journalism teacher Esther Wojcicki pose for a selfie in honor of the completed murals. Wojcicki is one of Franco's biggest influences at Paly, and they still keep in touch. Photo by Adele Bloch.[\/caption]\r\n\r\nPV\/RC: What was your first acting job after high school?\r\n\r\nJF: I went to UCLA and after a year, I left because I wasn't in the drama program and I wanted to act. So I went to acting school, and my parents said they wouldn't support me if I didn't go to college. So, I then went and worked in the cafeteria at UCLA even though I wasn't a student and then I worked at McDonalds. And then I got a Pizza Hut commercial – it was a Super Bowl commercial, so it paid pretty well, and it was a CG [computer generated] image of Elvis dancing in the Pizza Hut. And so it starts off with a bunch of guys in the parking lot saying, \"Hey, you heard they're selling the new deep-dish pizza at Pizza Hut, and Elvis is serving it?\" And they're like, \"No way, they don't have a deep-dish pizza.\" And then it cuts to Elvis serving a deep-dish pizza. And that was it, and then I could support myself from my acting from that point on. (Watch this commercial <a href=\"https:\/\/www.youtube.com\/watch?v=WIryAZFVKtw\">here<\/a>.)\r\n\r\nPV\/RC: Would you rather have banana hands or banana feet?\r\n\r\nJF: Oh, tricky. Like slip all over the place kind of thing?\r\n\r\nPV\/RC: No, if you just had five bananas right here on your hand jutting out?\r\n\r\nJF: But they'd break really fast.\r\n\r\nPV\/RC: I'd just like to think that they'd be ready for action as a hand or as a foot.\r\n\r\nJF: I think I use my hands more than my feet, so I'd have to do banana feet. If I got hungry, I can just eat my feet.\r\n\r\nPV\/RC: Do you have any advice for students in general or student journalists?\r\n\r\n[caption id=\"attachment_76221\" align=\"alignnone\" width=\"407\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg\"><img class=\"wp-image-76221\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg\" alt=\"IMG_9051\" width=\"407\" height=\"271\" \/><\/a> Two helpers hang up Franco's painting of a water polo player in 1993. Over 10 of Franco's paintings that are inspired from yearbook photos are spread throughout the Media Arts Center. Photo by Adele Bloch.[\/caption]\r\n\r\nJF: What I love about that class [The Campanile] is that you're in school but you're walking on something that creates a product for the school. What that means is that you are becoming aware of your readers. You aren't just writing for a grade – you're writing to get people to read it. That creates a completely different kind of relationship between you and your work, and it's on the way of creating a professional relationship with your work. So any time, if you want advice, any time you can have that situation or start to become aware of what it is you're doing or what you will be doing when you write professionally and how you're connecting to your audience is really valuable.\r\n\r\n<em>Franco is holding an art show and film premiere for the grand <span class=\"Apple-style-span\" style=\"color: #000000;\">opening of the Media Arts Center from 5 p.m. to 8 p.m. on Saturday, Oct. 18. Tickets can be bought <a href=\"http:\/\/www.eventbrite.com\/e\/james-franco-art-showfilm-debut-palo-alto-high-media-arts-celebration-registration-13079118997\">here<\/a>.<\/span><\/em>","excerpt":"The Paly Voice and the Paly Radio Club met up with celebrity alumnus James Franco to discuss the mural he painted on Paly's student center, his love for academic environments and whether he would prefer banana feet or banana hands.","date":"2014-10-15 18:30:47","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg","categories":["Spotlight","Voice of the Week"],"tags":{"29992":"franco","29991":"james","8801":"james franco","8904":"mural","8939":"palo alto","10258":"voice of the week"}},{"id":76363,"title":"Slideshow: Paly volleyball takes on Mountain View","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/slideshow-paly-volleyball-takes-on-mountain-view\/","content":"The Palo Alto High School Vikings (15-8, 1-5) fell to the Mountain View High School Spartans (15-8, 3-3) in five sets, 21-25, 25-18, 21-25, 25-16 and 7-15. They will face the best league-record team Los Altos High School at 6:45 p.m. on Thursday on the road for the annual <a href=\"http:\/\/palyvoice.com\/?p=76377&amp;preview=true&amp;preview_id=76377&amp;preview_nonce=a727d7ea46\">\"Dig Pink\"<\/a> event that raises breast cancer awareness.\r\n\r\n[slideshow post_id=76363]\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Vikings (15-8, 1-5) fell to the Mountain View High School Spartans (15-8, 3-3) in five sets, 21-25, 25-18, 21-25, 25-16 and 7-15. They will face Los Altos High School at 6:45 p.m. on Thursday on the road.","date":"2014-10-15 17:13:41","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0875.jpg","categories":["Slideshow","Sports","Spotlight"],"tags":{"8770":"home","30009":"mountian view","8965":"paly volleyball","9107":"slideshow","9216":"volleyball"}},{"id":76153,"title":"What do I do on College And Career Awareness Day?","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/what-do-i-do-on-college-and-career-awareness-day\/","content":"Confused about what exactly each grade is doing tomorrow during College and Career Awareness Day? Worry no more, The Paly Voice is here to help you figure it all out.\r\n\r\nPalo Alto High School students will participate in their respective grades' college preparatory-related activities for College and Career Awareness Day tomorrow, with changes from last year and juniors still taking the <span style=\"color: #000000;\">Preliminary SAT\/National Merit Scholarship Qualifying Test.<\/span>\r\n\r\nThis year, the College and Career Awareness Day has been changed because of the discontinuation of the ACT Plan and ACT Explore tests.\r\n\r\nIn the past, freshmen would take the Explore test, sophomores would take the Plan test, juniors would take the <span style=\"color: #000000;\">Preliminary SAT\/National Merit Scholarship Qualifying Test®<\/span> and seniors would have college preparation workshops. Because the SAT is planned to change for the Class of 2016, the practice tests are no longer being given.\r\n\r\nInstead, freshmen and sophomores now have two seminars with their teacher advisers about career exploration and planning. Guidance counselor Charles Taylor says the goal this year was to try and find seminars that kept the theme of college and career awareness, in the place of taking practice tests.\r\n\r\nTaylor says that the senior workshops have been very successful in the past and they wanted to continue with them. However, Ann Deggelman, coordinator of the TA program, says a financial literacy session has been added to the senior workshops based on surveys from seniors in the past. Financial Literacy will teach students about checkbooks and bank accounts and other life skills, Deggelman says.\r\n\r\nFor seniors, some workshops will be held during both sessions and you can chose which workshops would be most beneficial. College Application Help is a general question session for seniors who still are confused on certain parts of the application process. The UC and CSU session goes over the differences in these two applications and the best way to go about these applications. College Essay help has group review and teacher review of college essays for a variety of opinions in order to obtain the best college essay.\r\n\r\nSome workshops are only offered during one session such as the new financial literacy workshop. Other one session workshops are helping with college interviews or figuring out if community college is the right option.\r\n\r\nMany seniors have been debating the importance of College and Career Awareness Day, but some are certain of its significance.\r\n\r\n“I would like to go to the College and Career [Awareness] Day because I think it will make me more aware of the college process,” senior Jack Brook said.\r\n\r\nThe full list of events for tomorrow can be found <a href=\"http:\/\/paly.net\/news\/college-and-career-awareness-day-october-15\">here<\/a>.","excerpt":"Palo Alto High School students will participate in their respective grades' college preparatory-related activities for College and Career Awareness Day tomorrow, with changes from last year as freshmen and sophomores will now attend college and career exploration pathways.","date":"2014-10-14 21:52:35","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9984.jpg","categories":["News"],"tags":{"9678":"career","8604":"college","29990":"college and career awareness","29217":"psat"}},{"id":76160,"title":"PTSA to host social justice presentation","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/ptsa-to-host-social-justice-presentation\/","content":"[caption id=\"attachment_76164\" align=\"aligncenter\" width=\"583\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg\"><img class=\" wp-image-76164\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg\" alt=\"Students watch Global Lives videos after school in the MAC. The video exhibit, which will be running Oct. 13-18, features footage of ordinary people from 17 different countries. Photo by Jeanette Wong.\" width=\"583\" height=\"437\" \/><\/a> Students watch the Global Lives videos, which feature rare, unedited footage of ordinary people around the world, after school in the Palo Alto High School Media Arts Center. The video exhibit, which will be running Oct. 13-18, is part of the Global Lives Project's overall promotion to reshape how we conceive cultures outside our communities. Photo by Jeanette Wong.[\/caption]\r\n\r\nThe Parent Teacher Student Association will host a presentation on the new Social Justice Pathway at 7:45 p.m. tomorrow in the Palo Alto High School Media Arts Center.\r\n\r\nSocial Justice Pathway teachers Eric Bloom and Erin Angell will speak on social justice and how social justice is used at Paly. The pathway is a three-year program geared towards students interested in \"empowerment, convinction and the passion to build a better world,\" according to the <a href=\"http:\/\/www.palysocialjustice.blogspot.com\/\">Paly Social Justice Pathway blog<\/a>. The website also states that the pathway is a new program implemented this school year.\r\n\r\nThe full event begins at 7 p.m., which gives visitors a chance to <a href=\"http:\/\/palyvoice.com\/2014\/09\/25\/local-nonprofit-invites-community-to-step-out-of-your-world\/\">view the Global Lives Project exhibit<\/a> before the presentation. Following the presentation, there will be a question and answer session on the topics of Global Lives and social justice. At the end of the program, attendees will have a chance to try food from a variety of places.\r\n\r\n<span style=\"color: #000000;\">The Global Lives Project aims to \"explore the diversity of human experience ... and encourage discussion, reflection, and inquiry about the wide variety of cultures, ethnicities, languages, and religions on this planet,\" according to its <\/span><a href=\"http:\/\/globallives.org\/about\/overview\/\">official website<\/a>.\r\n\r\nAttendees are encouraged to bring specialty desserts from their cultures, such as egg custard tarts from Hong Kong or baklava from Greece, according to the Yael Irom, Assistant Director of the Global Lives program.\r\n\r\n“I’m glad that we have this event,” sophomore Jenny Zhuge said. “It’s really cool that people are bringing food from different places.”","excerpt":"The Parent Teacher Student Association will host a presentation on the Social Justice Pathway at 7:45 p.m. tomorrow in the Palo Alto High School Media Arts Center.","date":"2014-10-14 18:24:28","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg","categories":["News"],"tags":[]},{"id":76129,"title":"Volleyball Liveblog: Paly vs. Mountain View","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/volleyball-liveblog-paly-vs-mountain-view\/","content":"<em>Palo Alto High School's volleyball team will take on Mountain View at 6:45 p.m. in the Big Gym. Check back then for live coverage. <\/em>\r\n\r\n[liveblog]","excerpt":"Palo Alto High School's volleyball team to take on Mountain View at 6:45 in the Big Gym. Check back then for live coverage. ","date":"2014-10-14 13:33:05","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg","categories":["Sports"],"tags":{"29989":"mountain view","10021":"paly sports","9216":"volleyball"}},{"id":76049,"title":"Campus is canvas for celebrity alum James Franco","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/campus-is-canvas-for-celebrity-alum-james-franco\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_76075\" align=\"alignnone\" width=\"608\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-13-at-6.18.34-PM1.png\"><img class=\"wp-image-76075\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-13-at-6.18.34-PM1.png\" alt=\"Screen Shot 2014-10-13 at 6.18.34 PM\" width=\"608\" height=\"202\" \/><\/a> Both murals are inspired by photos from Palo Alto High School's 1993 yearbook, and painted on a small scale by actor and alumnus James Franco, who was a freshman in 1993. On the left is a mural of students reading the school newspaper, while on the right lies Paly football players in action during a game in 1993. People that helped with the mural include Franco, Franco's studio art designers, Advanced Placement Studio Art students and professionals from mural-painting companies in Los Angeles. Photo by Adele Bloch.[\/caption]\r\n\r\nJames Franco, Paly alumnus, actor, author and filmmaker, is spreading his art throughout Palo Alto High School's campus by painting two murals on the outside walls of the Student Center and hanging his art in the Library and Media Arts Center.\r\n<div style=\"color: #000000;\">Each black-and-white murals is based on a picture from Franco's freshman yearbook in 1993. The first mural is a group shot of students in 1993 reading the Campanile, Paly's school newspaper and Franco's high school publication, and the second is an action shot from a Paly football game.\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">\r\n<div style=\"color: #000000;\">Franco originally hand-painted each image on a smaller scale, but they have been blown up to proportionally fit the Student Center wall, which is over 10 feet tall, according to Franco's art studio manager Anna Kooris. With the help of his art studio managers, Advanced Placement Studio Art students and two professional painters who have experience painting large hand painted murals and billboards, the murals are almost complete after today's full day of work.\r\n\r\n[caption id=\"attachment_76073\" align=\"alignleft\" width=\"411\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9018.jpg\"><img class=\"wp-image-76073\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9018.jpg\" alt=\"IMG_9018\" width=\"411\" height=\"274\" \/><\/a> The original painting that Franco made was blown up to paint and proportionally fit the walls of Paly's Student Center. Photo by Adele Bloch.[\/caption]\r\n\r\n\"We decided to paint them on the Student Center because we were told that the building isn't used as much as it used to be,\" Kooris said. \"We wanted to tie it in as something that was cool to look at and something that people could feel proud to have as a part of their campus.\"\r\n\r\nIn his free time, Franco frequently paints, photographs and films, according to Kooris, and in the past, Franco has participated in solo and group art shows, including a group show at the Museum of Contemporary Art in Los Angeles. According to Kooris, he also has art galleries for his oil and acrylic paintings in New York, London and Berlin.\r\n\r\nFor the grand opening of the Media Arts Center from 5 p.m. to 8 p.m. on Saturday, Oct. 18, Franco is holding an art show and film premiere. He will have multiple paintings hung up throughout the MAC and the library, according to Kooris. Tickets for the event can be purchased <a href=\"http:\/\/www.eventbrite.com\/e\/james-franco-art-showfilm-debut-palo-alto-high-media-arts-celebration-registration-13079118997\">here.<\/a>\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"James Franco, Paly alumnus, actor, author and filmmaker, is spreading his art throughout Palo Alto High School's campus by painting two murals on the outside walls of the Student Center and hanging his art in the Library and Media Arts Center.","date":"2014-10-13 21:55:00","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-13-at-5.54.28-PM.png","categories":["News","Spotlight"],"tags":{"29994":"1993","29993":"alumus","29992":"franco","29991":"james","8801":"james franco","29995":"mural painting","29996":"murals"}},{"id":76015,"title":"New addition to Paly athletic program","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/new-addition-to-paly-athletic-program\/","content":"[caption id=\"attachment_76094\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_9896.jpg\"><img class=\"wp-image-76094\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_9896.jpg\" alt=\"New athletic trainer Kimmy Mathews helps tape freshman Mayerly Short ankle before soccer practice. \" width=\"600\" height=\"400\" \/><\/a> New athletic trainer Kimmy Mathews tapes sophomore Mayerly Short's ankle before tennis practice.[\/caption]\r\n\r\nAfter the recent departure of athletic trainer Josh Goldstein on Sept. 26,  Kimmy Mathews is taking on the role as the new athletic trainer of Palo Alto High School.\r\n\r\nA recent graduate of San Jose State University, Mathews has gained experience through the athletic program at San Jose State and through her work at a physical therapy clinic.\r\n\r\nMathews, who attended SJSU for athletic training, had the opportunity to go through a wide variety of sports medical rotations ranging from helping and working with high school athletics to assisting athletes in SJSU athletics program.\r\n\r\n\"In that program we do a bunch of different rotations,\" Matthews said. \"I was pretty much at all the sports at San Jose State including football, volleyball, soccer, baseball and softball.\"\r\n\r\nMathews also has experience at a physical therapy clinic, and was recently certified before coming to Paly.\r\n\r\n“Since the high school rotation I’ve had in my program, I’ve loved being in a high school, and I was a high school athlete myself,  it’s something I’m comfortable with,\" Mathews said.\r\n\r\nOn why she came to Paly, Mathews said, “It [Paly] seemed like a good place to work. I’ve heard a lot of good things about Paly.”\r\n\r\n<span style=\"color: #3e454c;\">For student responses to former athletic trainer Josh Goldstein's leave, click <a href=\"http:\/\/palyvoice.com\/2014\/10\/13\/athletic-trainer-moves-on-to-new-job-at-menlo-college\/\" target=\"_blank\">here<\/a>.<\/span>\r\n\r\n&nbsp;","excerpt":"Kimmy Mathews is now the new athletic trainer at Palo Alto High due to the recent departure of previous athletic trainer Josh Goldstein. ","date":"2014-10-13 21:50:13","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_9896.jpg","categories":["News"],"tags":{"29945":"athletic","29944":"kimmymathews","8912":"new","29947":"sjsu","29946":"trainer"}},{"id":75799,"title":"Athletic trainer moves on to new job at Menlo College","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/athletic-trainer-moves-on-to-new-job-at-menlo-college\/","content":"<span class=\"_5yl5\" data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$0:0\">Josh Goldstein, former Palo Alto High School athletic trainer, leaves Paly for his new job as athletic trainer at Menlo College. <\/span><\/span><\/span>\r\n\r\n<span class=\"_5yl5\" data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$8:0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$0:0\">Goldstein, who left on Sept. 26, had been working for Paly as the athletic trainer for more than five years. T<span class=\"_5yl5\" data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$8:0\">he Paly Voice asked students, \"What was your most favorite thing about Josh and what are you going to miss about him most.\"<\/span><\/span><\/span><\/span><\/span><\/span>\r\n\r\n<span class=\"_5yl5\" data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$8:0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0\"><span data-reactid=\".2em.$mid=11412813590664=23e1707b06e71a57361.2:0.0.0.0.0.0.$end:0:$4:0\"><span class=\"_5yl5\" data-reactid=\".uc.$mid=11413261651533=2d1b77375191bb0aa20.2:0.0.0.0.0\"><span data-reactid=\".uc.$mid=11413261651533=2d1b77375191bb0aa20.2:0.0.0.0.0.0\"><span data-reactid=\".uc.$mid=11413261651533=2d1b77375191bb0aa20.2:0.0.0.0.0.0.$end:0:$0:0\">For information about the new athletic trainer, click<a href=\"http:\/\/http:\/\/palyvoice.com\/2014\/10\/13\/new-addition-to-paly-athletic-program\/\"> here.<\/a>\r\n<\/span><\/span><\/span><\/span><\/span><\/span>\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/576144206121140224\" width=\"600\" height=\"450\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"Students reflect on the leave of athletic trainer Josh Goldstein. ","date":"2014-10-13 21:46:04","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/scaletowidth.jpg","categories":["Multimedia","Spotlight"],"tags":{"29942":"athletictrainer","29941":"joshgoldstein","29943":"joshthetrainer","29414":"thinglink"}},{"id":75969,"title":"Opinion: Care about the PSAT","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/opinion-care-about-the-psat\/","content":"This time of the year, all juniors are faced with the eternal question: to study for the Preliminary SAT\/National Merit Scholarship Qualifying Test® or not to study.\r\n\r\nBut what is the <a href=\"https:\/\/www.collegeboard.org\/psat-nmsqt\" target=\"_blank\">PSAT\/NMSQT<\/a>? And why does it matter?\r\n\r\nBack when we were juniors, we also had these questions. The PSAT\/NMSQT is a national test that students across the nation take, typically during their junior year. After you take the test, you receive your results, and if you score in or above the 96th percentile you could be recognized as a semifinalist at the beginning of your senior year, after which you have to submit your scores from the SAT and an essay in order to find out if you are a National Merit Scholar. This year, juniors at Palo Alto High School will be taking the PSAT on Wednesday as a part of College and Career Awareness Day.\r\n\r\nSo, what should you do about the PSAT?\r\n<ol>\r\n\t<li>The PSAT is linked to <a href=\"http:\/\/www.nationalmerit.org\/\" target=\"_blank\">National Merit Scholarships<\/a> (as the name implies), which means if you become a finalist, you could win scholarship money.<\/li>\r\n\t<li>National Merit looks good. It’s an opportunity to pad your college app with a national award. Colleges love having National Merit Scholars. Becoming a finalist means getting scholarships from <a href=\"http:\/\/www.nationalmerit.org\/Merit_Sponsor_Leaflet.pdf\" target=\"_blank\">schools like Washington University in St. Louis and Tufts University<\/a>, and even being a semi-finalist looks good.<\/li>\r\n\t<li>People who have already taken the SAT have a huge headstart.  If you are one of those people, don’t sweat it. If you aren’t, keep reading.<\/li>\r\n\t<li>You don’t have to go overboard if you want to get a good score. In Advisory, you should have received a practice PSAT packet. Do that. To be honest, over-practicing can get you too hyped up, and stressing can cause a lot of people to under-perform. Three practice PSATs are plenty.<\/li>\r\n\t<li>If you’re like the majority of Paly students who haven’t gotten started with SAT prep, the PSAT is a perfect benchmark. If you don’t care about National Merit, just go into it without studying. It can give you a good idea of the areas you’re going to need to focus on when it comes to the actual SAT. Don’t be the kid who starts studying for the SAT the week before and expects a 2400.<\/li>\r\n\t<li>If you don’t like your score, don’t worry! The PSAT is just a preliminary score. Plenty of people we know got scores they didn’t like, and ended up scoring 200 points higher on the real thing. By using the right materials (e.g. <a href=\"http:\/\/www.amazon.com\/Official-Study-Guide-Second-Edition\/dp\/0874478529\" target=\"_blank\">THE OFFICIAL BIG BLUE BOOK<\/a> and free prep questions on <a href=\"https:\/\/connection.naviance.com\/family-connection\/auth\/login\/?hsid=pahs\" target=\"_blank\">Naviance<\/a>) or by getting the right test prep (AJ tutoring anyone?), you can greatly improve your score. Remember, the SAT is not for everyone. Plenty of people don’t do well on the SAT but get a great ACT score. When results come in, compare your PSAT score to your PLAN score from sophomore year and figure out which test you want to take.<\/li>\r\n\t<li>STUDY, BUT DON’T STRESS. If you don’t get National Merit, you don’t get National Merit. Remember that only the top, top percentage of students in the nation will get it. Some top schools like Princeton and Stanford don't even care if you got National Merit or not, as long as you do well on the actual test<\/li>\r\n\t<li>If you do get National Merit, when you’re a senior, you can feel special when you get a call slip that isn’t for detention or being a hooligan.<\/li>\r\n<\/ol>\r\nGood luck you crazy kids!","excerpt":"Confused and concerned about the relevance of the upcoming PSAT? Here are some helpful tips.","date":"2014-10-13 19:19:26","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/sat-image.jpg","categories":["Opinion"],"tags":{"29937":"helpful","29217":"psat","29938":"psat\/nmsqt","29935":"sat","29936":"studying","14866":"tips"}}]