[{"id":73639,"title":"Principal reacts to jump in national rankings","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/principal-reacts-to-jump-in-national-rankings\/","content":"<iframe src=\"https:\/\/a.tiles.mapbox.com\/v4\/takaakisagawa.jgk61bdj\/attribution,zoompan,zoomwheel.html?access_token=pk.eyJ1IjoidGFrYWFraXNhZ2F3YSIsImEiOiIxem1DY0dJIn0.5jeUwOWpNXiF5YzN475s1Q\" width=\"630\" height=\"380\" frameborder=\"0\"><\/iframe>\r\nSeveral local high schools rank in <a href=\"http:\/\/www.newsweek.com\/high-schools\/americas-top-schools-2014\">Newsweek's Top High School list<\/a>. Hover over the circles to see the Beating the Odds and 2013 Top High School rankings. Map by Takaaki Sagawa using data from Newsweek.\r\n\r\nPrincipal Kim Diorio reacts positively to Palo Alto High School's recent rise in national rankings, yet sees room for improvement in decreasing the achievement gap.\r\n\r\nPalo Alto High School ranks 56th in Newsweek's 2014 Top High Schools, climbing from 161st <a href=\"http:\/\/palyvoice.com\/2013\/11\/12\/paly-climbs-up-national-high-school-rankings\/\">last year<\/a>. Paly also ranks 146th in Newsweek's new Beating the Odds ranking, which focuses on performance of socio-economically disadvantaged students.\r\n\r\nDiorio is pleased with Paly's boost in rankings.\r\n\r\n\"I'm extremely proud of our school, especially the students and staff,\" Diorio said. \"With over 20,000 public high schools in the United States, it is quite an honor to be selected in the top 100.  Of course, in my personal opinion, Paly ranks number one.\"\r\n\r\nHowever, Diorio also hopes to make progress in regards to the ranking controlling for poverty levels.\r\n\r\n\"It is no secret that there is a significant achievement gap and opportunity gap within our district,\" Diorio said. \"We are committed to improving learning for all students and hope to see this reflected in our rankings in year to come.\"\r\n\r\nThe Top High School ranking assesses achievement scores and college readiness based on a combination of enrollment, graduation and attrition rates, ratio of counselors to students and weighted AP\/IB\/SAT\/ACT composite scores, with two new factors and different weights from the assessment of the previous year, <a href=\"http:\/\/www.newsweek.com\/methodology-newsweeks-top-high-school-rankings-268773\">according to Newsweek<\/a>.\r\n\r\nThis significant change in the methodology as well as lack of data for other schools in the nation caused the jump in rankings for Paly, according to Business Development Associate at International Business Times Media Maria Bromberg.\r\n\r\n\"For our College Readiness analysis, we added two new factors and changed the weights,\" Bromberg said. \"It's important to note that while we used NCES (National Center for Educational Statistics) data for our threshold analysis, which allowed us to consider all the public high schools in the country, we could only include those schools who submitted survey data in our final rankings analysis. This could also account partially for the change in your school's rank for this year.\"\r\n\r\nThe Beating the Odds ranking assesses performance while taking into account of socio-economic statuses of students, according to Bromberg.\r\n\r\n\"We wanted to control for student poverty levels, which are known to impact students' performance in school, so we ran this separate analysis,\" Bromberg said. \"[We] measured performance while controlling for poverty levels, using the percentage of students eligible for free or reduced-price lunch.\"\r\n\r\nOther ranked schools in the Bay Area include Henry M. Gunn High School (38), Leland High School (54), Los Altos High School (71), Mountain View High School (189), Homestead High School (403) and Cupertino High School (491), as shown on the map.","excerpt":"Palo Alto High School places 56th in Newsweek's Top High School rankings, climbing from 161st last year.","date":"2014-09-18 20:15:40","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-11.49.36-PM.png","categories":["News","Spotlight"],"tags":{"27738":"best","8751":"gunn","10749":"high school","10116":"leland","10028":"map","27736":"national","27735":"newsweek","27734":"ranking","27737":"state","27739":"top","27740":"two"}},{"id":74062,"title":"Police launch operation to increase biker awareness","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/police-launch-operation-to-increase-biker-awareness\/","content":"[caption id=\"attachment_74103\" align=\"alignnone\" width=\"578\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/anant-photo.jpg\"><img class=\" wp-image-74103\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/anant-photo.jpg\" alt=\"Anant Marur bikes out of the Palo Alto High School campus.  Marur is a frequent biker.  &quot;I think the police should be focusing on more important,&quot; Marur says.\" width=\"578\" height=\"385\" \/><\/a> Junior Anant Marur bikes out of the Palo Alto High School campus. Marur bikes frequently to and from school.  \"I think the police should be focusing on more important issues,\" Marur said, in regards to \"Operation Safe Passage\". Photo by Adele Bloch.[\/caption]\r\n\r\nThe Palo Alto Police Department is participating in project \"Operation Safe Passage\" this week  to elevate student biker awareness.\r\n\r\nThis week, the department has stationed its officers around the city, carrying out stop sign enforcement for both vehicles and cyclists. One of the locations has been the intersection of North California Avenue and Bryant Street, a common junction for Palo Alto High School bikers.\r\n\r\nAccording to the <a title=\"PAPD Facebook\" href=\"https:\/\/www.facebook.com\/PaloAltoPolice\/photos\/a.349604361742034.72544.288613124507825\/736025323099934\/?type=1&amp;theater\" target=\"_blank\">PAPD<\/a>, \"Operation Safe Passage\" will run through tomorrow morning and after school commute hours.\r\n\r\nPaly students have had mixed feelings about the new type of initiative the police has been taking on.\r\n\r\n\"Right now, they [the PAPD] are sparking a lot of resentment within the students who they want to be keeping safe,” junior Griffin Carlson said.\r\n\r\nCarlson says that there are better alternatives to educate students in bicycle safety.\r\n\r\n“They should have a stand or something which provides information about bicycle safety and gives out helmets instead of giving out tickets unnecessarily for one week out of the whole year,” Carlson said.\r\n\r\nOfficers ticketed a student on Tuesday morning for having both earbuds in while biking. The student, however, said she never knew it was a violation to bike with two earbuds in.\r\n\r\n“Obviously, it’s kind of hard to obey rules you don’t even know exist,\" the student said.\r\n\r\nAccording to the student, punishments can include traffic school or fines anywhere from $100 to $200.\r\n\r\nHowever, some feel that \"Operation Safe Passage\" is a great way to bring awareness to bicycle safety.\r\n\r\n“I haven’t really followed the rules all the time, and I think they [the PAPD] don’t give enough awareness to bike safety,” another student said.\r\n\r\nShe said she almost got into an accident over the weekend after not for not coming to a complete stop at the stop sign. In response, the student will be participating in a traffic school for bicycle safety.\r\n\r\n“Honestly, I think I need that class,” the student said.\r\n\r\n&nbsp;","excerpt":"The Palo Alto Police Department is participating in project \"Operation Safe Passage\" throughout this week in order to elevate student biker awareness in Palo Alto.","date":"2014-09-18 19:00:21","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/anant-photo.jpg","categories":["News","Spotlight"],"tags":{"9669":"bike","10040":"Griffin Carlson","29029":"operation safe passage","13030":"PAPD","9000":"police","29030":"tamari Dzotsenidze"}},{"id":74109,"title":"Palo Alto plans to expand crosstown shuttle route","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/palo-alto-plans-to-expand-crosstown-shuttle-route\/","content":"<p>[caption id=\"attachment_74120\" align=\"aligncenter\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-2.jpg\"><img class=\"size-full wp-image-74120\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-2.jpg\" alt=\"The Palo Alto shuttle will be expanding its routes. The service works to address traffic and parking and has been running since 1999. Photo by Christian Leong.\" width=\"800\" height=\"600\" \/><\/a> The crosstown Palo Alto shuttle will be expanding its routes to include services from East Meadow Drive to University Avenue. The shuttle service works to address traffic and parking and has been running since 1999. Photo by Christian Leong.[\/caption]<\/p>\r\n<p>The City of Palo Alto's Planning &amp; Transportation Commission is looking to expand the existing Crosstown shuttle route offered by the free Palo Alto shuttle service after a meeting last week.<\/p>\r\n<p>The extended route, the West Shuttle, will run from the industrial area around East Meadow Drive in south Palo Alto to El Camino Real and ultimately to University Avenue. The West Shuttle will serve to connect downtown Palo Alto with south Palo Alto.<\/p>\r\n<p>“The West Shuttle would aim to accommodate different sectors, including residents and employees in the mixed-use area around Charleston Road and East Meadow [Drive],” Fehr &amp; Peers firm consultant Steve Crosley said. Earlier this year, the firm was commissioned to study the existing routes and plan new routes.<\/p>\r\n<p>In July, the shuttle program introduced the East Palo Alto route, which starts at Woodland Avenue and continues to the downtown Caltrain Station.<\/p>\r\n<p>In addition to the West and East routes, the original Crosstown and Embarcadero routes are still in operation.<\/p>\r\n<p>The shuttle program, founded in December 1999, aims to reduce excessive traffic, insufficient parking in the city’s commercial areas and provide a free transportation service.<\/p>\r\n<p>The Planning and Transportation Commission chairman Mark Michael believes that the shuttle should not only provide transportation for students, but should also provide the same for the working class.<\/p>\r\n<p>\"The time of Palo Alto residents is quite valuable,\" Michael said. \"This is a very prosperous and productive community, and a lot of people are employed very gainfully.\"<\/p>\r\n<p>The new route map can be located <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1410560683.pdf\">here<\/a><\/p>\r\n","excerpt":"The City of Palo Alto's Planning & Transportation Commission is looking to expand the existing Crosstown shuttle route offered by the free Palo Alto shuttle service after a meeting last week.","date":"2014-09-18 18:48:52","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo-2.jpg","categories":["News","Spotlight"],"tags":{"8470":"Alto","8938":"Palo","9094":"Service","29084":"shuttle","29085":"transportation"}},{"id":73873,"title":"Paly alumna signs with prestigious ballet company","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/paly-alumna-signs-with-prestigious-ballet-company\/","content":"[caption id=\"attachment_74032\" align=\"alignnone\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/1185047_10201622781242078_1018900478_n1.jpg\"><img class=\"size-full wp-image-74032\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/1185047_10201622781242078_1018900478_n1.jpg\" alt=\"Palo Alto High School alumnus does a split leap in a studio. Photo by Oliver Henry Endahl.\" width=\"400\" height=\"596\" \/><\/a> Palo Alto High School alumna Jennifer Wang does a split leap in a dance studio. Photo by Oliver Henry Endahl.[\/caption]\r\n\r\nJennifer Wang, a Palo Alto High School alumna who graduated last year, recently achieved her life-long dream when she signed with the prestigious company Joffrey Ballet.\r\n\r\n“I’ve been dancing since I was six years old, mostly all ballet,” Wang said.\r\n\r\nThe road to her dream has not been an easy one. Wang says she attended 20 or more hours of dance classes a week, depending on rehearsals.\r\n\r\n“I was most recently trained in [the style of] Vaganova, which is Russian, at City Ballet School in San Francisco,” Wang said.\r\n\r\nKenneth Patsel, the director at City Ballet School of San Francisco, said he and the artistic director Galina Alexandrova first noticed Wang’s talent when she attended a summer intensive five years ago at the age of 13.\r\n\r\n“Galina  immediately spotted the potential in Jen and asked Jen, 'What do you want to do with ballet?'” Patsel said. “She said, 'Of course I’d like to be a professional dancer one day,' and Galina said, 'I think you have what it takes if you’re trained properly.'”\r\n\r\n[caption id=\"attachment_74033\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10176142_10203142480593612_4450954726531116401_n.jpg\"><img class=\"size-full wp-image-74033\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10176142_10203142480593612_4450954726531116401_n.jpg\" alt=\"Jennifer Wang dances a pas de deux in the City Ballet of San Francisco's Spring Showcase 2011. Photo by Alexander Reneff-Olson.\" width=\"600\" height=\"400\" \/><\/a> Jennifer Wang dances a pas de deux in the City Ballet of San Francisco's Spring Showcase 2011. Photo by Alexander Reneff-Olson.[\/caption]\r\n\r\nWang proved herself to be an exceptional dancer.\r\n\r\n“Jen was cast as one of our youngest Sugar Plums ever in Nutcracker,” Patsel said. “So at age 14, she danced a leading role in the Nutcracker.”\r\n\r\nAccording to Patsel, Wang won the Senior Classical Competition in the Youth America Grand Prix, a prominent ballet competition. She was invited to go to New York as a finalist.\r\n\r\nAlexandrova had danced with Ashley Wheater, the director of the Joffrey Ballet, according to Patsel. Using her connection, Alexandrova called Wheater to let him know that she had a spectacular student.\r\n\r\n“Galina called up Ashley because she thought Jen was a very special student,” Patsel said.\r\n\r\n“She did an audition with Ashley, and at the time it didn’t look like he had any contracts,” Patsel said. “Three months went by from the time she auditioned. Apparently what was happening in the meantime was Ashley was negotiating with his board to get another dancer, and as it turned it out there was a dancer that left the company, thus leaving open one contract.”\r\n\r\nAt that time, Wang had already been enrolled at Harvard. However, Harvard has a rule that if a student attends one semester, he or she may take an indefinite leave, according to Patsel.\r\n\r\n“They would’ve normally started already in September, but Ashley, knowing that Jen needed to get that semester in the books, held the contract for Jen, which is almost unheard of, so that she could go to one semester and is going to start in January after they finish their Nutcracker,” Patsel said.\r\n\r\nDespite a professional career being her dream, Wang still feels a little nervous.\r\n\r\n“At Joffrey, I think I’ll be intimidated because there will be quite a few older and way more experienced dancers than me,” Wang said. “Also, I’m not as experienced in contemporary, and Joffrey does a decent amount of that, so hopefully I’ll be adaptable enough to fit in.”\r\n\r\nOn the other hand, Wang is also looking forward to dancing with the Joffrey Ballet after years of hard work.\r\n\r\n“I’m so excited to be dancing professionally because it’s my dream and I loved performing,” Wang said. “I’ll have the chance to probably work with a lot of really amazing and interesting people and will hopefully have more opportunities to perform, so I’m really excited.”\r\n\r\n&nbsp;","excerpt":"Recent Palo Alto High School graduate has signed with the Joffrey Ballet. Read more to learn about her journey to a professional career.","date":"2014-09-18 17:55:49","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10176142_10203142480593612_4450954726531116401_n.jpg","categories":["Features","Spotlight"],"tags":{"12340":"alumni","8509":"ballet","8626":"dance","28803":"harvard","8807":"jennifer wang","28801":"joffrey","28802":"professional"}},{"id":74123,"title":"UC application essay workshop during Tutorial on Sept. 23 in the SSRC","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/uc-application-essay-workshop-during-tutorial-on-sept-23-in-the-ssrc\/","content":"","excerpt":"","date":"2014-09-18 17:27:47","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8487":"application","29089":"case study","29087":"essay","29086":"uc","29088":"workshop"}},{"id":73931,"title":"New clubs available to students","permalink":"http:\/\/palyvoice.com\/2014\/09\/18\/new-clubs-available-to-students\/","content":"[caption id=\"attachment_73982\" align=\"alignnone\" width=\"610\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_2624.jpg\"><img class=\"wp-image-73982\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_2624.jpg\" alt=\"Students attentively watch a club presentation demo during Club Day yesterday. Photo by Christian Leong. \" width=\"610\" height=\"406\" \/><\/a> Freshman Ben Vogel, junior Mark Rogers and sophomore Nicholas Campen (left to right) attentively watch a Robotics Club demo during Club Day on Monday. There were over 80 clubs available to students during their extended lunch. Photo by Christian Leong.[\/caption]\r\n\r\nThe Associated Student Body is calling Monday's Club Day — with more than 80 Palo Alto High School clubs who presented to students during an extended lunch— a success.\r\n\r\n“Club Day went really well,\" junior ASB vice-president Reid Walters said. \"We had an awesome turnout and lots of sign-ups. We have a wide variety of clubs on campus, so it was great to see them displayed on the quad.”\r\n\r\nSome clubs are returning from previous years, coming back with updated activities and goals. However, many clubs are newly formed this year. Here is an in-depth look at four of the brand new clubs that Paly has to offer. It’s not too late to sign up!\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/global-citizens-collaborative-club\/\">Global Citizens Collaborative Club<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/assassins-guild\/\">Assassin's Guild<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/make-x-club\/\">Make X Club<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/multicultural-club\/\">Multicultural Club<\/a>\r\n\r\nFor a list of all the clubs featured at Club Day, click <a title=\"here.\" href=\"https:\/\/sites.google.com\/site\/pahsasb\/clubs\">here<\/a>.","excerpt":"After Monday's club day, The Paly Voice decided to take an in depth look at four of the over 80 clubs represented at the event. ","date":"2014-09-18 13:42:13","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_2624.jpg","categories":["News","Spotlight"],"tags":{"28932":"Assassin's Guild","11711":"club day","28931":"Global Citizens Collaborative Club","28933":"Make X Club","28934":"Multicultural Club","14292":"reid walters"}},{"id":73812,"title":"Custom Craze","permalink":"http:\/\/palyvoice.com\/2014\/09\/17\/custom-craze\/","content":"<p style=\"text-align: left;\"><em>The evolution of custom attire and its effects at Paly <\/em><\/p>\r\n\r\n\r\n[caption id=\"attachment_73813\" align=\"alignright\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png\"><img class=\"wp-image-73813 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png\" alt=\"Palo Alto High School students show off their custom clothing during Club Day.  “Wearing custom clothing makes your club or team look more legitimate and improves your overall swag,” junior James Wang said. Photos by Jeanette Wong.\" width=\"587\" height=\"589\" \/><\/a> Palo Alto High School students show off their custom clothing during Club Day. “Wearing custom clothing makes your club or team look more legitimate and improves your overall swag,” junior James Wang said. Photos by Jeanette Wong.[\/caption]\r\n\r\nWalking around the Palo Alto High School campus, one cannot help but notice the plethora of custom clothing sported by the students.\r\n\r\nFrom tie-dyeing T-shirts to designing clothing to <em>dye<\/em> for, as technology continues to advance, it has become easier than ever to make customized attire to promote and unify groups.\r\n\r\nSites such as DesignAShirt, Zazzle and CustomInk enable people to design and order products from virtually anywhere. The clothing is also relatively easy and fast to make.\r\n\r\nAccording to junior Anna Lu who designed the Paly Debate team attire, it takes around 20 minutes to create a design and around two weeks to ship.\r\nThe availability of the latest T-shirt making processes seems to attract students.\r\n\r\n“I think it’s more readily available and more people have noticed it and have gotten on that bandwagon of [making custom clothing for their teams]... over the last 16 years,” Paly receptionist Vallen Queen said.\r\n\r\nNew methods for creating attire has simplified the overall process.\r\n\r\n“I would say that because of computers, we’re now able to print [shirts] directly from the computers which means that it’s a lot easier and cheaper to print small quantities of T-shirts,” said Randy Samuels, owner of Big Frog Custom T-Shirts &amp; More of Mountain View. “In the past, most shirts were made with screen printing, which means you have to use films and... separate each color in your image. Every shirt needs to [be individually made] which means it can be more time-consuming.”\r\n\r\nAccording to Samuels, the invention of new technology streamlines the price and decreases the cost of the production of a single T-shirt. Additionally, the larger the quantity of the order, the cheaper the price will be, according to Samuels.\r\n\r\nThe advanced process of T-shirt making opens doors for more opportunities of creative expression.\r\n\r\n“When I was in high school the only clothes I ever made were crazy tie-dye shirts,” Paly librarian Rachel Kellerman said. “I thought the shirts [my son’s classmate made a few years ago] were very clever and creative. I like the fact that anyone with a design idea could sell a shirt.”\r\n\r\nWhether it may be sports teams such as volleyball, cross country and cheer, or Paly clubs like YCS-Interact, Speech and Debate and Robotics, communities at Paly are taking advantage of the tools offered by custom wear.\r\n\r\nAccording to junior Bethany Wong, custom clothing is an effective way for students to express their interests.\r\n\r\n“In the case of my cross country sweatshirt, [it has a] somewhat sassy phrase on the back,” Wong said. “I’ve struck up conversations while wearing it as I went around Palo Alto because people mention how they were also on cross country in high school or that they have heard of our school.”\r\n\r\nCustom clothing also brings a sense of unity to groups,according to Wong.\r\n\r\n“It [custom clothing] is an excellent way to exhibit team or club unity on campus,” Wong said. “There's also a certain coolness factor because each piece of custom clothing might be ‘limited edition’ and reminds you of the group of people in that club or sport.”\r\n\r\nCustom clothing, however, can also create separate groups of unified students according to math teacher Suzanne Antink.\r\n\r\n“Teen club T-shirts overall became a sort of ‘separating’ or divisive style among groups of students — a sort of labeling when none was needed,” Antink said. “However, as some clubs compete outside of school, like [for] Robotics, Debate, Scioly or Math, club members like to have a unifying team shirts.”\r\n\r\nThe Paly Voice asked a group of 25 sophomores, juniors and seniors at Paly and found that the students from this sample size had up to four pieces and spent up to $100 a year on custom wear.\r\n\r\nAs clubs and sports have started, students are excited to obtain their custom wear to represent the activities they participate in.\r\n\r\n“I’m going to order a Speech and Debate sweater this year,” senior Dan Su said. “I’m really excited to represent the team I love.”","excerpt":"From tie-dyeing T-shirts to designing clothing to dye for, as technology continues to advance, it has become easier than ever to make customized attire to promote and unify groups.","date":"2014-09-17 19:00:34","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png","categories":["Features","Spotlight"],"tags":{"28779":"big frog","8596":"clothes","11711":"club day","11337":"clubs","28776":"custom","28775":"custom ink","28780":"shirts","28781":"swag","28777":"t-shirt","28778":"tshirt"}},{"id":74012,"title":"Freshman class decides Spirit Week theme","permalink":"http:\/\/palyvoice.com\/2014\/09\/17\/freshman-class-decides-spirit-week-theme\/","content":"[caption id=\"attachment_74020\" align=\"alignleft\" width=\"630\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_01361.jpg\"><img class=\"wp-image-74020\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_01361.jpg\" alt=\"DSC_0136\" width=\"630\" height=\"418\" \/><\/a> Freshman Vice President Claire Billman and Student Activities Director Matt Hall hold up the Spirit Week schedule from two years ago to show the range of themes that previous grades have come up with. A meeting was held for the freshmen class to decide the official Spirit Week theme in the Student Activities Office during lunch today, with the official decision being \"The Lion King.\" Freshman can dress up as animals from The Lion King or other Disney characters as well. Photo by Adele Bloch.[\/caption]\r\n\r\n<span style=\"color: #000000;\">\"Hakuna Matata!\" That might as well be the motto of t<\/span>he Palo Alto High School Class of 2018 who chose \"The Lion King\" as its theme for Spirit Week this year.\r\n\r\nThe freshmen, who were required to base their theme off of the color orange, voted for The Lion King at lunch in the Student Activities Office today. Other potential choices included “Nickelodeon,” “Jersey Shore” and “Giants\" for Spirit Week 2014.\r\n\r\nSeventeen people were present at the meeting led by Claire Billman, Vice President of the freshmen class.\r\n\r\n\"I am incredibly excited for Spirit Week,\" Billman said. \"I have two older sisters and I've seen how much fun they've had during Spirit Week, so I'm excited to have just as much fun with my classmates.\"\r\n\r\nFreshmen can receive updates on Spirit Week float ideas, spirit dances and T-shirts by joining the Paly Class of 2018 <a title=\"Facebook group.\" href=\"http:\/\/goo.gl\/AAbiSi\" target=\"_blank\">Facebook group<\/a>.\r\n\r\nEvery grade's Spirit Week theme has now officially been established: \"Red Card\" for sophomores, \"Pirates\" for juniors and \"Green light\" for seniors.\r\n\r\n<span style=\"color: #000000;\">With only 37 more days till Spirit Week, each grade begins to organize its spirit dance, float idea, and shirt design.<\/span>\r\n\r\n&nbsp;","excerpt":"\"Hakuna Matata!\" That might as well be the motto of the Palo Alto High School Class of 2018 who chose \"The Lion King\" as its theme for Spirit Week this year.","date":"2014-09-17 17:25:20","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0172.jpg","categories":["News"],"tags":{"28799":"Claire Billman","8721":"freshmen","9119":"Spirit Week","28800":"theme"}},{"id":73783,"title":"Recap: Girls’ golf falls in close match with Gunn","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/recap-girls-golf-falls-in-close-match-with-gunn\/","content":"The Palo Alto High School girls’ golf team (1-1) narrowly lost to crosstown rival Gunn High School in its second league match by a score of 192-195 yesterday at the Palo Alto Municipal Golf Course.\n\nSenior team captain Michelle Xie finished the round with a score of 32, while sophomore Emily Hwang, freshman Stephanie Yu, sophomore Celia Willner and sophomore Candace Wang came in with scores of 36, 39, 43, and 45 respectively.\n\nAccording to Xie, the team performed well and was unlucky not to win.\n\n“One of the players on the Gunn team shot the lowest round of their life,” Xie said. “So that took us down a little bit.  All the Gunn girls players played really well.”\n\nOne of the bright spots in the loss was the performance of sophomore Candace Wang, who had to step in for a sick sophomore Elise Kiya.\n\n“At the time, we didn’t know how well the other girl was playing at Gunn,” coach Doyle Knight said. “But her score at the time could’ve helped us win.  We didn’t because the other girl played better, but Candace’s score, in her first true match, was big,”\n\nWang, described by Knight as an up-and-comer, spoke about her effort at the match.\n\n[caption id=\"attachment_73991\" align=\"alignright\" width=\"292\"]<img class=\"wp-image-73991\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_4268.jpg\" alt=\"\" width=\"292\" height=\"214\" \/> Girls' golf coach Doyle Knight recaps yesterday's game with some of the players. The golf team lost to the Gunn team by three strokes in a close match. Photo by George Lu.[\/caption]\n\n“Yesterday was really one of the days where I tried hard to keep up with my group,” Wang said.  “Each shot is independent from the next, so you try to do your best on every single shot.”\n\nDespite the loss, Knight expects more strong performances from the rest of the team.\n\n“Michelle’s not going to be here next time we play Gunn,” Knight said. “So I was really challenging the girls to step up, and I think they can.”\n\nThe Vikings will take on Saratoga in their next home game at 3:30 p.m. on Thursday at Santa Teresa Golf Club.","excerpt":"The Palo Alto High School girls’ golf team (1-1) narrowly lost to crosstown rival Gunn High School in its second league match by a score <a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/recap-girls-golf-falls-in-close-match-with-gunn\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-09-16 22:54:43","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_4266.jpg","categories":["Golf","Sports"],"tags":{"28798":"candace wang","10012":"emily hwang","10175":"girls golf","8738":"Golf","8751":"gunn","14522":"gunn golf","10010":"michelle xie","14521":"paly golf"}},{"id":73720,"title":"Preview: Football home opener Friday vs. Mitty","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/preview-football-home-opener-friday-vs-mitty\/","content":"[caption id=\"attachment_73945\" align=\"alignleft\" width=\"621\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg\"><img class=\"wp-image-73945 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg\" alt=\"LRP_6414\" width=\"621\" height=\"412\" \/><\/a> Junior quarterback Oliver Svirsky rushes past the defense while playing at Paly's Viking stadium. Photo by Liana Pickrell.[\/caption]\r\n\r\nAfter starting the season off with a last-second victory followed by a blow-out loss, the Palo Alto High School football team (1-1, 0-0) returns home this Friday to take on an out-of-division powerhouse, the Archbishop Mitty Monarchs (0-1, 0-0).\r\n\r\nThe Vikings, led by first-year head coach Jake Halas, began their season on a high note, defeating the Sequoia High School Ravens (1-1, 0-0) 30-28 on Sept. 5 thanks to a game-winning field goal by junior kicker Jose Patino. Last Friday, the team took a step back, getting shut out by the San Benito High School Greyhounds (2-0, 0-0), 33-0.\r\n\r\nAccording to junior wide receiver Eli Givens, the team needs to play better on both offense and defense in order to beat Mitty.\r\n\r\n\"We just need to execute on offense and finish on plays,\" Givens said. \"The [offensive] line will be a huge help for this game and we need them every play blocking for our running backs. We've also been working on our defense, focusing a lot on what Mitty is going to run.\"\r\n\r\nHalas, whose defense gave up 33 points to San Benito, is confident that they will play a more efficient game against Mitty.\r\n\r\n\"We're going to get after Mitty,\" Halas said. \"We're going to bring pressure defensively speaking, and we're going to execute better. We did not execute against them [San Benito].\"\r\n\r\nThe Vikings and Monarchs kick off at 7:30 p.m. Friday night at Paly's Hod Ray Field.\r\n\r\n&nbsp;","excerpt":"After starting the season off with a last-second victory followed by a blow-out loss, the Palo Alto High School football team (1-1, 0-0) returns home this Friday to take on an out of division powerhouse, the Archbishop Mitty Monarchs (0-1, 0-0).","date":"2014-09-16 22:15:43","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg","categories":["Football","Sports"],"tags":{"9656":"eli givens","8714":"football","25424":"jake halas","28787":"jose patino","17730":"Mitty","9059":"San Benito","25428":"sequoia"}}]