[{"id":74525,"title":"School board to discuss library renovation design","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/school-board-to-discuss-library-renovation-design\/","content":"[caption id=\"attachment_74576\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png\"><img class=\"wp-image-74576\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png\" alt=\"Screen Shot 2014-09-20 at 9.51.58 PM\" width=\"600\" height=\"349\" \/><\/a> The renovated Palo Alto High School library will retain its foundational exterior design, while bringing major changes to the interior, according to the <a href=\"http:\/\/pausd.org\/community\/board\/downloads\/brd_packet\/item_013.pdf\">PAUSD Board of Education meeting agenda<\/a>. The distinctive change in glass exterior walls will allow natural light, something that is absent in the current library, according to Librarian Rachel Kellerman. \"I'm most looking forward to the natural lighting,\" Kellerman said. \"We're trying to be as green as possible in the design, and this is a big part of that.\" Illustration courtesy of DLM Architecture.[\/caption]\r\n\r\nBond Program Manager Bob Golton will present revised conceptual designs of the Library Renovation Project for Palo Alto High School at 9:35 p.m. tonight at the Palo Alto Unified School District Board of Education meeting.\r\n\r\nThe design of the new library includes a renovation of the entire 500 building, moving the Guidance Office as well as the College and Career Center to create a 'Campus Hub' of learning at Paly, according to the <a href=\"http:\/\/pausd.org\/community\/board\/downloads\/brd_packet\/item_013.pdf\">meeting agenda<\/a>.\r\n\r\nLibrarian Rachel Kellerman explained that the renovated building will promote a center for various student activities at the core of the campus.\r\n\r\n[caption id=\"attachment_74577\" align=\"alignright\" width=\"412\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.32.16-PM.png\"><img class=\"wp-image-74577 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.32.16-PM.png\" alt=\"Screen Shot 2014-09-20 at 9.32.16 PM\" width=\"412\" height=\"405\" \/><\/a> The proposed library plan will include collaboration rooms as well as a 'maker space' to promote innovative learning. Illustration courtesy of  DLM Architecture.[\/caption]\r\n\r\n\"The idea is that this is the hub of student activity, interaction and information,\" Kellerman said. \"It's got a lot going on, not just the library. The students activities office will also be here, which is great because it will go directly out to the Quad where they do a lot of activities. There will also be a maker space  in the back that teachers can book online for their classes, so that will be an interesting work space where students and teachers can come together in this facility.\"\r\n\r\nThe building will be separated by glass walls on the interior and the exterior to allow natural light into the building and long views out onto the Quad. The library will also include an upper level mezzanine and collaboration spaces for both students and teachers.\r\n\r\nAccording to Kellerman, the library design was developed after extensive research to provide for future demands.\r\n\r\n\"We've been working on the designs for a couple of years,\" Kellerman said. \"It's very well researched. We've looked at many libraries all the way from high school to colleges to public libraries to make sure we have everything we need not necessarily now, but moving forward into the future.\"\r\n\r\nThe board will also discuss the proposed project budget and the authorization to proceed with schematic design, which the Bond Program plans to propose in December 2014 or January 2015. The overall expense of this project adds up to $9.35 million, which will come from the Strongs Schools Bond passed in June 2008.\r\n\r\nAccording to Assistant Principal Jerry Berkson, the library is set to move into the 700 building before the planned 13 month-long construction begins in June 2016.\r\n\r\n\"Most likely, the library will be moved to the 700 building,\" Berkson said. \"We'll have to wait for the gym to be done because PE [physical education] is moving there now.\"\r\n\r\n[caption id=\"attachment_74584\" align=\"alignleft\" width=\"437\"]<img class=\"wp-image-74584\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-23-at-5.02.31-PM.png\" alt=\"Screen Shot 2014-09-23 at 5.02.31 PM\" width=\"437\" height=\"254\" \/> Guidance Office and the College and Career Center will move to the 500 building, allowing space for a Meeting Room and Alumni Room respectively in the Tower Building, according to the board meeting agenda. Illustration courtesy of DLM Architecture.[\/caption]\r\n\r\nAccording to Berkson, the library construction is dependent on the gym construction because of the limited substitute space. This poses a threat to the planned construction time as the recent delay in the gym construction has pushed back its proposed finishing date to Dec. 2016.\r\n\r\nThe board will vote to approve the conceptual design, budget and contract for the schematic design in the next meeting on Oct. 7 at the PAUSD office.","excerpt":"The Strong Schools Bond Program will present revised conceptual designs for the 500 building, including a new library and collaboration spaces.","date":"2014-09-23 18:44:31","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-9.51.58-PM.png","categories":["News","Spotlight"],"tags":{"29186":"500 building","8458":"administration","21437":"bond","29193":"budget","8558":"campus","9678":"career","8570":"center","8604":"college","29189":"conceptual","8616":"construction","29188":"design","8748":"Guidance","29191":"hub","8848":"Library","25038":"McGee","29190":"mezzanine","8912":"new","29192":"office","9681":"PLAN","11895":"plans","9021":"quad","29187":"renovation","9069":"School Board","9177":"tower building"}},{"id":74598,"title":"Deadline for dropping a class Oct. 9","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/deadline-for-dropping-a-class-oct-9\/","content":"","excerpt":"","date":"2014-09-23 17:47:04","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8589":"class","8636":"deadline","29215":"drop","8658":"dropping"}},{"id":74529,"title":"Liveblog: Paly girls&#8217; volleyball takes on rival in first game of season","permalink":"http:\/\/palyvoice.com\/2014\/09\/23\/live-blog-paly-girls-volleyball-takes-on-rival-in-first-game-of-season\/","content":"[caption id=\"attachment_74618\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg\"><img class=\"size-full wp-image-74618\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg\" alt=\"Palo Alto High School girls' volleyball team cheers in their huddle right before their first league game against rival, Gunn High School. Photo by Amy Leung.\" width=\"600\" height=\"450\" \/><\/a> Palo Alto High School girls' volleyball team cheers in their huddle right before their first league game against rival Gunn High School. Photo by Amy Leung.[\/caption]\r\n\r\n<em>Check back at 7 p.m. tonight for live coverage of Palo Alto High School girls' volleyball's first league game against Gunn High School.<\/em> [liveblog]","excerpt":"Check back at 7 p.m. tonight for live coverage of Palo Alto High School girls&#8217; volleyball&#8217;s first league game against Gunn High School.","date":"2014-09-23 14:56:02","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg","categories":["Sports"],"tags":{"8734":"girls","11244":"girls volleyball","8751":"gunn","27175":"live","8855":"liveblog","9216":"volleyball"}},{"id":74415,"title":"Girls&#8217; volleyball to play first season game against crosstown rival","permalink":"http:\/\/palyvoice.com\/2014\/09\/22\/girls-volleyball-to-play-first-season-game-against-crosstown-rival\/","content":"[caption id=\"attachment_74472\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg\"><img class=\"wp-image-74472\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg\" alt=\"The Palo Alto High School girls' volleyball team discusses season plans before practice. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> The Palo Alto High School girls' volleyball team discusses season plans before one of their first practices of the season in the Paly gym. Photo by Amy Leung.[\/caption]\r\n\r\nThe Palo Alto High School girls' volleyball team (10-3, 0-0) will play its crosstown rival Gunn High School (5-3, 0-0) in its first league game tomorrow at Gunn.\r\n\r\n“The first [league] match is always exciting,” sophomore setter Jessica Lee said. “Playing Gunn is always a fun game because of the team rivalry.”\r\n\r\nSenior captain and outside hitter Jade Schoenberger agreed with Lee.\r\n\r\n“I’m always excited for Gunn because both teams want to win so bad, mainly for bragging rights,” Schoenberger said.\r\n\r\nEven so, Schoenberger says that she holds no strict expectations for the outcome.\r\n\r\n“I can’t predict how we’re going to do,” Schoenberger said. “If we play our game, we’ll be fine and hopefully pull out a win.”\r\n\r\nLee expresses concern after junior middle blocker Claire Dennis badly sprained her ankle during last Monday's practice.\r\n\r\n“Not having Claire Dennis will be a little more difficult because she’s our tallest player and main blocker,” Lee said. “We are definitely going to miss her on the court, but we aren’t going to let that affect our playing.”\r\n\r\nSo far, the team has only lost to Sacred Heart Prep, Pleasant Grove and Acalanes in both the Deer Valley and Harbor tournaments on Sept. 13 and Sept. 20, respectively.\r\n\r\nAcross town, Gunn senior captain and setter Nicole Brigham expressed their concerns about strong Paly players.\r\n\r\n“We are looking out for Jade [Schoenberger] — she is one of their strongest hitters,” Brigham said. “So we are going to put a good block up on her.”\r\n\r\nEven though key players Keri Gee, Lauren Kerr, Sarah Limb and Becca Raffel all graduated last year, Schonenberger still has high hopes for an exciting season.\r\n\r\n“The loss of last year’s seniors was a bummer — they were all so talented,” Schonenberger said. “But some younger players on the team have really stepped up this year, so I’m confident we will have a fun season, win or lose.”\r\n\r\nWatch the game at 6:45 p.m. tomorrow at Gunn or read The Paly Voice's live blog.","excerpt":"The girl's volleyball team will play Gunn High School in its first game of the season. ","date":"2014-09-22 21:56:53","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0098.jpg","categories":["Sports"],"tags":{"10618":"first game","11244":"girls volleyball","8751":"gunn","9880":"jade schoenberger","8809":"jessica lee","11391":"new season","29185":"rivals","9216":"volleyball"}},{"id":73691,"title":"What is WASC?","permalink":"http:\/\/palyvoice.com\/2014\/09\/21\/what-is-wasc\/","content":"[caption id=\"attachment_74102\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg\"><img class=\"wp-image-74102\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg\" alt=\"Teacher on Special Assignment Eric Bloom talks to a group of teachers during a WASC meeting. Photo by Amy Leung.\" width=\"600\" height=\"400\" \/><\/a> Teacher on Special Assignment Eric Bloom talks to a group of teachers during a WASC meeting with the School Culture sub-group. Photo by Amy Leung.[\/caption]\r\n\r\nRecently, students have been taking a WASC survey in their English classes. But many students find themselves wondering: what is WASC?\r\n\r\nAccording to the Palo Alto High School WASC Coordinator and Spanish teacher Emily Garrison, WASC stands for the Western Association of Schools and Colleges.\r\n\r\n“WASC is a non-profit organization,” Garrison said. “It works very closely with the California Department of Education, but it doesn’t have any other affiliations besides that really.”\r\n\r\nWhat exactly does WASC do then?\r\n\r\n“In order to make your transcript valid for college, we have to be WASC accredited,” Garrison said. “Everybody wants to have WASC accreditation because basically what that says is the coursework, what’s happening on campus, is valid.”\r\n\r\nThe surveys administered in English classes provide guidance for improving the school.\r\n\r\n“At the end of the year, we’re going to be done with one of our six-year cycles, and the reviews that students have done are going to be part of the process that we go through in deciding how well the school has done and where we can move on from this point,” said junior Molly Kraus, a member of the student WASC group.\r\n\r\n“Our job is to do two things — what’s Paly doing really well?” Garrison said. “We really are an amazing school. But with any school, or with any student or any person, even if that person is amazing, there’s still always things that you can improve upon. So that’s the second part of WASC.”\r\n\r\nCurrently, the Paly WASC group is finishing up the last cycle and starting a new one, according to Garrison. Students, parents and staff discussed the big pictures of what’s going on at Paly at the most recent focus group meetings.\r\n\r\n“We really analyze that [information] and we think about it,\" Garrison said. \"Then what we’re going to do is put it in a much larger context and say OK, we want to try to focus in on three to five major goals. We don’t know what those are yet — we’re not quite there yet, but we’ll be there soon. In the next month or so, those goals should be developed.\"\r\n\r\nAfter creating these goals, Garrison says that the next step is a commitment to working towards those objectives for the next six years until the next WASC cycle. For the time being, the group is gathering as much data as possible.\r\n\r\n“All this stuff we’re doing right now goes into a big report that’s probably going to be about 300 pages long,\" Garrison said. \"It’ll be finished probably by the end of December. And then that whole report of those two big pieces — what does Paly look like and then how can we improve — that can then get sent to WASC.”\r\n\r\nAfter reading the Paly WASC report, WASC will send a team in early March to validate the information.\r\n\r\n“They [WASC] are here to help support us,\" Garrison said. \"And they’re going to be on campus, they’re going to be in classes, they’re going to want to talk to students.”\r\n\r\nGarrison says that this month will be important for WASC updates because it's the starting point for the new cycle of this upcoming year.\r\n\r\n\"In the next month, things are really going to start getting interesting with WASC,\" Garrison said. \"We just want to make things better for students.\"","excerpt":"WASC is beginning its new six-year cycle this upcoming school year. Read more to find out what WASC is.","date":"2014-09-21 13:27:05","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0009.jpg","categories":["Features","Uncategorized"],"tags":{"27775":"emily garrison","13035":"molly kraus","11646":"survey","27774":"WASC"}},{"id":74411,"title":"Essay tutoring in Writing Center open during Tutorial, after school on Mondays and Wednesdays","permalink":"http:\/\/palyvoice.com\/2014\/09\/21\/essay-tutoring-in-writing-center-starts-sept-22\/","content":"","excerpt":"","date":"2014-09-21 10:53:51","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8675":"English Resource Center","29157":"essay tutoring","27704":"writing center"}},{"id":74220,"title":"Intramural volleyball tournament to take place on Quad","permalink":"http:\/\/palyvoice.com\/2014\/09\/20\/intramural-volleyball-tournament-to-take-place-on-quad\/","content":"<iframe style=\"overflow-y:hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/2824745-volleyball\" width=\"620\" height=\"807\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nKeep up with the intramural volleyball tournament by checking out the above bracket, which will be updated daily. Infographic created by Lizzie Chun, Saba Moussavian and Nika Woodfill.\r\n\r\n&nbsp;\r\n\r\nThe Associated Student Body will host a week-long intramural volleyball tournament starting Sept. 22 on the Palo Alto High School Quad.\r\n\r\nThe tournament is the first of its kind at Paly since 2003. Nineteen teams are set to compete, nine of which are comprised of only senior players.\r\n\r\nDuring the first round, four games will take place per day at lunch: two during the first half and two during the second half. Games will play to 11 points or for 10 minutes. After five points, the teams will switch sides, according to the <a title=\"Paly Volleyball Guidelines\" href=\"https:\/\/docs.google.com\/document\/d\/14BJnVRpvJUlv71brY3q5OlJE0zEheHX61fhMUaMnD4w\/edit?usp=sharing\" target=\"_blank\">official guidelines<\/a>.\r\n\r\nPrize for the first place team is a $40 gift card to Chipotle, second place is a $20 gift card to Kirk's Burgers and third place is a $10 gift card to Jamba Juice, awarded to each member of the team, according senior Sports Commissioner Livi Musil.\r\n\r\n“A fun thing to look for is definitely the names of the teams,” Musil said. “I love them.”\r\n\r\nThe team names and rosters can be found <a href=\"https:\/\/drive.google.com\/file\/d\/0BwVvs8SxU-IeMDNIVkhMU2JlczRqSHdkUmdJR2RXLWYxOUVJ\/edit?usp=sharing\" target=\"_blank\">here<\/a>, courtesy of ASB.\r\n\r\nSophomore and player for the VolleyBallers Josh Code is excited to participate.\r\n\r\n“I’m most excited to have fun with my friends and my team to take home that prize,” Code said.\r\n\r\nThe games will culminate in a staff versus winners game on Tuesday, Sept. 30, according to Musil.\r\n\r\nA similar tournament took place in 2003 when a group of boys claimed they could beat the girl's varsity volleyball team. The varsity girls accepted the challenge, and ASB assisted in making it a school event.\r\n\r\nMusil hopes to bring back that same energy to this highly requested event. She says the tournament will be upbeat and energetic.\r\n\r\n“Just come and cheer,” Musil said. “It’s gonna be crazy and competitive and a lot of fun on the Quad watching the game. And watch out for flying volleyballs.”","excerpt":"The Associated Student Body will host a week-long intramural volleyball tournament starting Sept. 22 on the Palo Alto High School Quad.","date":"2014-09-20 14:55:44","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-20-at-2.21.17-PM.png","categories":["Sports","Spotlight"],"tags":{"8496":"ASB","29099":"josh code","18387":"livi musil","9021":"quad","9120":"sports","9175":"tournament","9216":"volleyball"}},{"id":74277,"title":"Football recap: Vikings dig big hole early, drop home opener 55-14","permalink":"http:\/\/palyvoice.com\/2014\/09\/20\/recap-vikings-dig-big-hole-early-drop-home-opener-55-14\/","content":"The Palo Alto High School Vikings (1-2, 0-0) were unable to overcome a sloppy first quarter start Friday night and ultimately fell to the faster and more prepared Archbishop Mitty Monarchs (1-1, 0-0) by a score of 55-14 during their regular season home opener.\r\n\r\nAfter failing to score the entire first quarter, the Vikings finally contributed to the scoreboard when senior running back Jayshawn Puckett rushed over right guard for an 11-yard score, making the score 20-7 Monarchs early in the second quarter. Puckett would later score again in the quarter on a 22-yard rush. However, Mitty senior quarterback Brett Foley kept his team in control, leading the Monarchs to a 34-14 lead at the half. According to Puckett, the Vikings started the game with a positive and ready-to-win attitude, but were rattled as Mitty's lead grew during the first half.\r\n\r\n\"I believe tonight our team came out with a mindset to win,\" Puckett said. \"But when we saw Mitty score, we let up too early and put our heads down too early and let them keep pounding the ball. We definitely have a lot of work to do especially after tonight.\"\r\n\r\nAfter both teams opened the game with punts on each of their first offensive possessions, the Monarchs scored the first of eight touchdowns when junior running back Derek Bauerle broke free from the defense for a 28-yard touchdown. Their next score occurred just one minute later, when Vikings junior quarterback Oliver Svirsky's bootleg pass was intercepted by senior defensive back Adam Acevedo, who returned the ball 33 yards for a pick-six. The Monarchs offense would tack on more points before the end of the first quarter, putting the Vikings down 20 points after just twelve minutes of play.\r\n\r\n[caption id=\"attachment_74319\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_03531.jpg\"><img class=\"size-full wp-image-74319\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_03531.jpg\" alt=\"Jayshawn Puckett runs for the end zone during the game against Mitty. Photo by Liana Pickrell\" width=\"800\" height=\"531\" \/><\/a> Senior tailback Jayshawn Puckett sprints away from Mitty defenders. Photo by Liana Pickrell[\/caption]\r\n\r\nVikings head coach Jake Halas noted after the game that he was pleased with his team's competitiveness, but ultimately was outplayed by a top-notch football program from the start.\r\n\r\n\"We got beat down pretty good by an elite school,\" Halas said. \"We're not ready to play at that level right now. It just so happens we're not there yet. We will be though.\"\r\n\r\nThe second half of the game opened up with two overpowering Monarch touchdowns, eliminating any chance of a potential comeback by the Vikings, and also silencing what had been a loud and active home crowd during the first half. While the rout continued to worsen, Svirsky, who was seen throughout the second half motivating his teammates to never give up, says that the team improved from last week's 33-0 loss at San Benito in terms of overall effort.\r\n\r\n\"It's different from San Benito,\" Svirsky said. \"San Benito we beat ourselves and gave up. This game, I feel like we fought and we fought until the end.\"\r\n\r\nThe Vikings will look to bounce back at 7:30 p.m. next Saturday Sept. 27, when they host the Palma High School Chieftains (3-0, 0-0) at Hod Ray Field.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Vikings (1-2, 0-0) were unable to overcome a sloppy first quarter start Friday night, ultimately falling to a faster and more prepared Archbishop Mitty Monarchs (1-1, 0-0) team by a score of 55-14 during their regular season home opener.","date":"2014-09-20 00:35:55","author":"Josh Yuen","categories":["Football","Sports","Sports Recap"],"tags":{"8714":"football","29126":"home opener","25424":"jake halas","25427":"jayshawn puckett","17730":"Mitty","9947":"oliver svirsky","8953":"paly"}},{"id":74093,"title":"Senior competes at World Mountain Running Championships in Italy","permalink":"http:\/\/palyvoice.com\/2014\/09\/19\/senior-competes-at-world-mountain-running-championships-in-italy\/","content":"Palo Alto High School senior Lucas Matison represented the United States Mountain Ultra Trail national team this weekend, finishing in 18th place out of 70 in his age group during the Junior World Mountain Running Championships in Casette di Massa, Italy.\r\n\r\nAccording to Matison, this would not have been imaginable six months ago when he was hit by a car while biking on Park Avenue. This confined him to a wheelchair for several weeks, keeping him out for the entire Paly track season.\r\n\r\nHowever, even when Matison doubted himself, he never gave up on his goal: to become the great runner that he once was, a runner capable of a fifth place finish at the Central Coast Section finals and winner at the Santa Clara Valley Athletic League finals.\r\n\r\n[caption id=\"attachment_74163\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10690118_893354037361353_6032725923059630164_n.jpg\"><img class=\"wp-image-74163\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10690118_893354037361353_6032725923059630164_n.jpg\" alt=\"(Paly senior Lucas Matison makes his way up a mountain during the World Mountain Running Championships in Italy last week. Matison finished in 18th place out of 70 competitors in the 16-19 year old age group. Photo by Richard Bolt). \" width=\"600\" height=\"458\" \/><\/a> Paly Senior Lucas Matison makes his way up a mountain during the World Mountain Running Championships in Italy last week. Photo by Richard Bolt.[\/caption]\r\n\r\n“With all the bad luck I had last year, it really discouraged me,” Matison said.  “At one point, soon after my accident, I felt like I would never be the same good runner I once was. But I never gave up and kept at it, and within a few months, I was able to go from a crippled kid in a wheelchair to a world champion mountain runner.”\r\n\r\nMatison’s initial goal was never anything near qualifying for the World Mountain Running Championships. As soon as he was back on his feet, he simply started to look ahead to the cross country season.\r\n\r\n“My hope for [this] cross country season is for our team to make it to state and give it all we got when we're there,” Matison said.\r\n\r\nMatison’s impressive runs during the off-season, which he recorded on the run recording app Strava, were spotted by a member of the senior United States Mountain Running team, David Roche. According to Matison, Roche advised him to send his running resume to the team’s head coach.\r\n\r\n“To qualify for the national team, you had to fill out an application with a running resume, your most impressive running achievements and send it to the junior team coach,” Matison said. “You also had to have a 5k time of 16:30 or faster. Only four boys aged 16-19 in the country are chosen.”\r\n\r\n[caption id=\"attachment_74171\" align=\"alignnone\" width=\"341\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10592921_10154621890755374_84425878604594770_n1.jpg\"><img class=\"size-full wp-image-74171\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10592921_10154621890755374_84425878604594770_n1.jpg\" alt=\"(Paly senior Lucas Matison runs up the side of a mountain in Italy during the World Mountain Running Championships on Sept. 14.  Matison, through dedication and hard work, overcame a gruesome leg injury suffered during March 2014 to make it onto the United States National Mountain Running team. Photo by Paul Kirsch.) \" width=\"341\" height=\"592\" \/><\/a> Lucas Matison runs in the 16-19 year old age group during the World Mountain Running Championships on Sept. 14. Matison, through dedication and hard work, overcame a gruesome leg injury suffered during March 2014 to make it onto the United States National Mountain Running team. Photo by Paul Kirsch.[\/caption]\r\n\r\nAccording to Matison, he was shocked when he found out that he had been selected to the U.S team .\r\n\r\n“I never thought I would even come close to making it to the world champs,” Matison said. “I am very honored and proud that I could race in the world champs.”\r\n\r\nOn Sept. 10, Matison left for Italy where he met his teammates Erik Armes, Jeff Theis, Tabor Scholl, Mandy Ortiz and Marisa Ruskan. He went over the course with them: an 8.4 kilometers course featuring a total ascent of 710 meters, one that goes through caves, up stairways and finishes on a terrace of quarry facing the sea.\r\n\r\n[caption id=\"attachment_74164\" align=\"alignnone\" width=\"1065\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/1068x352xaltimetriaP20SFP20-P20JM.jpg.pagespeed.ic_.zeDDXPFob3.jpg\"><img class=\"size-full wp-image-74164\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/1068x352xaltimetriaP20SFP20-P20JM.jpg.pagespeed.ic_.zeDDXPFob3.jpg\" alt=\"Profile of the Junior Mountain Running World Championship at Cassette di Cassa, Italy\" width=\"1065\" height=\"352\" \/><\/a> Profile of the Junior Mountain Running World Championship at Cassette di Cassa, Italy.[\/caption]\r\n\r\nMatison says that everyone gave all they had to finish in 10th place in the overall team rankings.\r\n\r\n“I am very pleased by my team's performance,” Matison said. “Everyone gave it all they had. My hope was to give it all I got to help the USA team as much as I could.\"\r\n\r\nMatison is currently concentrating on the upcoming Paly cross country season, in addition to the Foot Locker cross country championship.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Palo Alto High School senior Lucas Matison represented the United States Mountain Ultra Trail national team at the Junior Mountain Running Championships in Casette di Massa, Italy. His 18th place during the competition ranks him as one of the fastest mountain runners in his age group in the world. ","date":"2014-09-19 16:15:08","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10690118_893354037361353_6032725923059630164_n.jpg","categories":["Features","Spotlight"],"tags":{"10041":"Lucas Matison","9120":"sports","29083":"world mountain running championships"}},{"id":74081,"title":"Football liveblog: Palo Alto vs. Mitty","permalink":"http:\/\/palyvoice.com\/2014\/09\/19\/football-liveblog-palo-alto-vs-mitty\/","content":"<em>Check back at 7:30 p.m.  Friday for live coverage of Palo Alto High School's first home football game of the season.<\/em>\r\n\r\n&nbsp;\r\n\r\n[liveblog]","excerpt":"Palo Alto High School's football team takes on Mitty for its first home game 7:30 Friday. ","date":"2014-09-19 09:52:30","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/chryst-hands-ball-to-7.jpg","categories":["Football","Sports"],"tags":{"8714":"football","29082":"home game","17730":"Mitty","10617":"season opener"}}]