[{"id":78526,"title":"Extended lunch for annual Turkey Trot on Nov. 21","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/extended-lunch-for-annual-turkey-trot-on-nov-21\/","content":"","excerpt":"","date":"2014-11-10 18:54:16","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32577":"extended lunch","32578":"special schedule","10165":"turkey trot"}},{"id":78523,"title":"Second quarter progress report grading period ends Nov. 14","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/second-quarter-progress-report-grading-period-ends-nov-14\/","content":"","excerpt":"","date":"2014-11-10 18:53:01","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8741":"grades","32575":"grading period","32576":"progress report","32574":"second quarter"}},{"id":78521,"title":"Community service information meeting at 7 p.m. on Nov. 12 in the LCR","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/community-service-information-meeting-at-7-p-m-on-nov-12-in-the-lcr\/","content":"","excerpt":"","date":"2014-11-10 18:51:01","author":"Lizzie Chun","categories":["Ticker"],"tags":{"14812":"community service","32573":"get involved","10043":"meeting","8953":"paly","32455":"volunteer"}},{"id":78179,"title":"Editorial: Improving the community&#8217;s approach to mental health","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/editorial-improving-the-communitys-approach-to-mental-health\/","content":"Last week, a Gunn High School student died by suicide, adding to at least three other teen suicides that have occurred in the Bay Area within the last month. The grief caused by these incidents reverberates similar feelings across the community after the loss of individuals in a series of teen suicides in 2009. The Paly Voice staff sends its hearts out to all those affected by the loss in our community. It seems all too often that students, teachers, administrators and family members are mourning for the loss of a young community member. The Paly Voice shares its suggestions for making suicide prevention and mental health recovery a top priority for every person in the community.\r\n\r\nBut first, let’s consider some background information. It is impossible to pinpoint one main reason for the cause of suicide in teenagers. However, the <a href=\"https:\/\/www.afsp.org\/understanding-suicide\/key-research-findings\">American Foundation for Suicide Prevention<\/a> points to mental disorders, medical conditions, pain and environmental stressors such as academic stress and pressure as the most probable causes of suicide. It is important to note that suicide is not an issue unique to our school district. According to <a href=\"http:\/\/www.save.org\/\">Suicide Awareness Voices of Education<\/a>, an individual dies by suicide every 13 minutes in the United States.\r\n\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/3427051-untitled-infographic\" width=\"600\" height=\"394\" frameborder=\"0\" scrolling=\"no\"><\/iframe>\r\n\r\nSecond, although no direct cause of suicide is known, our community and district have taken various measures to change both Gunn and Palo Alto High School’s climates in the last few years. In <a href=\"http:\/\/www.paloaltoonline.com\/print\/story\/2009\/08\/28\/amid-fear-of-another-suicide-vows-of-vigilance\">2009<\/a>, it was suggested and enforced that the \"Living Skills\" course, a required class for high schoolers in the Palo Alto Unified School District, include mental health education. In the same year, according to <a href=\"http:\/\/www.nbcnews.com\/id\/33574154\/ns\/us_news-life\/t\/anguish-over-calif-teen-suicides-spurs-action\/#.VFsOdoekQig\">NBC News<\/a>, students from Gunn came together to post optimistic notes around campus, create peer-run support groups and distribute T-shirts with the message “Talk to Me.” This year, Caltrain created a <a href=\"http:\/\/www.caltrain.com\/riderinfo\/safety_security\/Suicide_Prevention.html\">suicide prevention webpage<\/a> that includes a crisis hotline number and links to local, regional and national resources. Local organizations aimed at preventing suicides, such as <a href=\"http:\/\/www.psnpaloalto.com\/\">Project Safety Net<\/a>, have been revamped to move forward with their mission statement of ensuring the well-being of youths. A team of healthcare professionals in the Bay Area, the <a href=\"http:\/\/www.heardalliance.org\/\">HEARD Alliance<\/a>, makes it its goal to enhance the community’s ability to respond to adolescent depression.\r\n\r\nAlthough our community has proposed and implemented measures for changes that have increased suicide awareness and the importance of emotional health, there are several other key suggestions that The Paly Voice would like to bring to light in the need for suicide prevention within our community.\r\n\r\n<strong>1. Remove the stigma around counseling<\/strong>\r\n\r\nDespite the excellent range of counseling services at both Paly and Gunn, students can feel reluctant to receive counseling or discouraged to improve their mental health because of a stigma surrounding counseling. This stigma leads to students who often feel that counseling can only be utilized by severely upset or mentally ill students. However, the American Counseling Services study shows that 80 percent of adolescents seen by counselors five or more times improved their level of functioning.\r\n\r\nA method to remove this stigma includes the refinement of strategies by school board members along with high school administration teams to more effectively offer help for students, with the assurance that students receive this help when needed. One way to go about doing so is by redefining the connections formed between students and counselors.\r\n\r\nWe urge students to form relationships with their advisors, guidance counselors or teachers so that in a time of need, students will have a trusted adult to speak with and confide in.\r\n\r\nThe Paly Voice believes that each student should receive a call slip for a brief meeting sometime throughout the year with an advisor or a guidance counselor. This would allow the student to become acclimated to an adult on campus and to become informed about the various counseling services offered. It is essential to have students feel welcomed and safe on campus, and with more exposure to an adult through individual meetings, these relationships can be formed.\r\n\r\n<strong>2. Ensure guidance counselors are familiar faces on campus<\/strong>\r\n\r\nA secondary method to improve the connection between students and on-campus adults is by ensuring guidance counselors, those in charge of helping students through social emotional support, have a greater presence on campus. Currently each guidance counselor spends one lunch a week on the Quad familiarizing themselves with the students, according to the junior class Guidance Counselor Susan Shultz. Their familiarity throughout the community should be extended through counselor-mediated discussions, whether they be at club meetings or in the theater, as this would give students a time to interact with their counselor in a comfortable, informative and relaxing environment.\r\n\r\n<strong>3. Improve the community’s social media presence<\/strong>\r\n\r\nWhat changes do occur, however, are fruitless unless students recognize that administration members are not the only ones who can make a change in our community. Change does not happen from top down and cooperation from the student body is necessary for any of these changes to reach their full potentials. Teamwork between the student body and district will serve to provide a safer learning environment for all.\r\n\r\nStudents can help by being mindful of their presence on social media in the event of a suicide. While family and friends may want to celebrate the deceased’s life through fond posts of memories, there can be ill consequences to this well-intended gesture. According to the <a href=\"https:\/\/www.afsp.org\/\">American Foundation for Suicide Prevention<\/a>, there is a well-documented copycat effect of suicides, in which one suicide death may contribute to another. Social media posts that glamorize the life of an individual convey an improper message to those struggling with mental health issues. Suicide is a serious issue, and it should never be presented as an option. The Paly Voice reminds the community that it is important to remember but not glorify those lost to suicide.\r\n\r\nA safer and more positive community can be achieved through various changes by both the district <i>and <\/i>the students. No matter who you are, you can make a difference. Change begins with you.","excerpt":"Although our community has proposed and implemented measures for changes that have increased suicide awareness and the importance of emotional health, there are several other key suggestions that The Paly Voice would like to bring to light in the need for suicide prevention within our community.","date":"2014-11-10 18:50:17","author":"The Paly Voice","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/photo-3.jpg","categories":["Editorial","Spotlight"],"tags":{"32450":"counseling","32451":"destigmatize","32449":"editorial","8751":"gunn","8752":"gunn high school","8944":"palo alto high school","8953":"paly","9135":"suicide","9136":"Suicide prevention"}},{"id":78518,"title":"First day of Drowsy Chaperone musical auditions at 2:30 p.m. on Nov. 20","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/first-day-of-drowsy-chaperone-musical-auditions-at-230-p-m-on-nov-20\/","content":"","excerpt":"","date":"2014-11-10 18:48:48","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32571":"drowsy chaperone","19628":"musical","18258":"paly theatre","32572":"theatre department"}},{"id":78449,"title":"Preview: Girls&#8217; tennis prepares for first round of CCS","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/preview-girls-tennis-prepares-for-first-round-of-ccs\/","content":"[caption id=\"attachment_78508\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image3.jpg\"><img class=\"wp-image-78508\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image3.jpg\" alt=\"image3\" width=\"350\" height=\"262\" \/><\/a> Members of the girls' tennis team listen as Athletic Director Jason Fung congratulates them on their CCS qualification. The team qualified for the tournament after winning all 12 of its league games. Photo by Wesley Woo.[\/caption]\r\n\r\nThe Palo Alto High School girls’ tennis team (16-4, 12-0) enters the upcoming Central Coast Section tournament tomorrow with high hopes after coming off an undefeated league season.\r\n\r\nHowever, senior captain Madeline Lee emphasized the difference in level between CCS matches and regular league matches.\r\n\r\n“We are looking at tough competitors,” Lee said.  “Since we were in the lower league, we are the only team [from that league] to continue on to CCS. This means that our draw will immediately pit us against a team from the upper league and it will be a challenge, regardless of who we play.”\r\n\r\nOne of the Paly players to watch for in the tournament is sophomore Avanika Narayan, the team’s current No. 1 singles player.  Narayan was seeded No. 1 in the recent Santa Clara Athletic Valley League tournament, where she got to the finals.\r\n\r\n“Avanika is great,” Lee said.  “She's a sophomore and she was our No. 3 [singles] player last year. The one and two singles players graduated, so this year she’s taken the No. 1 spot.  She was seeded at No. 1 and had a bye the first round.”\r\n\r\nAccording to Narayan, the key to her individual success has been hard work and resilience.\r\n\r\n“I put in a lot of time into my training,” Narayan said. “I play before and after school and I do a lot of physical fitness training.  I have been playing tournaments since I was 9 and have competed in both regional and national events — I owe my resilience to all my experiences competing in these tournaments. Tennis is a very mental sport: Problem-solving and mental toughness are key components of it.“\r\n\r\nNarayan also underlined the team’s positive attitude as the season comes to an end.\r\n\r\n“We are the league champions and everyone on the team is super excited for the tournament,” Narayan said. “We will go really far this year [and coach Andy Harader] has been really supportive of the team and has created a great line up.”\r\n\r\nThe team’s next match is at 2:30 p.m. on Tuesday, Nov. 11 at Carmel Valley High School, where the Vikings will take on Carmel Valley High School (17-0, 12-0) in the first round of the CCS tournament.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ tennis team (16-4, 12-0) enters the upcoming Central Coast Section tournament tomorrow with high hopes after coming off an undefeated league season.","date":"2014-11-10 16:32:00","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/image3.jpg","categories":["Sports"],"tags":{"32562":"Avanika Narayan","10019":"girls tennis","8804":"jason fung","25271":"madeline lee","10016":"tennis"}},{"id":78408,"title":"Slideshow: Volleyball wins Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/10\/slideshow-volleyball-wins-senior-night\/","content":"<p>The Palo Alto High School girls' volleyball team (18-11, 4-8) won its Senior Night game against cross-town rival Gunn High School (16-13, 3-8) in Thursday's game in the Big Gym.<\/p>\r\n<p>Before the start of the match, the Vikings celebrated seven seniors: captain and right side hitter Molly Fogarty, defensive specialist Kabria Dame, captain and outside hitter Anna Dukovic, right side hitter Gillian Chryst, captain and outside hitter Jade Schoenberger, outside hitter Hayley Poore and middle blocker Charlene Zhu.<\/p>\r\n<p>The Vikings then went on to win in three sets: 25-22, 25-17 and 25-19.<\/p>\r\n<p>Paly will next take on Independence High School (20-10, 11-3) for the first round of the Central Coast Section at 7 p.m. on Wednesday Nov. 12 in the Big Gym.<\/p>\r\n<p>[slideshow post_id=78408]<\/p>\r\n","excerpt":"The Palo Alto High School girls' volleyball team (18-11, 4-8) won its Senior Night game against cross-town rival Gunn High School (16-13, 3-8) in Thursday's game in the Big Gym.","date":"2014-11-10 13:26:06","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/LRP_1401.jpg","categories":["Slideshow","Sports"],"tags":{"32530":"anna dukovic","23599":"charlene zhu","32531":"gillian christ","32532":"gillian chryst","11244":"girls volleyball","30049":"hayley poore","9880":"jade schoenberger","32529":"kabria dame","32528":"molly fogarty","9087":"Senior Night","9216":"volleyball"}},{"id":78252,"title":"Opinion: Destigmatize counseling in the Palo Alto community","permalink":"http:\/\/palyvoice.com\/2014\/11\/09\/opinion-destigmatize-counseling-in-the-palo-alto-community\/","content":"Counseling at Palo Alto High School is highly stigmatized, and is a concept many students are ignorant towards. Some do not know what Adolescent Counseling Services is or exactly what it does.\r\n\r\n[caption id=\"attachment_78393\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg\"><img class=\"wp-image-78393\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg\" alt=\"photo\" width=\"400\" height=\"300\" \/><\/a> Adolescent Counseling Services is located both next to the Academic Resource Center in the Library and in the Tower Building. ACS provides counseling for students one-on-one and in groups. Photo by Lydia Barry.[\/caption]\r\n\r\nThis is not right.\r\n\r\n\"I don't think people utilize [counseling] as much as they could,\" senior Sharissa Holopainen said. \"Many students fear it could be viewed as a weakness.\"\r\n\r\nWe as an educational community need to destigmatize counseling for students. Staff and students alike must begin to view counseling as a positive thing at our high school, not as a sign of weakness.\r\n\r\nSo let's set one thing straight: Going to counseling is completely normal.\r\n\r\nCounseling is not just for the mentally ill. According to the ACS <a href=\"http:\/\/paly.net\/adolescent-counseling-services\">webpage<\/a>, students can go to counseling for a range of reasons such as (but not limited to): peer relationships, isolation, grief and loss, substance abuse, depression, cross-cultural issues, self esteem, academic stress, sexuality, parent\/child communication and anxiety.\r\n\r\n\"People often associate asking for help as a negative thing,\" senior Chloe Finley said. \"I think we should continue to stress the importance of asking for help when you need it and that talking about your problems with a counselor is very beneficial.\"\r\n\r\nCounseling can be in individual or group sessions. Counseling can be for when you're having a bad day, or when you get into a fight with your parents. It can be for when you fail a test, or even when you've just gotten great news and want someone to listen.\r\n\r\nNow that we've cleared all that up, let's talk about who else you can talk to on campus if you aren't inclined to attend ACS. At Paly, your Teacher Adviser and guidance counselor are trained to assist you if you ask them for help. They can refer you to someone to talk to, help you manage your stress or just be there to listen. Not to mention, your peers and teachers can often be an incredible support system, and we should not forget to rely on them in times of need. There are countless people at Paly who want to help you through whatever you're going through.\r\n\r\nCounseling is a great method for helping students that our school provides for free. Don't assume that if you weren't referred to the counselor or diagnosed as having a mental illness that counseling can't help you. Even going to visit the counselor to say hi and get acquainted is a great way to get comfortable with both the counselors and the general idea of counseling.\r\n\r\nEven if you are completely content with yourself and your life, encouraging others to go and being knowledgable about counseling services on campus can do a lot.\r\n\r\n\"I think the best way to stop the stigma is to get both students and adults who have struggled and who have used counseling to help them manage to come clean about it,\" junior Elana Rebitzer said. \"I know it's a really difficult topic for a lot of people, but if students see peers and respected adults saying 'I had a tough time, I was in your shoes, but going through counseling helped me to be where I am today' more students would be likely to try it.\"\r\n\r\nStudents: We are a community within ourselves. As much as we would like them to, often times parents and school staff simply do not understand what we go through like we do. It is our responsibility as well to look out for our peers. It is also important to not forget to look out for yourselves. Yes, we are in high school, but we are also in a crucial time in our lives. I implore you all to have some fun. Spend time doing things you love. Go out with your friends. Put your homework down and go for a walk. You are all important not just as students, but as people.\r\n\r\n<em>ACS is located both off the Quad in the library (next to the Academic Resource Center) and in the Tower Building on the first floor in room 5 1\/2.<\/em>\r\n\r\n<em style=\"color: #000000;\">A list of school and community resources are available on the <a style=\"color: #31318c;\" title=\"PAUSD Health Services\" href=\"http:\/\/pausd.org\/parents\/services\/health\/index.shtml\" target=\"_blank\">PAUSD Health Services page<\/a> and the <a style=\"color: #31318c;\" title=\"PAUSD Counseling Services\" href=\"http:\/\/pausd.org\/parents\/services\/counseling\/\" target=\"_blank\">Counseling Services page<\/a>. If you need immediate assistance, the Santa Clara County Suicide and Crisis Hotline is available at 1-855-278-4204 at any time. These numbers are also available on the back of student ID cards. If you feel you or someone you know needs immediate support, please call 911.<\/em>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"We as an educational community need to destigmatize counseling for students.","date":"2014-11-09 20:39:07","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/11\/photo1.jpg","categories":["Opinion","Spotlight"],"tags":{"32450":"counseling","8751":"gunn","8939":"palo alto","8953":"paly"}},{"id":78431,"title":"T day schedule on Monday, Veterans Day holiday on Tuesday","permalink":"http:\/\/palyvoice.com\/2014\/11\/08\/t-day-schedule-on-monday-due-to-veterans-day-off\/","content":"","excerpt":"","date":"2014-11-08 13:54:51","author":"Lizzie Chun","categories":["Ticker"],"tags":{"32534":"holiday","29302":"schedule","32535":"t day","32533":"veterans day"}},{"id":78397,"title":"Football to play Milpitas on Senior Night","permalink":"http:\/\/palyvoice.com\/2014\/11\/07\/football-to-play-milpitas-on-senior-night\/","content":"The Palo Alto High School football team (3-5, 2-2) will take on Milpitas High School (8-0, 4-0) on Senior Night at 7 p.m. today at home.\r\n\r\nBoth teams are coming off wins, as the Vikings defeated Santa Clara High School 55-26 at Paly's Homecoming game while the Trojans are fresh off of a victory on their Senior Night, defeating Los Gatos 27-21.\r\n\r\nPaly junior wide receiver and captain Eli Givens knows that the team must be prepared going into this matchup.\r\n\r\n\"We feel ready,\" Givens said. \"We've been preparing for this all season.\"\r\n\r\nGivens also appreciates the effort and the dedication this year's seniors have put into the team.\r\n\r\n\"We only have five seniors,\" Givens said. \"They haven't quit on us even though some others did. It means a lot to the juniors, sophomores and freshmen that they haven't given up on this team.\"\r\n\r\nDespite some tough losses, Givens is encouraged by the teams' gradual improvement.\r\n\r\n\"It's been frustrating losing some games that we knew we could have won or at least done better,\" Givens said. \"But we have gotten better as a team from the beginning of the season to now. And it's really exciting to see that.\"\r\n\r\nThe commemorations for the five seniors will start prior to kickoff.","excerpt":"The Palo Alto High School football team (3-5, 2-2) will take on Milpitas High School (8-0, 4-0) on Senior Night at 7 p.m. today at home.","date":"2014-11-07 16:13:33","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o.jpg","categories":["Football","Sports"],"tags":{"9656":"eli givens","8714":"football","8889":"milpitas","8953":"paly","9087":"Senior Night"}}]