[{"id":71141,"title":"Feature: The “shark fetus guy”","permalink":"http:\/\/palyvoice.com\/2014\/04\/30\/feature-the-shark-fetus-guy\/","content":"Collecting has the ability to connect people. It brings people together by giving them a common goal as they strive to find dollar coins, rare postage stamps, out-of-print comic books or whatever else they fancy. Collectors rejoice with each new addition to their collections and take pride in showing off their finds.\r\n\r\n[caption id=\"attachment_71172\" align=\"alignright\" width=\"336\"]<img class=\"wp-image-71172 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose1.png\" alt=\"alexrose1\" width=\"336\" height=\"448\" \/> Palo Alto High School sophomore Alex Rose proudly holds his prized shark fetus that started his interest in collecting animal taxidermies and also earned him a unique nickname. Throughout his life, Rose has been called multiple nicknames, including Rosy (for his rosy cheeks after Physical Education class), “the Costco guy” (when he used to share his lunch in elementary school) and now is known as “the shark fetus guy.” “I like being the guy with all the nicknames,” he said. Photo by Bethany Wong.[\/caption]\r\n\r\nFor Palo Alto High School sophomore Alex Rose, the thrill comes from collecting objects that surprise people. Everything in his collection screams unusual, whether it be a prickly dead pufferfish, a puzzle box that seems to have no obvious opening, a miniature model of a Volkswagen car or even the seemingly ordinary ring around his finger.\r\n\r\nAt first glance, the ring, a woven tangle of sterling silver strands, looks like any other piece of jewelry. As Rose slides it off and performs a complicated algorithm, the ring detaches into eight separate hoops, revealing that this is actually a puzzle ring.\r\n\r\nAccording to Rose, his love for collecting oddities fits nicely with his love of meeting and befriending other people because items like the ring are perfect conversation starters.\r\n\r\n“I collect oddities ... because I want people to remember me for owning them,” Rose said.\r\n\r\nBy most standards, Rose’s collection is indeed memorable. People who see his shelves are especially drawn to the display of animal taxidermies such as a frog, various animal brains and a unique shark fetus.\r\n\r\n“His friends ... think his shelf is super original and fun,” Rose’s girlfriend sophomore Hannah Subega said. \"There's always something there for his friends to look at.”\r\n\r\nRose’s interest for collecting animal preserves began when he received a shark fetus from Subega’s younger brother, the previous owner. According to Subega, Rose was the ideal recipient of the shark fetus because he, unlike others, did not cringe at the sight of the unborn shark.\r\n\r\n“I wasn't too surprised that Alex was glad to take it off my brother's hands,” Subega said.\r\n\r\nAccording to Subega, the shark fetus used to be a Christmas gag gift that was regifted yearly, but “luckily, we [Subega’s family] found someone who actually wants it,” Subega said.\r\n\r\nAlthough Rose now collects objects that can make people scream with disgust, when he first began collecting as an Escondido Elementary School student, Rose collected more ordinary items.\r\n\r\nIn elementary school, the pockets of his cargo pants held all the crystals, rocks, seashells, watches and coins he brought to school to show his friends, according to Rose.\r\n\r\n“I wore cargo pants ... because I could fill the pockets with stuff,” Rose said.\r\n\r\nIf Rose could not carry all the knick-knacks in his pockets, he kept them at home in a box which he called his “special things box.” Originally, Rose said the box contained a small conglomeration of puzzles, such as uncommon Rubik’s cubes. However, once his father began bringing home souvenirs from his business trips, the items found a new home in a larger container.\r\n\r\n[caption id=\"attachment_71169\" align=\"alignleft\" width=\"255\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose4.png\"><img class=\"wp-image-71169\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose4.png\" alt=\"alexrose4\" width=\"255\" height=\"340\" \/><\/a> Rose devotes twelve full shelves to his collection with separate shelves for his animal display, Rubik’s cubes, puzzles and French antiques. His collection has outgrown the box he once used – his “special things box\" – and has become a striking ceiling-floor display. Photo by Bethany Wong.[\/caption]\r\n\r\nIn eighth grade, Rose moved into a new bedroom that featured a set of empty shelves on which he started displaying his favorite collections.\r\n\r\nWhen people complimented him on his shelf, Rose found that he enjoyed watching their reactions. Particularly, Rose said that he has always appreciated the way his eccentricities have earned him nicknames.\r\n\r\n“In fifth grade, people called me 'the Costco guy,'” Rose said. “I would hand out parts of my entire lunch [like Costco food samples] to my friends because it gave me attention.”\r\n\r\nLong gone are the days of being jokingly associated with the food sample dispensers at Costco. Today, Rose is better known as a collector of oddities.\r\n\r\nOn a vacation in Paris during the summer of 2012, Rose’s collection grew immensely. While the rest of his family wanted to shop for clothing, Rose preferred to scrounge through the antique shops. It was on this trip that he realized that accumulating oddities could actually become a rewarding hobby.\r\n\r\n“I spent all my money on these outrageous antiques, such as pickle flavored toothpaste, an optical illusion that looks like a melting clock, puzzle boxes and a Frankenstein-like figurine with parts from a baby doll, a skull face, a crown and a rib cage, but it was so worth it,” Rose said.\r\n\r\nAccording to Rose, his most prized piece from Paris is a crystal that shows the face of a clock from one side and looks like a compass from the other side.\r\n\r\nHaving depleted his spending money in Paris, Rose slowed down on his collecting spree once he returned to Palo Alto. Consequently, his family thought his collecting was just a temporary obsession, according to Rose.\r\n\r\n“My family thought it was pretty amusing and didn’t think I was serious,” Rose said\r\n\r\nHowever, everything changed on Christmas Day of his freshman year when he opened a present from Subega’s brother. Noticing Rose’s fascination with trinkets like his puzzle ring, the brother gave Rose a bottle containing a shark fetus that still had its eyes covered with skin. Rose said this gift rekindled his passion for collecting.\r\n\r\n[caption id=\"attachment_71171\" align=\"alignleft\" width=\"261\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose2.png\"><img class=\"wp-image-71171\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose2.png\" alt=\"alexrose2\" width=\"261\" height=\"347\" \/><\/a> Rose’s shark fetus, preserved in a glass bottle, rests on one of the shelves directly at eye level. The shark fetus, young enough to still have its eyes covered with skin, was given to Rose as a Christmas present. “I’ll always remember this gift as the beginning of an addiction,” Rose said. Photo by Bethany Wong.[\/caption]\r\n\r\nAccording to Rose, he had never been this excited about a gift before.\r\n\r\nHe soon discovered a television program called “Oddities,” which showcased animal taxidermy collectors’ items like pig fetuses and double-headed monkeys. This program sparked Rose’s passion for finding more animal parts that make people’s eyes boggle with both gruesome interest and fascination, according to Rose. His collection now includes a diverse range of animal parts and preserves.\r\n\r\n<span class=\"Apple-style-span\" style=\"font-weight: 800;\">\"<\/span>Here are my brains,” Rose said, as he pointed to snake, rabbit, frog and bird brains sitting on a shelf.\r\n\r\nNowadays, Rose basks in the attention he gets from being known as the “shark fetus guy.”\r\n\r\n“I like it when people are able to say, ‘I remember Alex Rose. He’s the guy with the shark fetus,’” Rose said.\r\n\r\nOver time, Rose realized that part of what inspires him to keep collecting is the satisfaction of learning the story behind each item.\r\n\r\nAccording to Rose, he likes being able to say, “This isn't only a ring, but a ring that is also a puzzle.”\r\n\r\nRose delights in seeing the others’ reactions when they find out that his ring is a more than what meets the eye. With eyes aglow, Rose explains the historical significance of puzzle rings. In medieval times, kings gave their wives the puzzle rings as wedding bands, according to Rose. If a wife cheated on her husband and wanted to remove the ring, the ring would fall apart and the king would know his wife had been disloyal.\r\n\r\n“I enjoy surprising people with something they wouldn’t expect,” Rose said.\r\n\r\nDespite his interest in oddities, it is very unlikely for his collecting to become his future career, Rose said.\r\n\r\n[caption id=\"attachment_71170\" align=\"alignleft\" width=\"289\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose3.png\"><img class=\"wp-image-71170 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/alexrose3.png\" alt=\"Rose’s puzzle ring lies on a table showing its two different forms. Rose frequently wears his puzzle ring because it serves as a great way to begin a conversation. The ring was a gift from Rose’s girlfriend, Hannah Subega. Photo by Bethany Wong.\" width=\"289\" height=\"217\" \/><\/a> Rose’s puzzle ring lies on a table in its two different forms. Rose frequently wears his puzzle ring because it serves as a great way to begin a conversation. The ring was a gift from Rose’s girlfriend, Hannah Subega. Photo by Bethany Wong.[\/caption]\r\n\r\n“It is a very expensive hobby, no doubt,” Rose said. “I think it [my collection] will just be the kind of thing I keep in the office, not a professional career.”\r\n\r\nAccording to Rose, he is more inclined to pursue a career in application development and dreams of one day starting his own technology business. Regardless of what career path he chooses, Rose says he believes he will find a way to engage his appreciation of creativity and his love of the bizarre.\r\n\r\nRose carries his love for trinkets wherever he goes. He always has his daily essentials: his phone, his wallet and two to three trinkets that might be handy conversation starters.\r\n\r\n“I never leave the house without full pockets,” Rose said.\r\n\r\n&nbsp;","excerpt":"While many students engage in more \"normal\" hobbies, sophomore Alex Rose finds gratification in collecting oddball trinkets and novelties.","date":"2014-04-30 18:23:43","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-Shot-2014-04-30-at-5.52.16-PM.png","categories":["Features","Spotlight"],"tags":{"15665":"alex rose","15667":"collection","15668":"collector","15670":"hannah subega","15669":"oddities","8944":"palo alto high school","15671":"personality profile","15666":"shark fetus guy","15672":"trinkets"}},{"id":71119,"title":"Missed opportunities send Vikings to fourth straight loss; Wildcats clinch division title","permalink":"http:\/\/palyvoice.com\/2014\/04\/29\/missed-opportunities-send-vikings-to-fourth-straight-loss-wildcats-clinch-division-title\/","content":"[caption id=\"attachment_71122\" align=\"alignnone\" width=\"618\"]<img class=\"size-full wp-image-71122\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/baseballrecaplosgatos.png\" alt=\"The Lone Viking: Right fielder Phil Lewis (#25) watches dolefully as Los Gatos celebrates it’s De Anza division title following a 4-3 win in extra innings over Paly. Photo by Josh Yuen. \" width=\"618\" height=\"464\" \/> The Lone Viking: Right fielder Phil Lewis (#25) watches dolefully as Los Gatos celebrates its De Anza division title following a 4-3 win in extra innings over the Vikings Saturday at Paly. Photo by Josh Yuen.[\/caption]\r\n\r\nDespite multiple chances to take the lead late in the game, the Palo Alto High School Vikings varsity baseball team (11-12, 5-5) fell once again to the Los Gatos Wildcats (20-4, 11-1) in extra innings by a score of 4-3 Saturday at Paly.\r\n\r\nThe Wildcats finished with 14 hits, scoring early in the second inning on Campbell Robertson’s sacrifice fly. They battered Vikings starter Brian Kannappan in the fourth, when they took advantage of a throwing error by scoring two runs. While Los Gatos threatened to score in the later innings, pitchers Justin Hull and Chris Smith of the Vikings used key strikeouts and timely double plays to prevent the Wildcats from scoring any more.\r\n\r\nThe Vikings squandered several opportunities to score runs and win the game, but got on the scoreboard in the third when right fielder Phil Lewis hit a sharp ground-ball to the left of shortstop to score center fielder Bowen Gerould.\r\n\r\nIn the fifth inning, Lewis advanced Gerould to second on a single after Gerould chased starter Johnny Breidenthal by drawing a walk. A wild pitch set up both runners in scoring position, and Cleasby proceeded to score Gerould on an RBI single to center field. Cleasby later came around to score on a wild pitch by the new pitcher Bigge, tying the game at three apiece.\r\n\r\nThe sixth and seventh innings featured the Vikings getting runners on base, only to have Bigge pitch out of each jam and keep the game tied. With runners at second and third with just one out in the seventh, Bigge got catcher Austin Kron to ground-out softly, before striking out third baseman Noah Phillips.\r\n\r\nWhen Robertson, the Wildcats’ no. 8 hitter in the lineup, stepped into the box to lead off the top of the eighth inning, his one goal was to get on base and represent the go-ahead run. Robertson, a senior, was yet to hit a home run on the season coming into the at-bat. The entire Wildcats’ team had only two total coming into Saturday’s game.\r\n\r\n“I looked down at my third base coach and he said that [he] was just giving me the sign to get on base, so I was just trying to get on base,” Robertson said.\r\n\r\nWith the wind blowing out towards left, Robertson ended up drilling Bicknell’s fastball over the left field fence to give his team a one-run lead. Clapping his hands as he rounded third, the team rushed out of the dugout to greet him at home plate.\r\n\r\n“In the eighth, I thought I made a good pitch and he got down to it and hit it out,” Bicknell said, after taking the loss.\r\n\r\nPitcher Hunter Bigge closed out the game with a shut-down bottom of the eighth, securing his team the one-run victory. When Gerould was tagged out at first to end the game, the Wildcats poured onto the diamond once again, mobbing Bigge and crushing him under a dog-pile of ecstatic players. To the great dismay of the Vikings home crowd, the Wildcats had clinched the division title.\r\n\r\n“We’ll go out and celebrate a little, come back, get back to work, keep winning, and now we’re looking forward to the league tournament now,” said Robertson, who finished with a team-leading three RBI’s.\r\n\r\nEven an extra fly-ball or a ball put into play past the pitcher was the difference between a Vikings win or loss. According to designated hitter Lawrence Han, the team played well against the division’s top team, but ultimately made a few too many mistakes.\r\n\r\n“I think we played pretty well but we just had a few bad breaks and there were some things that could have gone our way but didn’t,” Han said.\r\n\r\nWith just two games remaining on the schedule and a four-game losing streak, the Vikings find themselves sitting in fifth place, one spot outside the playoffs. They take on the Spartans of Mountain View next week, looking to get back to their winning ways.\r\n\r\n&nbsp;","excerpt":"Despite multiple chances to take the lead late in the game, the Palo Alto High School Vikings varsity baseball team (11-12, 5-5) fell once again <a href=\"http:\/\/palyvoice.com\/2014\/04\/29\/missed-opportunities-send-vikings-to-fourth-straight-loss-wildcats-clinch-division-title\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-04-29 13:05:06","author":"Charles Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/baseballrecaplosgatos.png","categories":["Sports","Spotlight"],"tags":{"8410":"Baseball","15410":"game","9914":"los gatos","8953":"paly","9210":"vikings"}},{"id":71095,"title":"Paly students to compete in app showcase","permalink":"http:\/\/palyvoice.com\/2014\/04\/26\/paly-students-to-compete-in-app-showcase\/","content":"<p>[caption id=\"attachment_71102\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg\"><img class=\"wp-image-71102\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg\" alt=\"Students from Palo Alto High School are going to take part in the Applications Challenge Showcase finals tomorrow at the Palo Alto Arts Center. Photo by Julianna Heron.\" width=\"350\" height=\"283\" \/><\/a> Students from Palo Alto High School are going to take part in the Applications Challenge Showcase finals tomorrow at the Palo Alto Arts Center. Photo by Julianna Heron.[\/caption]<\/p>\r\n<p>Students from Palo Alto High School are participating in the Applications Challenge Showcase finals with the ClickPA Mobile app. The showcase will take place from 1 p.m. to 4 p.m. tomorrow at the Palo Alto Art Center.<\/p>\r\n<p>ClickPA Mobile is an app where teenagers can pull up events and activities to do around the city, according to app team member  junior Fabian Garduño.<\/p>\r\n<p>“We [the ClickPA team] put all the events and opportunities in Palo Alto for teens in one easy, one-stop place,” Garduño said. “We basically funnel all teen events in the area.”<\/p>\r\n<p>The Paly students who are a part of making the app are juniors Charlie Mihran, Ryan Huang, Fabian Garduño, Bryan Wong and Charles Yu. There are also some students from Gunn High School who are a part of the ClickPA Mobile team.<\/p>\r\n<p>ClickPA Mobile is in the finals against nine other applications. The other applications in the competition vary in function from showing people where the nearest parking space is to helping dog owners communicate about dog-related activities. While the team is up against some competition, it is hoping to do well in the Showcase, according to Garduño.<\/p>\r\n<p>“I think we have a very good chance of winning, but I'm not getting my hopes up too high,” Garduño said.<\/p>\r\n<p>The ClickPA Mobile team has been working on the application for a couple of months, but the idea originally came from the group’s <a href=\"clickpa.org\">website<\/a>.<\/p>\r\n<p>To learn more about the ClickPA Mobile team, click <a href=\"www.youtube.com\/watch?v=4wJbd72nW_k\">here<\/a>.<\/p>\r\n","excerpt":"Students from Palo Alto High School are participating in the Applications Challenge Showcase finals with the ClickPA Mobile app. The showcase will take place from 1 p.m. to 4 p.m. tomorrow at the Palo Alto Art Center.","date":"2014-04-26 17:19:26","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-2.jpg","categories":["News"],"tags":{"8488":"applications","15397":"applications challenge showcase","15394":"apps","15396":"clickpa","15395":"clickpa moile","13032":"fabian garduno","11979":"hack","15393":"showcase"}},{"id":70963,"title":"Slideshow: NIOS Day Three","permalink":"http:\/\/palyvoice.com\/2014\/04\/24\/slideshow-nios-day-three\/","content":"The third day of Not in Our School's Week focused on \"Ability Awareness\" and featured events including food served by <a href=\"http:\/\/www.adascafe.org\/\">Ada's Cafe<\/a>, a performance by the American Sign Language class and a table sponsored by the Best Buddies club. Students and teachers wore the color purple in support of the theme of Ability Awareness.\r\n\r\nPhotos by Becca Raffel and Callie Walker.\r\n\r\n[tribulant_slideshow post_id=70963]\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The third day of Not in Our School's Week focused on \"Ability Awareness\" and included food served by Ada's Cafe, a performance by the American Sign Language class and a table sponsored by the Best Buddies club.","date":"2014-04-24 21:40:21","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/IMG_2219.jpg","categories":["Multimedia","Spotlight"],"tags":{"14285":"ability awareness","15105":"NIOS Week"}},{"id":71088,"title":"Preview: Vikings’ baseball seeks retribution against league’s top seed","permalink":"http:\/\/palyvoice.com\/2014\/04\/24\/preview-vikings-baseball-seeks-retribution-against-leagues-top-seed\/","content":"The Palo Alto High School baseball team (11-11, 5-4) will face the Los Gatos Wildcats (19-4, 10-1) for the second time in three days tomorrow, after losing 6-5 on Wednesday in extra innings. The loss is the Vikings third straight, and more importantly eliminates them from any shot at a top seed in the De Anza League.\r\n\r\nThe Wildcats and the Wilcox Chargers are currently first and second seeds, respectively, heading into the league playoffs. The Vikings, in third, have been outscored 21-7 by their last three opponents.\r\n\r\nWhile seeding and momentum are key elements heading into the playoffs, sophomore pitcher and outfielder Justin Hull says his team needs to make adjustments.\r\n\r\n“It was definitely a tough loss,” Hull said. “But we want to come back on Friday, and do everything we can to beat Los Gatos. I think the rest of the season will be spent fixing what needs to be fixed before playoffs, but we also have to get there first.”\r\n\r\nThe Vikings this time will take on Los Gatos on their home turf. With just three games remaining, Palo Alto looks to win out and secure a playoff berth. An upset of the division’s top team can get the derailed Vikings back on track.\r\n\r\nThe first pitch of Friday’s game will be 4 p.m. at Paly.","excerpt":"The Palo Alto High School baseball team (11-11, 5-4) will face the Los Gatos Wildcats (19-4, 10-1) for the second time in three days tomorrow, after losing, 6-5, on Wednesday in extra innings.","date":"2014-04-24 20:20:06","author":"Charles Yu","categories":["Sports"],"tags":[]},{"id":70891,"title":"Napa&#8217;s BottleRock music festival features big names","permalink":"http:\/\/palyvoice.com\/2014\/04\/24\/napas-bottlerock-music-festival-features-big-names\/","content":"[caption id=\"attachment_70921\" align=\"alignleft\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/bottlerock.jpg\"><img class=\"size-full wp-image-70921\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/bottlerock.jpg\" alt=\"Photo by Gavin Libbey and Drew Keller\" width=\"600\" height=\"450\" \/><\/a> BottleRock. Get it? The BottleRock music festival in Napa starts May 30 and ends June 1. The Cure, Outkast, and Eric Church will headline the event, and will be joined by dozens of other musicians. Photo by Gavin Libbey and Drew Keller[\/caption]\r\n\r\nWith Coachella finished and Outside Lands tickets almost completely sold out, BottleRock music festival in Napa is one of the last major in-state festivals of the season convenient for Palo Alto High School music lovers.\r\n\r\nThe festival will be held at the Napa Valley Expo over a three-day period, from Friday, May 30 to Sunday, June 1. School ends for Palo Alto Unified students on May 29, with seniors graduating on May 28, making BottleRock a perfect way to begin summer break.\r\n\r\nThe festival focuses on rock and alternative music, though it includes artists from a wide variety of other genres as well. While other big events such as Bonaroo, in Manchester, Tenn., and Coachella, in Indio have more of a presence from hip hop and electronic artists, hip hop artist Outkast will be headlining BottleRock. The festival will also feature artists like LL Cool J and TV on the Radio.\r\n\r\nThe other headlining artists include country icon Eric Church and alternative\/goth rock band, The Cure. BottleRock features <a href=\"http:\/\/www.bottlerocknapavalley.com\/lineup\">over 45 artists total<\/a>, including many local groups.\r\n\r\nThe festival will kick off on Friday, May 30,  with headlining act The Cure. Other big names on Friday includes Sublime with Rome and the post-punk group TV on the Radio. Also look for Mayer Hawthorne and The Gin Blossoms.\r\n\r\nSaturday, May 31, features the reunited hip-hop duo Outkast. The accompanying performances are equally recognizable, with alt-rock legends Weezer and Palo Alto natives Third Eye Blind playing. And of course, no music festival would truly be complete without Smash Mouth (obviously the most influential and artistic of all the performances).\r\n\r\n\"I'm going because [of] Weezer,\" senior Riley Burt said.\r\n\r\nFor the Sunday, June 1 finale, country star Eric Church headlines a lineup of notable acts including The Fray, Deerhunter and Barenaked Ladies. Less famous but equally exciting acts include The Stone Foxes and Camper Van Beethoven.\r\n\r\nA significant number of groups at BottleRock recorded their biggest hits in the ‘90s and early 2000s, meaning the festival is likely to draw a slightly older audience than Coachella or Outside Lands.\r\n\r\nBottleRock is now in its second year after a moderately successful inaugural festival last summer. A change in management has stirred hopes that some of the issues with the first iteration, including poor food quality and financial issues, will be fixed this year.\r\n\r\nSingle-day passes cost $149 each when bought from <a href=\"http:\/\/www.bottlerocknapavalley.com\/tickets\">the BottleRock website<\/a>, with a $279 three-day pass available and increased prices for VIP privileges. Attendees will also have to pay additional parking and food costs.\r\n\r\nOne downside to the festival cited by some Paly students is its partial overlap with <a href=\"http:\/\/live105.cbslocal.com\/show\/bfd\/\">Live 105's BFD event<\/a>, which is to be held on Sunday, June 1 at Shoreline Amphitheater. The alternative music concert will feature Foster The People, M.I.A., Fitz and the Tantrums, Walk The Moon, and Flosstradamus and offers tickets at relatively cheap prices.\r\n\r\nNevertheless, Paly students such as senior Erik Danie plan to attend BottleRock, drawn by its lineup and nearby location.\r\n\r\n\"It'll be a fun time to hang out with friends and it sounds like a good lineup,\" Danie said. \"I want a good way to start my summer.\"","excerpt":"With Coachella having finished up last weekend, and Outside Lands tickets almost completely sold out, the nearby  BottleRock music festival is one of the last major in-state festivals of the season convenient for Palo Alto High School music lovers.","date":"2014-04-24 13:43:55","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/bottlerock.jpg","categories":["Entertainment","Spotlight"],"tags":{"14810":"BottleRock","8613":"concert","8906":"music","8953":"paly","9137":"summer"}},{"id":70884,"title":"PTSA to focus on school climate in its last meeting of the year","permalink":"http:\/\/palyvoice.com\/2014\/04\/23\/ptsa-to-hold-last-meeting-of-the-year\/","content":"The last Palo Alto High School Parent Teacher Student Association meeting of the year will focus on school climate and will take place at 8:30 a.m. tomorrow in the English Resource Center.\r\n\r\nEric Bloom, a Social Studies and <a href=\"http:\/\/palyvoice.com\/2013\/12\/20\/school-climate-teacher-to-start-2nd-semester\/\" target=\"_blank\">School Climate teacher on special assignment<\/a>, will be speaking at this meeting about his new position.\r\n<p class=\"p1\"> \"I'm going to be there to explain what the position is and what we have done this year and to answer questions,\" Bloom said.<\/p>\r\n<p class=\"p1\">Bloom's position was created earlier this year to create a more welcoming environment at Paly.<\/p>\r\n<p class=\"p1\">PTSA Vice President of Programs and Parent Education Jennifer Landesman noted that the meeting is open to all Paly parents.<\/p>\r\n<p class=\"p1\">\"The upcoming PTSA General Meeting is structured in a way where business items of the PTSA board are first covered during the first few minutes, and afterwards a speaker is invited to present,\" Landesman said in an email to The Paly Voice. \"All parents, not just the board parents, are encouraged to attend, as these programs have interesting and informative programs about what's going on at Paly.\"<\/p>","excerpt":"The last Parent Teacher Student Association meeting of the year will be held at 8:30 a.m. this Thursday in the English Resource Center.\r\n","date":"2014-04-23 21:30:16","author":"Callie Walker","categories":["News"],"tags":{"14846":"becca","14845":"callie","14852":"cat","14850":"climate","14847":"cute","11236":"eric bloom","14851":"fun","14853":"jennifer landesman","10043":"meeting","14849":"mr bloom","9019":"PTSA","14848":"ptsa meetinge","10609":"school climate","14854":"social studies teacher"}},{"id":70879,"title":"Students to give back to community on Paly Service Day","permalink":"http:\/\/palyvoice.com\/2014\/04\/23\/students-to-give-back-to-community-on-paly-service-day\/","content":"[caption id=\"attachment_70938\" align=\"alignright\" width=\"312\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/service-day.jpg\"><img class=\"wp-image-70938 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/service-day.jpg\" alt=\"Paly Service Day is taking place for the whole day on Thursday on and off campus. It is apart of Not In Our Schools week and is helping students give back to the community. Photo by Julianna Heron.\" width=\"312\" height=\"370\" \/><\/a> Paly Service Day is taking place for the whole day on Thursday on and off campus. It is a part of Not In Our Schools week, and is helping students give back to the community. Photo by Julianna Heron.[\/caption]\r\n\r\nAs a part of the compassion and action focus of the fourth day of Not In Our Schools week, Palo Alto High School will host its fourth annual student service day from 8:30 a.m. to 2 p.m. Thursday.\r\n\r\nActivities for the service day will be held both off and on-campus for students. Some students will be dismissed from school for the day to work on off-campus projects, and others will be able to contribute to their community just the same through a variety of on-campus activities.\r\n\r\nThere are a variety of ways the students can help for the off-campus service. The activities range from going to Acterra to clean up the Bay Trail to going to Sunrise Assisted Living to spend time with the senior citizens, according to freshman and Service Day Committee member Candace Wang.\r\n\r\nOn the campus, there will be different activities available to the students. During lunch, there will be booths out on the Quad, and different school clubs will have awareness talks and side service projects going on throughout the day. Habitat for Humanity is also coming to Paly to guide students in building playhouses, according to Wang.\r\n\r\n\"There are a lot of clubs [participating], and what we [Service Day Committee] want them to do is set up booths to talk about either awareness or about projects they can or are doing to help with service and volunteering,\" Wang said.\r\n\r\nThere will be a service day breakfast and a speech by Principal Kim Diorio at 7:45 a.m. for students taking part in service day. Students going off-campus will meet on the Quad by 8 a.m. and should leave campus by 8:30 a.m.\r\n\r\nIn recent years, Paly Service day has had positive turnouts, but mainly for its off-campus activities.This year, the Service Day Committee is trying to get more clubs and students active at the school to make people aware, according to Wang.\r\n\r\n\"Service day is a great way to try and get the whole school to give back to the community, to donate and to volunteer,\" Wang said. \"All of this is just to bring light to what we have and how much we are able to do if we just put our heads together.\"","excerpt":"As a part of the compassion and action focus of the fourth day of Not In Our Schools week, Palo Alto High School will host its fourth annual student service day from 8:30 a.m. to 2 p.m. Thursday.","date":"2014-04-23 21:22:48","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/service-day.jpg","categories":["News"],"tags":{"14812":"community service","14811":"paly service day","9094":"Service","14277":"service day"}},{"id":70342,"title":"Fun facts of future ASB officers","permalink":"http:\/\/palyvoice.com\/2014\/04\/22\/fun-facts-of-future-asb-officers\/","content":"Everyone loves Prom, Powderpuff football, Spirit Week and other school events, yet do students know the people working behind the scenes to make it all happen? The Palo Alto High School student body recently elected the 2014-15 ASB officers by reading each candidate's election statement, watching their speeches on <a href=\"https:\/\/www.youtube.com\/channel\/UCldZuSmEsopJTbH4J4slsmg\">Youtube<\/a> and seeing their signs around campus. However, I feel as though this information is not sufficient to really get to know our representatives outside of their official positions. I decided to dig a bit deeper, so let me introduce you to the elected officials of Paly's 2014-15 ASB.\r\n\r\n<strong>2014-15 ASB President Claire Liu: <\/strong>\r\n\r\n[caption id=\"attachment_70819\" align=\"alignnone\" width=\"213\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/claire.jpg\"><img class=\"wp-image-70819\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/claire.jpg\" alt=\"2014-15 ASB President Claire Liu poses for a selfie. Photo by Claire Liu. \" width=\"213\" height=\"284\" \/><\/a> 2014-15 ASB President Claire Liu poses for a selfie. Photo by Claire Liu.[\/caption]\r\n\r\nDream vacation spot: Southeast Asia and the Galápagos Islands\r\n\r\nSecret talent: Double jointed big toe and making awesome friendship bracelets\r\n\r\nDream superpower: Time travel\r\n\r\nProudest moment: Last APUSH unit test when she finally got the extra credit question correct for the first time this school year\r\n\r\nFavorite outfit: Her turquoise crocs that were donated to Goodwill without her permission\r\n\r\nFavorite food: In-N-Out\r\n\r\nDream dinner guest: A tie between Hillary Clinton and <span style=\"color: #000000;\">Beyoncé<\/span>\r\n\r\nFavorite smell: Coffee\r\n\r\nCelebrity crush: John Krasinski, the guy who plays Jim on \"The Office\".\r\n\r\n<strong>2014-15 ASB Vice President Reid Walters: <\/strong>\r\n\r\n[caption id=\"attachment_70840\" align=\"alignnone\" width=\"178\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/IMG_6584.jpg\"><img class=\"wp-image-70840\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/IMG_6584.jpg\" alt=\"2014-15 ASB Vice President Reid Walters poses for a selfie. Photo by Paige Bara. \" width=\"178\" height=\"328\" \/><\/a> 2014-15 ASB Vice President Reid Walters poses for a picture. Photo by Paige Bara.[\/caption]\r\n\r\nDream vacation spot: Greece or India\r\n\r\nDream superpower: Invisibility\r\n\r\nFavorite outfit: Anything zebra print\r\n\r\nFavorite food: \"Maybe I'd eat scorpion or something.\"\r\n\r\nDream dinner guest: Nelson Mandela\r\n\r\nFavorite smell: Cinnamon\r\n\r\nCelebrity crush: Channing Tatum\r\n\r\nFavorite song: \"Latch\" by Disclosure feat. Sam Smith\r\n\r\n<strong>2014-15 ASB Treasurer Courtney Hull: <\/strong>\r\n\r\n[caption id=\"attachment_70818\" align=\"alignnone\" width=\"194\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/courtney.jpg\"><img class=\"wp-image-70818\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/courtney.jpg\" alt=\"2014-15 ASB Treasurer Courtney Hull poses for a selfie. Photo by Courtney Hull. \" width=\"194\" height=\"292\" \/><\/a> 2014-15 ASB Treasurer Courtney Hull poses for a selfie. Photo by Courtney Hull.[\/caption]\r\n\r\nDream vacation spot: Italy\r\n\r\nSecret talent: Baking\r\n\r\nDream superpower: Flying\r\n\r\nFavorite outfit: \"Sweats, haha.\"\r\n\r\nFavorite food: Cake and ice cream\r\n\r\nDream dinner guest: Ghandi\r\n\r\nFavorite smell: Vanilla\r\n\r\nCelebrity crush: Harry Styles\r\n\r\nFavorite song: \"Chocolate\" by The 1975 or anything of the country genre\r\n\r\n<strong>2014-15 ASB Secretary Joseph Kao: <\/strong>\r\n\r\n[caption id=\"attachment_70817\" align=\"alignnone\" width=\"320\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/joseph.jpg\"><img class=\" wp-image-70817\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/joseph.jpg\" alt=\"2014-15 ASB Secretary Joseph Kao poses for a selfie. Photo by Joseph Kao. \" width=\"320\" height=\"213\" \/><\/a> 2014-15 ASB Secretary Joseph Kao poses for a selfie. Photo by Joseph Kao.[\/caption]\r\n\r\nDream vacation spot: The moon\r\n\r\nSecret talent: Creating Photoshop pictures and singing covers\r\n\r\nDream superpower: Invisibility or teleportation\r\n\r\nProudest moment: Winning the positions as ASB Secretary\r\n\r\nFavorite outfit: T<span style=\"color: #3e454c;\">he most expensive outfit in the world <\/span>\r\n\r\nFavorite food: Anything related to Chinese food\r\n\r\nDream dinner guest: His future lover\r\n\r\nFavorite smell: Cookies in the oven\r\n\r\nCelebrity crush: One Direction and Katy Perry\r\n\r\nFavorite song: Previously \"Friday\" by Rebecca Black, but now \"#Selfie\" by The Chainsmokers\r\n\r\nFind full 2014-15 ASB and class officer election results <a href=\"http:\/\/www.paly.net\/event\/congratulations-2014-15-asb-officers\">here<\/a>.\r\n\r\nInterviews for appointed ASB positions, such as Spirit Commissioners and Sports Commissioners, are occurring this week. Positions will be announced on Friday, according to Student Activities Director Matt Hall.\r\n\r\n&nbsp;","excerpt":"Find out more about the 2014-15 ASB elected officers!","date":"2014-04-22 21:04:55","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-22-at-12.44.45-PM.png","categories":["Features","Spotlight"],"tags":{"8496":"ASB","14290":"claire liu","14291":"courtney hull","14297":"fun facts","14293":"joseph kao","14809":"officers","14292":"reid walters"}},{"id":70716,"title":"Teacher-student shadowing program increases communication","permalink":"http:\/\/palyvoice.com\/2014\/04\/22\/teacher-student-shadowing-program-increases-communication\/","content":"[caption id=\"attachment_70900\" align=\"alignleft\" width=\"453\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/paige.jpg\"><img class=\" wp-image-70900\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/paige.jpg\" alt=\"Should you run into your English teacher in your math class, never fear. Photo by Paige Esterly. \" width=\"453\" height=\"338\" \/><\/a> Should you run into your English teacher in your math class, never fear. Photo by Paige Esterly.[\/caption]\r\n\r\nIf you run into your English teacher in your math class, no, it's not because Ms. X wants to brush up her algebra skills. In an effort to open up communication between students and teachers, School Climate Committee head Eric Bloom is working to assign teachers different students to shadow for an average school day, an effort that will continue throughout the semester.\r\n\r\nAccording to Bloom, Principal Kim Diorio originally encouraged departmental Instructional Supervisors, as well as Western Association of Schools and Colleges focus group leaders, to participate in the shadowing program. However, once the idea was pitched, other teachers came to Bloom expressing interest as well.\r\n\r\nBloom's job here is to pair teachers and students. Once a teacher comes to Bloom, he or she may request a grade level to shadow. From there, Bloom finds an appropriate student for the specific teacher, striving to find a range of course loads and extra curricular activities.\r\n\r\n\"What we're really trying to get them to do is follow a real schedule,\" Bloom said.\r\n\r\nBloom believes that by shadowing students, teachers will gain insight into the lives of high schoolers, a sentiment echoed by World History teacher and history department IS, Jacyln Edwards.\r\n\r\nEdwards, who teaches freshmen, believes that her experience shadowing a student will directly impact her future teaching decisions.\r\n\r\n\"I already altered one of my assignments because I was a freshman so I followed a freshman schedule,\" she said. \"Many of the students I have I was also in their classes and I came to realize that they had some other things that were due this week. We all know that, but we never really know what and we don't know when, we just know that it happens. I just saw that the students had quite a bit due this week so I changed my assignment, simple as that.\"\r\n\r\nAfter realizing exactly how heavy her students' course-loads are, Edwards plans to use her new-found knowledge to change her teaching policies as a whole.\r\n\r\n\"[After this experience I will] maybe be more forthcoming, like, you know, hey if you have three tests on a Monday and I am one of those teachers giving you a test, come talk to me and we'll figure out another time,\" she said.\r\n\r\nIn the future, in addition to continuing on with teachers following students, Bloom hopes to experiment with both parents and students following teachers to further increase communication.\r\n\r\nEdwards says she believes that this idea, if correctly executed, would be beneficial.\r\n\r\n\"I think it [students following teachers] is a good idea,\" Edwards said. \"The good thing about a teacher following a student or vice-versa is it really opens up communication.\"\r\n\r\n&nbsp;","excerpt":"In an effort to open up communication between students and teachers, School Climate Committee head Eric Bloom is working to assign teachers different students to shadow for an average school day, an effort that will continue throughout the semester.","date":"2014-04-22 13:27:58","author":"Paige Esterly","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/paige.jpg","categories":["News","Spotlight"],"tags":{"11236":"eric bloom","14294":"Jacyln Edwards","14295":"shadowing","14296":"teacher shadowing"}}]