[{"id":71725,"title":"Girls&#8217; lacrosse to square off against rival St. Francis in second round of playoffs","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/girls-lacrosse-to-square-off-against-rival-st-francis-in-second-round-of-playoffs\/","content":"The Palo Alto High School girls’ lacrosse team (13-4, 12-1) is set to take on St. Francis High School (12-6, 10-2) in the second round of the Santa Clara Valley Athletic League playoffs at 7:30 p.m. Wednesday at St. Francis High School.\r\n\r\nThe Vikings are coming off a first round victory against Leland High School (19-4), while the Lancers are coming off of a first round bye. Paly bested St. Francis in the two teams' previous meeting in a thrilling 14-11 comeback victory at Paly. The team is excited for another chance to top St. Francis, according to senior midfielder Kristin DeStefano.\r\n\r\n\"We are very excited even though we already beat them once,\" DeStefano said.\r\n\r\nThe Vikings embrace taking on tough competition like the Lancers in their rigorous league schedule.\r\n\r\n\"We are third in our league because of all of the different sections,\" DeStefano said. \"We have to play harder competition from week to week so it gives us motivation to win the tough games.\"\r\n\r\nDestefano says that while the team knows what it did well last game, a new game brings a new challenge.\r\n\r\n\"Going into this game we need to take control of the draws and completely block everyone off the circle,\" Detefano said. \"Last game, our transition was very good and our spacing and ball handling were amazing.\"\r\n\r\nThe game will start at 7:30 p.m. on Wednesday at the St. Francis football field.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls’ lacrosse team (13-4, 12-1) is set to take on St. Francis High School (12-6, 10-2) in the second round of the Santa Clara Valley Athletic League playoffs at 7:30 p.m. Wednesday at St. Francis High School.","date":"2014-05-13 17:43:06","author":"Malcolm Davis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/216.jpg","categories":["Sports"],"tags":{"8736":"girls' lacrosse","17811":"kristen destefano","8836":"Lacrosse","10253":"st. francis"}},{"id":71420,"title":"Five qualify for U.S. Rowing Junior National Championships","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/five-qualify-for-u-s-rowing-junior-national-championships\/","content":"[caption id=\"attachment_71761\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/crew1.jpg\"><img class=\"size-full wp-image-71761\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/crew1.jpg\" alt=\"Paly senior Alex Warner (right) and her partner in the Norcal Women's Lightweight Double, Gunn senior Janet Titzler (left), smile with their medals after placing second in the U.S. Rowing Southwest Regional Championships on May 4th. The duo will advance to the U.S. Rowing Junior National Championships this June.\" width=\"600\" height=\"397\" \/><\/a> Paly senior Alex Warner (right) and her partner in the Norcal Women's Lightweight Double, Gunn senior Janet Titzler (left), smile with their medals after placing second in the U.S. Rowing Southwest Regional Championships on May 4th. The duo will advance to the U.S. Rowing Junior National Championships this June. Photo by David Titzler and courtesy of Laura Breyfogle.[\/caption]\r\n\r\nFive Palo Alto High School students recently qualified on for the United States Rowing Junior National Championships which will be held June 12-15 at Lake Natoma in Sacramento.\r\n\r\nJuniors Christopher Skokowski, Misha Hindery and Marcelo Buxton and senior Alex Warner qualified while rowing for Norcal Crew, and junior Chloe Fishman qualified under the Los Gatos Rowing Club. All five qualified on May 4 in the U.S. Rowing Southwest Regional Rowing Championships at Lake Natoma, the site where the national championships will be held.\r\n\r\nSkokowski, Hindery and Buxton all row for the Norcal Crew Lightweight Men's Four. This team placed second last weekend at Lake Natoma.\r\n\r\nHindery and Buxton both say they are excited to qualify.\r\n\r\n\"Qualifying for nationals is a feeling impossible to express,\" Hindery said.\r\n\r\n\"I don't think there is anything greater than finally watching all of your hard work finally pay off,\" Buxton said. \"I was ecstatic.\"\r\n\r\nThe Lightweight Four members were determined to succeed last weekend, according to Hindery.\r\n\r\n\"I feel like our boat performed as well as it could have,\" Hindery said. \"We were set on winning and nothing could get in our way.\"\r\n\r\nBuxton thinks that the team will be able to improve upon last weekend's performance in order to take gold this June.\r\n\r\n\"Though we only placed second at regionals, I believe that with continued hard work my boat definitely can make up the couple seconds needed to get gold at nationals,\" Buxton said.\r\n\r\nWarner, who qualified in a women's boat, looks forward to seeing the boys compete.\r\n\r\n<span data-measureme=\"1\">\"I'm really excited to see the boys race,\" Warner said. \"They're all so dedicated and they row really well together. It's going to be a fun regatta.\"<\/span>\r\n\r\nWarner rows for the Women's Lightweight Double, which also placed second this past weekend. Warner is happy to have qualified for nationals in her last season at Norcal before going off to college.\r\n\r\n<span data-measureme=\"1\">\"Qualifying to nationals felt great,\" Warner said. \"It's what I've been working towards for the past three years and it's a great way to end my last season with Norcal.\"<\/span>\r\n\r\nWarner's teammate in the double boat, Janet Titzler, is a senior at Gunn High School. Not rowing with her next year will be difficult because rowing together has made them good friends, Warner said.\r\n\r\n<span data-measureme=\"1\">\"I'm really excited that I get to keep rowing with Janet for another month while we train,\"  Warner said. \"I'm going to miss her so much next year.\"<\/span>\r\n\r\nWarner looks forward to performing well in June.\r\n\r\n<span data-measureme=\"1\"> \"I think we will do really well at nationals,\" Warner said. \"Our team won nationals last year in the category Janet and I are entered in so the expectations are pretty high.\"<\/span>\r\n\r\nFishman qualified while rowing in the Los Gatos Rowing Club Women's Lightweight Eight.\r\n\r\nDespite rowing for different boats and rowing clubs, these five Paly students will all come together this June to compete to be the best in the nation in their respective categories.\r\n\r\n\"I expect to become a national champion and don't plan on settling for anything else,\" Hindery said.","excerpt":"Five Palo Alto High School students qualified for the United States Rowing Junior National Championships which will be held June 12-15 at Lake Natoma in Sacramento.","date":"2014-05-13 15:51:44","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/crew1.jpg","categories":["Sports"],"tags":{"17781":"Alex Warner","11616":"chloe fishman","17784":"crew","17786":"Los Gatos Rowing Club","17782":"Marcelo Buxton","17783":"Misha Hindery","17785":"NorCal Crew","11613":"rowing","17787":"U.S. Rowing National Championships"}},{"id":71787,"title":"Theater department to put on senior showcase","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/theater-department-to-put-on-senior-showcase\/","content":"The Palo Alto High School theater department will honor its graduating seniors, as well as reveal next year's shows, in the annual senior showcase from 7 p.m. to 9:30 p.m. Friday in the Haymarket Theater.\r\n\r\n[caption id=\"attachment_71820\" align=\"alignright\" width=\"236\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_2144.jpg\"><img class=\"wp-image-71820\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_2144.jpg\" alt=\"IMG_2144\" width=\"236\" height=\"435\" \/><\/a> A sign hanging outside the Haymarket Theather features the future plans of the outgoing seniors of the theater department. Photo by Phoebe So.[\/caption]\r\n\r\nAccording to senior Caroline Johnson, who has participated in theater since her freshman year, the night will include an introduction of each senior by an underclassman.\r\n\r\n\"Underclassmen will present each senior individually,\" Johnson said. \"They get up on stage and talk about one anonymous senior and how great they are.\"\r\n\r\nEach senior is then revealed at the end of each underclassman's speech and he or she is given an award and a gift, Johnson said.\r\n\r\n\"They give them a rose and there are some tears and some hugging,\" Johnson said. \"[Theater teacher] Kathleen Woods gives awards and presents to all the seniors, typically a theater-related book. There is a slideshow sort of like honoring the seniors. It's just like a bunch of photos of the seniors throughout their four years here and it's very cute and everyone cries.\"\r\n\r\nThe final component of the night involves the announcement of next year's shows.\r\n\r\n\"At the very end the shows for the next season are announced,\" Johnson said. \"That's like the big moment that everyone waits for.\"\r\n\r\nAs a whole, the purpose of the night is to acknowledge the accomplishments of the seniors, according to Johnson.\r\n\r\n\"Senior showcase is meant to recognize, honor and say goodbye to the outgoing seniors,\" Johnson said.\r\n\r\nJohnson said she is eager to be on the receiving end of the senior showcase, despite it marking the end of her time with the Paly theater department.\r\n\r\n\"I announced seniors my past two years as a sophomore and a junior so I'm really excited to have an underclassman who loves me say nice things about me in front of everyone,\" Johnson said. \"And I'm excited to get an award from Kathleen Woods because she is like my mother. It'll be sad because it means I have to leave but I think it'll be a lot of fun because the night is just about you and how great you are.\"\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School theater department will honor its graduating seniors, as well as reveal next year's shows, in the annual senior showcase from 7 p.m. to 9:30 p.m. Friday in the Haymarket Theater.","date":"2014-05-13 15:50:46","author":"Addie McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/showcase-cropped.jpg","categories":["Entertainment","News"],"tags":{"18258":"paly theatre","18257":"senior showcase","15393":"showcase","9159":"theater","9160":"theatre"}},{"id":71793,"title":"Interview: Table tennis phenom discusses World Championships","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/interview-table-tennis-phenom-discusses-world-championships\/","content":"[caption id=\"attachment_71829\" align=\"alignnone\" width=\"537\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-13-at-1.44.53-PM.png\"><img class=\"size-full wp-image-71829\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-13-at-1.44.53-PM.png\" alt=\"Senior Lily Zhang poses in her U.S.A. table tennis shirt. She has returned from the World Championships in Japan, where her world rank jumped to number 66. \" width=\"537\" height=\"498\" \/><\/a> Senior Lily Zhang poses in her U.S.A. table tennis shirt. She recently competed in the table tennis World Championships in Tokyo, Japan, where her world rank jumped to No. 66. Photo by Becca Raffel.[\/caption]\r\n\r\nThe Paly Voice sat down with senior Lily Zhang to discuss her recent success in the table tennis World Championships on April 28-30 in Tokyo, Japan.\r\n\r\n<strong>The Paly Voice:  How was your experience at the World Championships?<\/strong>\r\n\r\nLily Zhang: It was my sixth World Championships, so that was incredible.  My first one was in Yokohama, Japan, so it was really cool going back to Japan again for the World Championships.  It was just really amazing being with all the best players in the world and being a part of that.\r\n\r\n<strong>TPV:<\/strong> <strong>What was the most exciting part?<\/strong>\r\n\r\nLZ: Probably just going out with my teammates and going to play in the matches against some really good players.  I think I played considerably well, since I didn't practice for eight months, and I just went in and decided to try my best.\r\n\r\n<strong>TPV: What are your goals for the future in ping pong?<\/strong>\r\n\r\nLZ: I'm definitely going to try out for the 2016 Olympics.  That is one of my future goals, and then for the 2014 Youth Olympics. I'm going to do my best to win the first medal for the US.\r\n\r\n<strong>TPV:  How have you been able to balance your school work while going away for extended periods of time?<\/strong>\r\n\r\nLZ:  It's kind of hard, especially during junior and senior year, when there is a lot of school work. Practicing is pretty difficult to do at the same time. I guess I have to make a few more sacrifices than usual, but I think it's all worth it in the end.\r\n\r\n<strong>TPV: Tell us about the change in your world ranking.  <\/strong>\r\n\r\nLZ:  I was number 110 in the world for women, and then I didn't play for more than eight months so it went away.  Now it's up to no. 66 in the world, and no. 7 in the world for under-18.\r\n\r\n<strong>TPV:  Any inspirational words to share with Paly students?<\/strong>\r\n\r\nLZ: In whatever you do, just be passionate.","excerpt":"The Paly Voice sat down with senior Lily Zhang to discuss her recent success in the ping pong World Championships on April 28-30 in Tokyo, Japan.","date":"2014-05-13 15:18:57","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-13-at-1.44.53-PM.png","categories":["Features","Spotlight"],"tags":[]},{"id":71722,"title":"Boys&#8217; lacrosse to take on MA in SCVAL playoffs","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/boys-lacrosse-to-take-on-ma-in-scval-playoffs\/","content":"[caption id=\"attachment_69591\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/IMG_0068.jpg\"><img class=\"wp-image-69591\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/IMG_0068.jpg\" alt=\"The Paly boys' lacrosse team celebrates their 12-17 victory over Woodside as they come in for a cheer. Photo by Emma Chiu.\" width=\"400\" height=\"267\" \/><\/a> The Paly boys' lacrosse team celebrates its 12-17 victory over Woodside on March 4. Photo by Emma Chiu.[\/caption]\r\n\r\nAfter a rousing victory over Sacred Heart Prep (13-5, 11-1) on Senior Night last week, the Palo Alto High School boys' lacrosse team (13-7,9-5) will host Menlo-Atherton High School (12-1, 8-5) tomorrow in the semifinals of the Santa Clara Valley Athletic League playoffs. The second-seeded Vikings earned a bye from the first round.\r\n\r\nPaly's emotional win Thursday, 11-8, over the previously undefeated Sacred Heart Prep Gators in what was expected to be the seniors' last home game should give the team some momentum, according to senior defender Josh Stern.\r\n\r\n<span class=\"Apple-style-span\">\"I think our win over Sacred Heart will motivate us to keep pushing for the championship,\" Stern said. \"Sacred Heart was undefeated up until that point so we feel like we have much of a shot as anyone.\"<\/span>\r\n\r\nThe Vikings played the Menlo Atherton Bears twice this season, coming up with close victories, 11-9 and 5-4, each time. According to senior defender James Harrison, the Vikings and the Bears share a strong rivalry.\r\n\r\n\"They are very similar to us, skilled and athletic, and are our main rivals,\" Harrison said. \"We beat them last year to end their undefeated season similarly to what we did to SHP.\"\r\n\r\nEven though Paly has proven itself victorious, Stern anticipated a strong showing from the Bears.\r\n\r\n<span class=\"Apple-style-span\">\"We're undefeated against MA this year so they're definitely going to come at us with everything they've got,\" he said. \"They've had a lot of success in the past and have been a great playoff team, so I think we'll get the best of them on Wednesday, but we absolutely have enough potential to stay undefeated against them for the year.\" <\/span>\r\n\r\nWith this playoff game, Paly seniors get one more chance to play on their home turf.\r\n\r\n\"It is our last game at home and all the seniors as well as everyone else on the team have been fired up the whole week,\" Stern said. \"We've never been seeded this high as a program so we intend to finish the best we can.\"\r\n\r\n\"We are very evenly matched and it's looking to be a great game,\" Harrison added. \" After beating SHP we have a new confidence that we will hope to carry us through this week of playoffs and to the championship.\"\r\n\r\nThe Vikings will host the Bears at 5 p.m. tomorrow evening on the El Camino Field at Paly.","excerpt":"The Vikings will host the Menlo Atherton Bears in the SCVAL semifinals at 5 p.m. tomorrow evening on the El Camino Field.","date":"2014-05-13 14:04:17","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/IMG_0068.jpg","categories":["Sports","Spotlight"],"tags":{"17801":"james harrison","17799":"josh stern","10306":"menlo-atherton","8944":"palo alto high school","17800":"paly lacrosse","9078":"scval"}},{"id":71798,"title":"May 16: Last day to buy tickets for graduation activities","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/may-16-last-day-to-buy-tickets-for-graduation-activities\/","content":"","excerpt":"","date":"2014-05-13 13:42:05","author":"Lizzie Chun","categories":["Ticker"],"tags":{"17802":"grad night","8742":"graduation","17804":"graduation activities","17803":"senior picnic"}},{"id":71802,"title":"ATM contest to be held Wednesday","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/atm-contest-to-be-held-wednesday\/","content":"","excerpt":"","date":"2014-05-13 13:41:27","author":"Lizzie Chun","categories":["Ticker"],"tags":{"17810":"atm","8871":"math"}},{"id":71716,"title":"Paly baseball to host Saratoga in SCVAL championship series opener","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/paly-baseball-to-host-saratoga-in-scval-championship-series-opener\/","content":"The Palo Alto High School baseball team (15-12, 9-5) and a returning star pitcher will host the Saratoga Falcons (19-8, 8-6) at 4 p.m. today in the opening game of a three-game series to crown the Santa Clara Valley Athletic League champion.\r\n\r\nAfter completing a two-game sweep of Wilcox High School in last week's semifinal series, Paly head coach Erik Raich decided to give senior Danny Erlich the start at pitcher. Erlich has only appeared in three relief opportunities this season, due to a back injury, while not surrendering a run.  Today will be his first start, but he says he remains confident in his ability to get people out.\r\n\r\n\"It's my first start and I know it will be easy to get pumped up and overthrow,\" Erlich said. \"I have always been pretty good at keeping my composure so I am confident I [will] still have it.\"\r\n\r\nThe Vikings hope their starting pitcher will perform just as well as he did last year.  Erlich finished the 2013 season with a 1.93 earned run average in 61.2 innings of work.\r\n\r\nTo replicate his success, Erlich claims he will have to keep it simple and stick with the basics and rely on command as a weapon.\r\n\r\n\"My most important goal for today is simply throwing strikes,\" Erlich said.\r\n\r\nThe Vikings have not lost a game since April 26 and are clicking on all cylinders at the right time for a postseason run.  Their opponent, last-seeded Saratoga, took down the first-seeded Los Gatos Wildcats in an upset victory last week.  However, Paly is not worried about it's opponent.  The Vikings are worried about continuing to play clean, fundamental baseball and sticking with the game plan that the coaching staff prepares.\r\n\r\n\"The key to sustaining our progress is going to come down to our teams motto: 'Throw strikes, hunt fastballs, and take care of the baseball,'\" Erlich said.\r\n\r\nRegardless of today's outcome, the Vikings will hit the road for the second game of the series: a 4 p.m. contest at Saratoga High School on Thursday.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"After completing a two-game sweep of Wilcox High School in last weeks semifinal series, Paly head coach Erik Raich decided to give senior Danny Erlich the start.  Erlich has only appeared in three relief opportunities this season, while not surrendering a run.  Today will be his first start, but he says he remains confident in his ability to get people out.","date":"2014-05-13 13:40:28","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0876.jpg","categories":["Baseball","Sports","Spotlight"],"tags":[]},{"id":71712,"title":"Back-to-school packets to switch back to paper","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/back-to-school-packets-to-switch-back-to-paper\/","content":"[caption id=\"attachment_52973\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/04\/IMG_7829-e1366097610858.jpg\"><img class=\"wp-image-52973\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/04\/IMG_7829-e1366097610858.jpg\" alt=\"Penny Ellson, chair of the PTA's Traffic Safety Committee, introduces the traffic safety improvement project to Paly PTSA at the Feb. 21 meeting. Photo by Christina Chen.\" width=\"600\" height=\"400\" \/><\/a> Penny Ellson, chair of the PTA's Traffic Safety Committee, introduces the traffic safety improvement project to Paly PTSA at the Feb. 21 meeting last year. Photo by Christina Chen.[\/caption]\r\n\r\nNext year's back-to-school packets will revert back to paper format, according to next year's Parent Teacher Student Association president Linda van Gelder.\r\n\r\nThe 2013-14 school year's transition to paperless packets caused a significant drop in donations, <a href=\"http:\/\/palyvoice.com\/2013\/10\/03\/paly-programs-affected-by-transition-to-online-back-to-school-packets\/\">negatively affecting<\/a> the multiple Palo Alto High School programs that rely on these contributions, including as the Paly Theatre. The web format produced less parent involvement and contribution, according to van Gelder.\r\n\r\n\"<span style=\"color: #000000;\">We noticed that donations from people who have chosen to write checks instead of making online payments were way down, so we would like to make it convenient for everyone,\" van Gelder said. \"The packet was available to print out from <\/span><a style=\"color: #196ad4;\" href=\"http:\/\/paly.net\/\" target=\"_blank\" rel=\"nofollow\" shape=\"rect\">paly.net<\/a><span style=\"color: #000000;\">, but even I didn't go to the trouble of printing it.\"<\/span>\r\n\r\nIn an attempt to restore participation, the back-to-school packets will be printed next year and will include both a paper and online payment options. <span style=\"color: #000000;\">Items in the packet include a checklist for donations, a Partners in Education donation letter, a list of booster clubs, a site council ballot, a photo order form and a new addition called the \"Welcome to Paly\" brochure. The new brochure is meant to increase parent involvement by informing them of the programs that benefit from their donations, according to van Gelder.<\/span>\r\n\r\n<span style=\"color: #000000;\">\"With the new Paly brochure and a letter describing the exciting and meaningful plans we have for next year, I think parents will see the benefits of contributing to organizations their children benefit from,\" Van Gelder said. \"In addition, having more information on events and opportunities for involvement will improve the school climate.\"<\/span>\r\n\r\nVan Gelder says she hopes that the paper packets will bring in the necessary donations at the beginning of the school year, to allow easier PTSA budgeting.\r\n\r\n<span style=\"color: #000000;\">\"Donations to PTSA were down last year, causing the PTSA to revise the budget mid-year,\" van Gelder said. \"We were able to collect more with a second letter during the year, but that is a lot of work.  It is much better to raise the money at the beginning of the year, so we can plan our spending to enhance the learning and school community in the best way.\"<\/span>\r\n\r\nThe online donation option will also be improved due to the switch in the school's web store operator to a new system called ASB Works.\r\n\r\n\"<span style=\"color: #000000;\">It will be more secure and will work well for school fees,\" van Gelder said. \"Since it was just announced last week, we haven't figured out the details of how everything will look, but we will do our best to make it as convenient as possible.\"<\/span>\r\n\r\nThe paper back-to-school packets require more work by PTSA throughout the summer, according to van Gelder, however she is confident that the work will pay off.\r\n\r\n<span style=\"color: #000000;\">\"We want parents to be active in the school and community,\" van Gelder said. \"We do plan to keep the amount of paper used to a minimum and look at ways to cut back on paper usage each year.  If sending a packet helps parents to connect with the school, it is worthwhile.\"<\/span>","excerpt":"Next year's back-to-school packets will revert back to paper format, according to next year's Parent Teacher Student Association president Linda van Gelder.","date":"2014-05-13 13:36:00","author":"Kate Marinkovich","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/04\/IMG_7829-e1366097610858.jpg","categories":["News"],"tags":{"17807":"back-to-school","17809":"Linda van Gelder","17808":"packets","9019":"PTSA"}},{"id":71733,"title":"BFD Festival to return for 20th show","permalink":"http:\/\/palyvoice.com\/2014\/05\/13\/bfd-festival-to-return-for-20th-show\/","content":"If you couldn’t make it to Coachella this year, kick off your summer concert season by attending the 20th annual BFD (Big F---ing Day) Festival hosted by Live 105, June 1 at the Shoreline Amphitheater. The festival will feature artists Foster the People, Phantogram, M.I.A, Fitz and the Tantrums and the New Politics on the BFD 2014 Mainstage, along with two other supporting stages.\r\n\r\n[caption id=\"attachment_71736\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/3499_image_318530.jpg\"><img class=\"wp-image-71736\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/3499_image_318530.jpg\" alt=\"Of Monsters and Men perform their new single, 'Little Talks' at BFD 2013. Photo by Cathy Rong.\" width=\"400\" height=\"286\" \/><\/a> Of Monsters and Men perform their new single, 'Little Talks' at BFD 2013. Photo by Cathy Rong.[\/caption]\r\n\r\nThe festival focuses on a variety of indie and alternative music, bringing in big names including M.I.A and Phantogram mixed with lesser known and upcoming artists like Walk the Moon, Birds of Tokyo and MS MR. The Bud Light Festival Stage will feature artists Walk the Moon, MS MR, KONGOS, Bleachers, Cherub, Birds of Tokyo, SKATERS and Semi Precious Weapons, with the Bud Light Platinum Subsonic Stage presenting RAC, The Knocks and White Noise.\r\n\r\n“I’m really looking forward to seeing Fitz and the Tantrums play and also Phantogram,” says Paly senior Evan Powers. “BFD has always been a notable festival to go to in the Bay, but the lineup this year has improved immensely.”\r\n\r\nAn alternate music entertainment option is the<a href=\"http:\/\/palyvoice.com\/2014\/04\/24\/napas-bottlerock-music-festival-features-big-names\/\"> Bottle Rock Music festival<\/a>, taking place in Napa, CA and starting on the same date. The festival focuses on alternative music and features artists like Outkast, Weezer, Third Eye Blind and Sublime.\r\n\r\nBFD’s festival doors open at 11 a.m., with music beginning at 11:30 a.m. on the Bud Light stages and at 5:40 p.m. at the Main Stage.\r\n\r\n“I am looking forward to almost all the acts but the act I am most looking forward to is Walk the Moon,” says Paly senior Heather Strathearn. “I think Paly kids like this festival in particular because it has some really cool alternative bands that appeal to a younger audience.”\r\n\r\nView the full setlist at <a href=\"http:\/\/live105.cbslocal.com\/show\/bfd\/\">http:\/\/live105.cbslocal.com\/show\/bfd\/<\/a>\r\n\r\n<strong>Tickets range from $35-$150 and can be purchased at <a href=\"http:\/\/concerts.livenation.com\/event\/1C004C95AFDC6C37?dma_id=382\">LiveNation<\/a>.<\/strong>","excerpt":"If you couldn’t make it to Coachella this year, kick off your summer concert season by attending the 20th annual BFD (Big F---ing Day) Festival hosted by Live 105, June 1st at the Shoreline Amphitheater. The festival will feature artists Foster the People, Phantogram, M.I.A, Fitz and the Tantrums and the New Politics on the BFD 2014 Mainstage, along with two other supporting stages.","date":"2014-05-13 13:06:44","author":"Cathy Rong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/3499_image_318530.jpg","categories":["Entertainment","Multimedia","Spotlight"],"tags":[]}]