[{"id":77083,"title":"Six tips for ensuring your safety against indecent exposures","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/six-tips-for-ensuring-your-safety-against-indecent-exposures\/","content":"<p>In light of indecent exposures in Palo Alto within the last few months, the Palo Alto Police Department is advising the public to take precautionary methods to avoid lewd conduct encounters and help the police in its search.<\/p>\r\n<p>California's Penal Code 314 prohibits the sex crime of \"indecent exposure,\" which is defined as willfully exposing your genitals to someone else, motivated by a desire to sexually gratify yourself or offend the other person.<\/p>\r\n<p>According to the Palo Alto Police Department, a <a href=\"http:\/\/paly.io\/PAPD10-6\">14-year-old<\/a> girl, a <a href=\"[http:\/\/paly.io\/PAPD10-7\">10-year-old<\/a> girl and a <a href=\"http:\/\/paly.io\/PAPD10-9\">20-year-old<\/a> woman experienced an indecent exposure on Oct. 6, 7 and 9, respectively. In the first incident, a girl was walking home from school on Bryant Street when a man masturbating in his truck stopped stopped beside her, according to the City of Palo Alto's press release. In the second incident, a girl was walking her dog on Byron Street and Seale Avenue when a man in a vehicle pulled up beside her and asked if she wanted to touch his exposed penis, according to the City of Palo Alto's press release. In the third incident, a woman was biking on Miller Avenue when a masturbating driver called out to her, according to the City of Palo Alto's press release.<\/p>\r\n<p>It is evident that a lewd conduct encounter can occur in the most unexpected of times and places to both pedestrians and bikers of all ages. According to Elizabeth, the 14-year-old victim whose name has been changed to protect her identity, the perpetrator looked like an ordinary man that she would find on the street.<\/p>\r\n<p>\"There was nothing really suspicious [about him],\" Elizabeth told the Paly Voice.<\/p>\r\n<p>Although the PAPD has begun to increase marked and unmarked patrol in student commute areas after the incidents, the public should increase its precautionary steps to avoid such circumstances, as it is impossible to tell when an incident could strike, according to the PAPD.<\/p>\r\n<p>While on the next walk or bike ride, police suggest students to follow the steps below to ensure a safe trip:<\/p>\r\n<p><strong> 1. Be aware of your surroundings.<\/strong><\/p>\r\n<p><span style=\"color: #222222;\">\"The most important one is being aware of your surroundings at all times, and simply paying attention to what's going on around you,\"  PAPD officer Lt. Zachary Perron said. <\/span><\/p>\r\n<p>The City of Palo Alto has many positive connotations attached to its name, due to its continuous growth in the technology and business worlds. However, the public may often forget that crime can still be found within our beloved city. Individuals must always be on the lookout for said crimes by constantly scanning their environment and looking for anything out of the ordinary. Although biking may feel safer than walking as it is quicker to remove oneself from a situation, one of the recent incidents involved a biker. Therefore bikers are not exempt from those that must constantly be aware of their surroundings.<\/p>\r\n<p>\"We're all busy people and have a lot of things on our minds, but it's important not to get lost in all of those things, and to always be cognizant of what's going on around you,\" Perron said.<\/p>\r\n<p>One way students can increase their awareness is by removing headphones from their ears while walking or biking home from a long day of school. <a href=\"http:\/\/teens.webmd.com\/news\/20120116\/headphones-while-walking-a-dangerous-move\">Webmd<\/a> writes that pedestrians with headphones often pay little attention to their surroundings, an effect called environmental isolation, which has leads to large pedestrian risk. In the most recent local cases, there has been a repeated pattern of cars trailing behind the victim before exposure.<\/p>\r\n<p><span style=\"color: #222222;\">\"Too often, for example, students (and adults alike) will walk with headphones in both ears,\" Perron said. \"We recommend just one earbud so that you can hear if anything is happening around you.\"<\/span><\/p>\r\n<p>After the incident, Elizabeth has implemented these tactics in her daily routine.<\/p>\r\n<p>\"Just being extremely aware of your surroundings,\" Elizabeth said. \"I don’t listen to music when I walk home because you never know who's creeping up to you.\"<\/p>\r\n<p><strong>2. Keep updated on the recent crimes.<\/strong><\/p>\r\n<p>Being knowledgable about where and when the most recent crimes have taken place in Palo Alto is essential to being vigilant and aware of current events that directly apply to our society. Reading the news will allow you to know who to look out for, too. For example, the PAPD recently released sketches of the perpetrator in the hopes that individuals will recognize the person and call the police.<\/p>\r\n<p>\"Connect with PAPD on social media, that's a great way to stay informed,\" Perron said.<\/p>\r\n<p>The public can receive criminal updates from the PAPD from its <a href=\"https:\/\/twitter.com\/PaloAltoPolice\">Twitter<\/a>, <a href=\"https:\/\/www.facebook.com\/PaloAltoPolice\">Facebook<\/a>, <a href=\"http:\/\/www.nextdoor.com\/%20\">Nextdoor<\/a> or <a href=\"http:\/\/local.nixle.com\/palo-alto-police-department%20\">Nixle<\/a> or the public can continually check <a href=\"http:\/\/www.paloaltoonline.com\/\">Palo Alto Online<\/a>. See <a href=\"www.cityofpaloalto.org\/PAPDconnect\">here<\/a> for links to all of the PAPD social media channels.<\/p>\r\n<p>[caption id=\"attachment_77166\" align=\"alignnone\" width=\"368\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/flashersketches1.jpg\"><img class=\" wp-image-77166\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/flashersketches1.jpg\" alt=\"Three different sketches drawn by the Palo Alto Police Department as told by three different victims. &quot;By releasing sketches of the suspect, we hope that someone will recognize the person and give us a call with a tip,&quot; Lt. Zach Perron said. Screenshots of PAPD sketches by Amy Leung.\" width=\"368\" height=\"181\" \/><\/a> Three different sketches drawn by the Palo Alto Police Department as told by three different victims. \"By releasing sketches of the suspect, we hope that someone will recognize the person and give us a call with a tip,\" Lt. Zach Perron of the PAPD said. Screenshots of PAPD sketches by Amy Leung.[\/caption]<\/p>\r\n<p><strong>3. Walk down the left side of the street. <\/strong><\/p>\r\n<p>“The cops recommend that when you’re walking down, walk down the left side so at least you can see the cars coming up to you,\" Elizabeth said.<\/p>\r\n<p>When possible, walking down the left side of the street is much safer than the right as there is a full lane between the pedestrian and the cars on the right. This makes it much harder for the cars to sneak up on the pedestrian, according to the <a href=\"http:\/\/www.saferoutesinfo.org\/\">National Center for Safe Routes to School<\/a>.  The cars coming towards the pedestrian on the left side are visible by the pedestrian, giving them more reaction time in case of an emergency. Although bikers must follow the same rules of the road as the cars to stay on the right side of the street, it is vital that bikers stay aware of their surroundings.<\/p>\r\n<p><strong>4. Stay calm and get out of the situation quickly.<\/strong><\/p>\r\n<p>In a lewd conduct scenario, it is very easy for individuals to freeze up in shock. However, it is imperative to stay calm and logical. The faster one can get out of the situation and call the cops, the safer they will be and the more likely the culprit will get caught, according to <a href=\"http:\/\/www.justyellfire.com\/news.php?article=How_to_React_to_Exhibitionists_and_Indecent_Exposure_407\">Just Yell Fire<\/a>, a program dedicated to combating violence against young women. If possible and safe, the public should do their best to remember the culprit's facial features, car or license plate number to report to the police quickly afterwards.<\/p>\r\n<p>According to Just Yell Fire, body language expert Patti Woods recommends, \"They are seeking attention and want a strong reaction. Keep your full body, feet, torso and head turned away and try not to give any strong emotional response to his behavior. Then move away and call the authorities with a description so the flasher is caught.\"<\/p>\r\n<p><strong>5. Run in the opposite direction of the perpetrator's car.<\/strong><\/p>\r\n<p>\"People see action movies where people are chasing you or attempting to kidnap you and you start running forward,\" Elizabeth said. \"That’s pretty idiotic. ... If you are running backwards [in the opposite direction], it's way harder [for a car] to back up. I think one method [of safety] is to go the other direction versus still going forward.\"<\/p>\r\n<p>One of the best ways to get out of a scary situation that involves a car is to run in the direction that they are not going in. It is much harder for a car to turn around and catch someone if they are running in the opposite direction that the car itself is going.<\/p>\r\n<p><strong>6. Report an indecent exposure immediately.<\/strong><\/p>\r\n<p>\"This is important stuff that the police should know, because they’re trying to keep the community safe,\" Elizabeth said. \"The more people aware of that [the exposures], the better.\"<\/p>\r\n<p>It is easy to feel embarrassed about the situation at hand, and therefore stay quiet about it. For example, a similar scenario occurred with a <a href=\"https:\/\/www.facebook.com\/PaloAltoPolice\/photos\/pb.288613124507825.-2207520000.1414368283.\/751096094926190\/?type=3&amp;theater\">13-year-old<\/a> who recently came out about a lewd conduct encounter that happened over the summer, according to the PAPD. It is essential to report the case immediately. The PAPD is already on heightened patrol, and it is waiting to respond to any new reports that come in.<\/p>\r\n<p><span style=\"color: #222222;\">\"While some people may think it's a relatively 'minor' crime, it certainly is not, and the crime can actually be a precursor to substantially more serious crimes,\" Perron said. \"It's not uncommon for indecent exposure suspects to escalate their behavior over time, so if we can catch them early, that may prevent a more serious crime down the road.\"<\/span><\/p>\r\n<p>If you are the victim or witness of an incident, the PAPD asks you to report it to them immediately.<\/p>\r\n<p>“We ask that if people see anything that seems out of the ordinary, that they give us a call right away on 9-1-1,\" Perron said. \"It’s better to call right away and let us determine if the suspicious behavior is innocent or criminal, than to justify suspicious activity and not call.\"<\/p>\r\n<p>Anyone with information regarding suspicious behavior is asked to call the PAPD 24-hour dispatch center at (650) 329-2413. Anonymous tips can be e-mailed <a href=\"mailto:paloalto@tipnow.org\">here<\/a> or sent via text message or voice mail to (650) 383-8984. Tips can also be submitted anonymously through the PAPD free mobile app, downloadable at the <a href=\"bit.ly\/PAPD-AppStore\">AppStore<\/a> or <a href=\"bit.ly\/PAPD-GooglePlay\">GooglePlay<\/a>. The PAPD asks that if people see anything that seems out of the ordinary, they should give the PAPD or 9-1-1 a call immediately.<\/p>\r\n","excerpt":"In light of the indecent exposures in Palo Alto within the last month, here are various safety tips the public should take to avoid lewd conduct encounters and help police in their search.","date":"2014-10-27 20:47:11","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/flashersketches1.jpg","categories":["Features","Spotlight"],"tags":{"30922":"flashing","30919":"indecent exposure","30921":"lewd conduct","8939":"palo alto","30920":"palo alto online","13030":"PAPD","9000":"police","14866":"tips","30923":"victim"}},{"id":77254,"title":"Spirit Week to continue with “Salad Dressing” Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/spirit-week-to-continue-with-salad-dressing-day\/","content":"Palo Alto High School students will dress up according to their class's respective salad-dressing theme for Day Two of Spirit Week.\r\n\r\nThe themes for tomorrow are as follows in ascending grade order: “Healthy Choice,” “Ranch,” “Thousand Islands” and “Caesar.” For dress-up ideas, click <a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/must-have-spirit-week-outfits\/\" target=\"_blank\">here<\/a>.\r\n\r\nThe event for the rally at the football field tomorrow is Tug of War. Five boys and five girls from each class will battle for dominance over the others. Two students from each class will also compete for best dressed. Each class will be awarded points based on quality of cheers and deducted points based on sportsmanship and cleanliness.\r\n\r\nJunior Portia Barrientos says she is excited for dressing up tomorrow and feels confident that her class will win at the rally.\r\n\r\n“I have a grass skirt and a bunch of leis,” Barrientos said. “And, obviously, a Hawaiian shirt and some flowers for my hair.”\r\n\r\nSenior Claire Priestley says she will don a toga and gladiator-style sandals for tomorrow as she watches her class participate in the Tug of War competition.\r\n\r\n“Hopefully we [the seniors] will be better than today,” Priestley said. “But I’m pretty sure we’re doing Tug of War, and the other grades seem to have stronger people in general, so it's a bit concerning.”\r\n\r\nSophomores Ahana Ganguly and Jeanette Andrews said they are going to wear flannels and cowboy boots for their \"Ranch\" theme.\r\n\r\n\"[The sophomores will] probably [do] pretty well,\" Ganguly said. \"It's not that hard to dress up for. I think we'll finish well, but we won't win.\"\r\n\r\nFor a recap of today's lunch rally, click <a href=\"http:\/\/palyvoice.com\/2014\/10\/27\/juniors-take-the-lead-day-one-recap\/\" target=\"_blank\">here<\/a>. The Associated Student Body's <a href=\"https:\/\/docs.google.com\/a\/palyvoice.com\/document\/d\/1bPEzIA7J8f9gzzhj8F6MBPIL22QhTcWecieUYFyMTGM\/edit?pli=1\" target=\"_blank\">master doc<\/a> is also available for info on the week’s schedule and detailed rules for each of the activities. Be sure to check back to <a href=\"http:\/\/palyvoice.com\/spiritweek-2014\/\" target=\"_blank\">The Paly Voice<\/a> for scores from today’s rally and all other things Spirit Week related.","excerpt":"Palo Alto High School students will dress up according to various “Salad Dressing”-inspired themes for Day Two of Spirit Week.","date":"2014-10-27 16:02:48","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/seniors-toga.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","8944":"palo alto high school","9058":"salad dressing","9119":"Spirit Week","27181":"spirit week 2014","31010":"tuesday"}},{"id":77304,"title":"Video: Spirit Week Day One lunch rally","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/video-spirit-week-day-one-lunch-rally\/","content":"The Paly Voice recapped the Day One lunch rally of Spirit Week 2014.  The \"Minute to Win It\" activities included \"Nose Dive,\" \"Banana Bump\" and \"Shake It.\" Click <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\" target=\"_blank\">here<\/a> for the Palo Alto High School Associated Student Body's master document for more information.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/2nmm9P57_p0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice recapped the Day One lunch rally of Spirit Week 2014.  Watch the video for the highlights of the day's activities.","date":"2014-10-27 15:56:36","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-27-at-5.06.41-PM.png","categories":["Spirit Week 2014"],"tags":{"9740":"banana bump","31059":"day one","31062":"great gatsby","30873":"lion king","9741":"minute to win it","31060":"nose dive","30851":"pirates","30844":"red card","31061":"shake it","27181":"spirit week 2014","9695":"theme day","9208":"video"}},{"id":77256,"title":"Juniors take the lead: Day One recap","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/juniors-take-the-lead-day-one-recap\/","content":"[caption id=\"attachment_77266\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_0171.jpg\"><img class=\"size-full wp-image-77266\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_0171.jpg\" alt=\"Participants in the shake it activity strapped pedometers to their arms with sweat brands and tried rack up the most amount of steps in a minute. Photo by Adele Bloch.   \" width=\"600\" height=\"400\" \/><\/a> Participants in the shake it \"Shake It\" activity strapped pedometers to their arms with sweat brands and tried to rack up the highest number of steps in a minute. Photo by Adele Bloch.[\/caption]\r\n\r\nThe junior class's spirits are high after winning two of the three competitions held today on the football field for Palo Alto High School's Spirit Week activities.\r\n\r\nThe first rally of the week included the new “Minute to Win It” games \"Nose Dive\" and \"Shake It,\" and the returning \"Banana Bump.\"\r\n\r\n“Having 'Minute to Win it' game added to the entertainment because it involves more people,\" junior Siddharth Srinivasan said. \"The games were interesting and out of the box.\"\r\n\r\n\"Nose Dive\" had players from each class putting petroleum jelly on the tips of their noses. With their hands behind their backs, the players had to transfer cotton balls from one bowl to another, using only the jelly on noses. The player who moved the most cotton balls into the bowl in a minute won, in this case, junior Anant Maur.\r\n\r\nFollowing the \"Nose Dive\" game, \"Shake It\" had students from each grade strap a pedometer to their arms and then try to get the most number of steps as possible on the pedometers by shaking.\r\nAfter a minute of frantic shaking, sophomore Henry Badger came out on top.\r\n\r\nFinally, \"Banana Bump\" involved a student from each class using only a banana hanging from the waist to bump an orange past the finish line. The race was close but the reigning champion from last year, junior Quintin Valenti, defended his title with another win.\r\n\r\nPaly students said they enjoyed the activities proposed by the Associated Student Body for the first Spirit Week rally.\r\n\r\n“The games were really fun and I love ASB [Associated Student Body] with a burning passion,” senior Ankitia Avadhani said.\r\n\r\nThe freshman placed last in all of the rally's activities.\r\n\r\n\"Like every year, the freshmen struggled to catch on to the idea of Spirit Week,” junior Matthew Keller said. “Sophomores and senior are a serious threat to the junior class … but I believe we will be able to pull it [a win] off”\r\n\r\nToday’s scores will be posted by ASB after float building tonight. Keep checking The Paly Voice for more Spirit Week related information.","excerpt":"The junior class's spirits are high after winning two of the three competitions held today on the football field for Palo Alto High School's Spirit Week activities.","date":"2014-10-27 15:48:37","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10737821_335096480003261_349585804_o.jpg","categories":["Spirit Week 2014"],"tags":[]},{"id":77161,"title":"Students react to recent flashing incidents","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/students-react-to-recent-flashing-incidents\/","content":"<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=zWbMkHXQfRLw.kjVg8QeBjQ98\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<i>Check out this interactive map to see where flashing incidences have occurred and read about each one in more depth. Map by Lizzie Chun.\r\n<\/i>\r\n\r\nAfter recent occurrences of indecent exposure, the Palo Alto Police Department and students of Palo Alto High School shared their reactions and methods of prevention to incidents of indecent exposure.\r\n\r\nAccording to the <a href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1163\" target=\"_blank\">PAPD press release<\/a>, there have been four separate incidences of flashing in and near Palo Alto since early August, especially targeting young women. The PAPD is uncertain whether there is only one suspect or multiple suspects involved.\r\n\r\nThe first indecent exposure disturbance, which occurred at 4:47 p.m. on Oct. 6 at the 1600 block of Bryant Street, was reported by 14 year-old-girl. Back in early August between 1 and 2 p.m., a 13-year-old girl had been flashed with a similar description of the suspect on the 1600 block of Bryant Street, and saw the flasher again later on the 1500 block of Emerson Street.\r\n\r\n[caption id=\"attachment_77223\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.12.20-PM2.png\"><img class=\"size-full wp-image-77223\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.12.20-PM2.png\" alt=\"A PAPD sketch of the flasher, as described by the 14-year-old female victim. Screenshot by Amy Leung.\" width=\"450\" height=\"539\" \/><\/a> A PAPD sketch of the flasher, as described by the 14-year-old female victim. Screenshot by Amy Leung.[\/caption]\r\n\r\nAt 6:41 p.m. on Oct. 7, the 24-hour dispatch center received a call regarding another flashing incident. The parents of a 10-year-old girl called reporting that their daughter had been the victim of an indecent exposure at the intersection of Byron Street and Seal Avenue. The PAPD responded by searching the area, but were unable to find the suspect.\r\n\r\n[caption id=\"attachment_77221\" align=\"alignnone\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.12.04-PM1.png\"><img class=\"size-full wp-image-77221\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.12.04-PM1.png\" alt=\"A PAPD sketch of the flasher, as described by a victim, who was a woman in her twenties. Screenshot by Amy Leung.\" width=\"450\" height=\"607\" \/><\/a> A PAPD sketch of the flasher, as described by a victim, who was a woman in her twenties. Screenshot by Amy Leung.[\/caption]\r\n\r\nAnother incident occurred October 9, where a bicyclist in her twenties was flashed by a man in a white BMW sedan on the 4300 block of Miller Avenue.  A suspect in a similar vehicle exposed himself to two women in Belmont the following morning.\r\n\r\n[caption id=\"attachment_77217\" align=\"alignnone\" width=\"402\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.09.04-PM.png\"><img class=\"size-full wp-image-77217\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-4.09.04-PM.png\" alt=\"A Belmont Police Department sketch of the flasher, as described as two women. Screenshot by Amy Leung.\" width=\"402\" height=\"519\" \/><\/a> A Belmont Police Department sketch of the flasher, as described as two women. Screenshot by Amy Leung.[\/caption]\r\n\r\nThe PAPD is focusing its attention to finding the perpetrator or perpetrators, according to Lt. Zach Perron.\r\n\r\n“Our detectives are actively working on the cases and working in tandem with detectives from area police departments as well to see if the crimes match descriptions in other jurisdictions,” Perron said. “Our patrol personnel are on heightened alert and will respond quickly to any new reports that may come in.”\r\n\r\nJunior Aiva Petriceks expresses unease knowing that a flasher is driving around Palo Alto.\r\n\r\n“The flashing definitely makes me feel really uncomfortable,” Petriceks said. “During the day, I think of Palo Alto as a place where I can walk through the town, and I’ll be perfectly fine. To hear [that] people are being flashed, that definitely makes me a little scared to just walk around by myself.”\r\n\r\nPetriceks also said that people should be cautious.\r\n\r\n“For girls, definitely walk in groups of people,” Petriceks said. “Being a teenage girl, walking around by yourself and getting flashed, that’s really scary and... not safe.”\r\n\r\nSophomore Carter Faust agrees with Petriceks, giving more advice.\r\n\r\n“I think it’s kind of creepy, especially since everyone bikes to school,” Faust said. “They [the PAPD] should patrol more, and people should bike together.”\r\n\r\nAccording to Perron, the PAPD  is doing just that.\r\n\r\n“We increased staffing levels, redistributed personnel to field assignments and have a number of plainclothes officers in the neighborhoods trying to find the suspect,” Perron said.\r\n\r\nIn addition, the PAPD has been releasing sketches and will continue to do so in order to bring awareness and help recognize suspects.\r\n\r\n“By releasing sketches of the suspect, we hope that someone will recognize the person and give us a call with a tip,” Perron said.\r\n\r\n\"We need people to keep their eyes out for any suspicious behavior,\" Perron said. \"We ask that if people see anything that seems out of the ordinary, that they give us a call right away on 9-1-1.  It's always better to call right away and let us determine if the suspicious behavior is innocent or criminal, than to justify suspicious activity and not call.\"\r\n\r\n&nbsp;","excerpt":"After recent incidences of indecent exposure, the Palo Alto Police Department has increased patrols and Paly students have expressed their feelings of discomfort. Map by Lizzie Chun.","date":"2014-10-27 14:07:40","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-26-at-5.04.03-PM.png","categories":["News","Spotlight"],"tags":{"30886":"aiva petriceks","30925":"carter faust","30922":"flashing","30919":"indecent exposure","30926":"palo alto police department","13030":"PAPD","30924":"seth alston","10179":"zach perron"}},{"id":76804,"title":"Dog-O-Ween is a howl","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/dog-o-ween-is-a-howl\/","content":"The second annual Dog-O-Ween event, created by a Palo Alto High School alumna and hosted by City of Palo Alto and the Palo Alto Animal Shelter, took place at Rinconada Park this past weekend.\r\n\r\nDog-O-Ween was started by Kristen DeStefano, Class of 2014, last year. DeStefano worked at Friends of Palo Alto Animal Shelter and came up with this idea for the annual fundraiser from an event she saw at the Palo Alto Baylands Nature Preserve when she was little.\r\n\r\n\"My involvement was planning out what costume categories there were, helping find sponsors and [recruiting] volunteers [from] high schools,\" DeStefano said. \"I met with the Palo Alto city planner to figure out all the restrictions Palo Alto has about fundraisers in their parks so we could plan around it.”\r\n\r\nThe categories the dogs are judged on are “Scariest Dressed,” “Best Group Theme,” “Best Couple Costume (dog and owner)” and “Most Imaginative Costume.” There are prizes for dogs that win in each of these categories, and there is also a raffle to win gift cards from places like CREAM, Fraiche and Sam’s Chowder House.\r\n\r\n[slideshow post_id=76804]\r\n\r\nAlmost a dozen Paly students volunteer with FOPAAS during the week and showed up at Dog-O-Ween to volunteer and participate, including the FOPAAS youth board liaison and Paly senior Kylie Wilson.\r\n\r\n\"I didn't hear about Dog-O-Ween until I started working for FOPAAS,\" Wilson said. \"It's pretty new, but it got a pretty good turn out for only being the second year.\"\r\n\r\nLast year, some of the money raised from Dog-O-Ween went to cataract surgery for a stray dog, who can now see and has found a new home. There was a large turnout of dogs, most of which were costumed, and spectators, most of which donated to FOPAAS to help raise money for its cause.\r\n\r\n\"I don't have a dog, but I think they're the best things in the world, so it was the thrill of a lifetime to hang out for a couple hours with some dogs in Halloween costumes,\" senior Riley Cassidy said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The second annual Dog-O-Ween fundraiser for Friends of the Palo Alto Animal Shelter took place over the weekend. This fundraiser was started by Paly alumna Kristen DeStefano and involves the cutest dogs in the cutest animal costumes and lots of prizes. ","date":"2014-10-27 13:56:44","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/pug.jpeg","categories":["Entertainment","Spotlight"],"tags":{"30914":"city of palo alto","30916":"dog-o-ween","30912":"DOGOWEEN","30918":"FOPAAS","17811":"kristen destefano","30915":"rinconada park"}},{"id":77191,"title":"Storify: Spirit Week as seen through the eyes of students","permalink":"http:\/\/palyvoice.com\/2014\/10\/27\/storify-spirit-week-as-seen-through-the-eyes-of-students\/","content":"<div class=\"storify\">Follow this year's Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts!\r\n<div class=\"storify\">\r\n<div class=\"storify\"><iframe src=\"\/\/storify.com\/palysandiego\/spirit-week-2014\/embed?header=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/palysandiego\/spirit-week-2014.js?header=false\"><\/script>\r\n<noscript>[<a\r\n\r\n<\/noscript>\r\n\r\n","excerpt":"Follow Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts.","date":"2014-10-27 13:50:51","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_62621.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","19460":"2015","30935":"eyes","8689":"Facebook","30939":"instagram","30936":"of students","8953":"paly","30937":"seen","30938":"social media","9119":"Spirit Week","30934":"storify","29808":"twitter"}},{"id":77209,"title":"Juniors win Lincoln-Douglas debate and Original Prose and Poetry speech competitions","permalink":"http:\/\/palyvoice.com\/2014\/10\/26\/juniors-win-lincoln-douglas-debate-and-original-prose-and-poetry-speech-competitions\/","content":"","excerpt":"","date":"2014-10-26 19:35:14","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8638":"debate","30940":"ld","8851":"lincoln douglas","30941":"opp","30942":"original prose and poetry","10196":"speech"}},{"id":76947,"title":"Preview: Spirit Week kicks off with Theme Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/25\/preview-spirit-week-kicks-off-with-theme-day\/","content":"The most anticipated week of the year for some, Spirit Week, is kicking off with Theme Day on Monday at Palo Alto High School.\r\n\r\n[caption id=\"attachment_77052\" align=\"alignright\" width=\"306\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\"><img class=\"wp-image-77052\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6262.jpg\" alt=\"The juniors cheer during Spirit Week 2013.  Juniors dressed as hippies to follow along with their theme of &quot;Yellow Submarine.&quot; Photo by Molly Fogarty and Cathy Rong.\" width=\"306\" height=\"204\" \/><\/a> The juniors cheer during Spirit Week 2013. Juniors dressed as hippies to follow along with their theme of \"Yellow Submarine.\" Photo by Molly Fogarty and Cathy Rong.[\/caption]\r\n\r\nTheme day is when each grade dresses according to its theme, which was selected by each individual class. If you need some inspiration for outfits, check out these suggestions <a href=\"http:\/\/palyvoice.com\/2014\/10\/23\/must-have-spirit-week-outfits\/\">here<\/a>. The senior theme is \"Great Gatsby,\" but seniors will be donning their customary '90s attire. Juniors will be dressing as \"Pirates\" based off of their class color yellow. The sophomores will sport athletic attire based off their theme \"Red Card.\" The freshman theme is \"The Lion King,\" but their outfits may also include any other Disney character.\r\n\r\nMonday's rally will be held on the football field at lunch. According to Student Activities Director Matt Hall, there will be three Minute to Win It games, where contestants have one minute to complete the given task. The two new games are \"Shake it\" and \"Nose Dive,\" and the one returning game from last year's Spirit Week is \"Banana Bump.\"\r\n\r\n\"After a wild and crazy introduction last year, we decided to keep it ['Banana Bump'],\" Hall said. \"It got approved, so we're going to do it, and that will be fun.\"\r\n\r\nTo play \"Shake it,\" one representative from each class will have one pedometer strapped to a leg and arm each. Participants then will move around for one minute, and those with the highest number of \"steps\" at the end wins. \"Nose Dive\" also requires one participant from each grade. The task for \"Nose Dive\" is to transfer the greatest number of cotton balls from one bowl to another using just petroleum jelly on the contestant's noses. The returning game from last year, \"Banana Bump,\" requires one participant from each class to attach a banana to their waist by string and push an orange on the ground to the finish line.\r\n\r\n[caption id=\"attachment_77053\" align=\"alignleft\" width=\"275\"]<img class=\"wp-image-77053\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6292.jpg\" alt=\"Freshmen dress according to their theme &quot;Warning\/Under Construction&quot; during Spirit Week 2013. Photo by Molly Fogarty and Cathy Rong.\" width=\"275\" height=\"183\" \/> Freshmen dress according to their theme \"Warning\/Under Construction\" during Spirit Week 2013. Photo by Molly Fogarty and Cathy Rong.[\/caption]\r\n\r\nAssociated Student Body Spirit Commissioners junior Ariya Momeny and junior Emma Cole are leading this year's Spirit Week activities.\r\n\r\n\"I like the fact that our Spirit Commissioners Ariya and Emma are building on last year,\" Hall said.\" Not totally [making it] different, but making some flavor. I think they're going to do a great job with that.\"\r\n\r\nASB's <a href=\"https:\/\/docs.google.com\/document\/d\/1bPEzIA7J8f9gzzhj8F6MBPIL22QhTcWecieUYFyMTGM\/edit?pli=1\">master doc<\/a> is available for info on the week's schedule and detailed rules for each of the activities. Be sure to check back to The Paly Voice for all things Spirit Week 2014.","excerpt":"The most anticipated week of the year for some, Spirit Week, is kicking off with Theme Day on Monday. Freshmen dressed according to \"Lion King,\" sophomores to \"Red Card,\" juniors to \"Pirates\" and seniors to '90s.","date":"2014-10-25 17:46:50","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6286.jpg","categories":["Spirit Week 2014"],"tags":{"30854":"90s","30873":"lion king","30851":"pirates","30872":"preview spirit week","30844":"red card","9119":"Spirit Week","27181":"spirit week 2014","9695":"theme day"}},{"id":76942,"title":"Float building to begin Saturday","permalink":"http:\/\/palyvoice.com\/2014\/10\/24\/float-building-to-begin-saturday\/","content":"[caption id=\"attachment_63814\" align=\"alignright\" width=\"337\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg\"><img class=\"wp-image-63814 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg\" alt=\"Juniors dance around their float, themed after 'Yellow Submarine.&quot; Photo by Cathy Rong. \" width=\"337\" height=\"232\" \/><\/a> Juniors dance around their float, themed after \"Yellow Submarine\" at the last rally of Spirit Week 2013. Photo by Cathy Rong.[\/caption]\r\n\r\nPalo Alto High School students will kick off Spirit Week festivities with float building starting on Saturday at 9 a.m. in the auto shop on campus.\r\n<p style=\"text-align: left;\">The auto shop will be open for building floats on Saturday and Sunday from 9 a.m. to 4 p.m. and Monday through Thursday from 4 p.m. to 9 p.m. All Paly students are welcome to help build the float for their respective grades, which includes structuring wire, painting, making paper mache and more.<\/p>\r\n<p style=\"text-align: left;\">Every grade designs a float to represent its overall class Spirit Week theme. For Spirit Week 2014, the freshman theme is \"The Lion King,\" the sophomore theme is \"Red Card,\" the junior theme is \"Pirates\" and the senior theme is \"Green Light.\"<\/p>\r\n<p style=\"text-align: left;\">ASB senior class president Maya Ben-Efraim encourages all students to get involved.<\/p>\r\n<p style=\"text-align: left;\">\"It's really fun and no previous experience is necessary,\" Ben-Efraim said. \"There are always a ton of nice people, food and music.\"<\/p>\r\n<p style=\"text-align: left;\">Each grade's float will be judged at the Oct. 31 afternoon rally, the last rally of Spirit Week. The judges will score the float based on the following rubric, according to the <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">Paly ASB site<\/a>.<\/p>\r\n\r\n\r\n[caption id=\"attachment_77039\" align=\"alignnone\" width=\"578\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-2.29.46-PM.png\"><img class=\"size-full wp-image-77039\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-23-at-2.29.46-PM.png\" alt=\"Spirit Week floats will be judged based on this rubric at the Friday afternoon rally. 16 points would be a perfect score, and classes that tie will be award the full points of the place for which they tied. Screenshot from Paly ASB site. \" width=\"578\" height=\"288\" \/><\/a> Spirit Week floats will be judged based on this rubric at the Friday afternoon rally. 16 points would be a perfect score, and classes that tie will be awarded the full points of the place for which they tied. Screenshot from Paly ASB site.[\/caption]\r\n<p style=\"text-align: left;\"><\/p>","excerpt":"Paly students will kick off Spirit Week festivities with float-building, starting on Saturday at 9 a.m. in the auto shop on campus.","date":"2014-10-24 19:35:43","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/10\/CH6A6918.jpg","categories":["News","Spirit Week 2014","Uncategorized"],"tags":{"15099":"float","30857":"float building","30858":"maya ben-efraim","9119":"Spirit Week"}}]