[{"id":76469,"title":"Preview: Model United Nations heads to Stanford Conference","permalink":"http:\/\/palyvoice.com\/2014\/10\/16\/preview-model-united-nations-heads-to-stanford-conference\/","content":"[caption id=\"attachment_76483\" align=\"alignright\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10733458_1546730328892616_1062215450_n1.jpg\"><img class=\"size-full wp-image-76483\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10733458_1546730328892616_1062215450_n1.jpg\" alt=\"Members of the Palo Alto High School Model United Nations club pose at their first conference  of the year at San Francisco State University. Photo Courtesy of Anmol Nagar. “Our club [MUN] has been working hard researching and the leadership has been preparing since last year so we expect this year to improve a lot as a club.,” MUN member sophomore Mary McNamara said. \" width=\"620\" height=\"465\" \/><\/a> Members of the Palo Alto High School Model United Nations club pose at their first conference of the year at San Francisco State University. Photo Courtesy of Anmol Nagar. “Our club [MUN] has been working hard researching and the leadership has been preparing since last year so we expect this year to improve a lot as a club.,” MUN member sophomore Mary McNamara said.[\/caption]The Palo Alto High School Model United Nations club will be attending its second conference of the year this weekend from Oct. 17 to Oct. 19 at Stanford University.\r\n\r\nSophomore MUN club member Anmol Nagar is excited about the upcoming conference.\r\n\r\n“I'm super excited. It's our second conference and first conference with new people,” Nagar said. “But I'm also a little bit nervous because the Stanford conference is so big and people come from other countries to participate.”\r\n\r\nFor MUN, the Stanford conference will be a place to continue building experience, according to MUN member, sophomore Tara Madhav.\r\n\r\n“I am nervous, but I'm mainly just excited, because SMUNC [last year’s Stanford conference] was my first conference ever and now I'm going back with a lot more experience” Madhav said.\r\n\r\nMembers will also use this conference as a place to try out new types of committees, according to Madhav.\r\n\r\n“This [the Stanford conference] is my first crisis committee,” Madhav said. “In crisis committees, you aren't re-enacting the UN; you're re-enacting a body or council from a certain time and place in history. Overall, I am definitely looking forward to a weekend of engaging in high intensity debate, creating intelligent solutions and meeting new people who all share a common interest in international affairs.”\r\n\r\n[caption id=\"attachment_76481\" align=\"alignright\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10721045_1546730335559282_1865310450_n1.jpg\"><img class=\"size-full wp-image-76481\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10721045_1546730335559282_1865310450_n1.jpg\" alt=\"MUN club members smile at the San Francisco State University conference earlier this year. “We don't necessarily go for awards. We do it because we are interested in the issues and international relations,” MUN vice president Eli Frankel said. “But if we win awards that’s great.” Photo Courtesy of Anmol Nagar.\" width=\"620\" height=\"465\" \/><\/a> MUN club members smile at the San Francisco State University conference earlier this year. “We don't necessarily go for awards. We do it because we are interested in the issues and international relations,” MUN vice president Eli Frankel said. “But if we win awards that’s great.” Photo Courtesy of Anmol Nagar.[\/caption]\r\n\r\nLast year at the Stanford conference, the MUN team did well.\r\n\r\n“We did fairly well [last year]. We had 14 people going to various committees and we got one delegate who got a verbal commendation” MUN vice president Eli Frankel said.\r\n\r\nDespite the nerves, the club is eager to attend conference.\r\n\r\n“The last conference went amazing,” Nagar said. “I got best delegate in my committee and so did a lot of other people from Paly. Overall we did an amazing job and we're gonna do an even better job at this one.”","excerpt":"The Palo Alto High School Model United Nations club will be attending its second conference of the year this weekend from Oct. 17 to Oct. 19 at Stanford University.","date":"2014-10-16 16:54:17","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10721045_1546730335559282_1865310450_n1.jpg","categories":["News","Uncategorized"],"tags":{"28772":"club","30245":"min","30243":"model un","8996":"play","30244":"united nations"}},{"id":76130,"title":"Livestream: MAC Grand Opening &#8211; Day 1","permalink":"http:\/\/palyvoice.com\/2014\/10\/16\/livestream-mac-grand-opening-day-1\/","content":"The three-day Media Art Center Grand Opening kicks off on Thursday Oct. 16 with a panel of guest speakers discussing the future of journalism. The panel will feature founder of the Huffington Post Arianna Huffington, founder of IDEO David Kelley and Vice Chairman of the Newseum Shelby Coffey. Check back here at 5:30 p.m. to watch the live stream of the event.\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/971bx7PZRho\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The three-day Media Art Center Grand Opening kicks off on Thursday Oct. 16 with a panel of guest speakers discussing the future of journalism. The <a href=\"http:\/\/palyvoice.com\/2014\/10\/16\/livestream-mac-grand-opening-day-1\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-16 15:37:27","author":"Takaaki Sagawa","categories":["Multimedia"],"tags":{"30046":"1","30027":"arianna","29834":"chairman","30039":"Coffey","30033":"columnist","30036":"David","9679":"day","30042":"discussion","17499":"FIRST","30030":"founder","30044":"guest","30025":"huffington","30028":"IDEO","25040":"interview","30032":"journal","8820":"kandell","30034":"Kara","30037":"Kelley","27175":"live","27174":"livestream","30029":"Newseum","30047":"opening day","30041":"panel","30026":"post","9009":"President","30043":"Q&amp;A","30038":"Shelby","9115":"speaker","30045":"speakers","30023":"stream","30031":"street","30035":"Swisher","30040":"VIP","9222":"wall","12702":"wojcicki"}},{"id":76131,"title":"Girls&#8217; golf hopes to take lead against Gunn","permalink":"http:\/\/palyvoice.com\/2014\/10\/16\/girls-golf-hopes-to-take-lead-against-gunn\/","content":"[caption id=\"attachment_76462\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6716.jpg\"><img class=\"wp-image-76462\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6716.jpg\" alt=\"Senior Olivia Johnson and sophomore Elise Kiya take some practice swings at the Palo Alto Municipal Golf course. Photo by Claire Krugler. \" width=\"600\" height=\"541\" \/><\/a> Senior Olivia Johnson and sophomore Elise Kiya take some practice swings at the Palo Alto Municipal Golf course. Photo by Claire Krugler.[\/caption]\r\n\r\nAfter falling to Gunn High School (11-0, 12-1) by three strokes at their last match, the Palo Alto High girls' golf team (9-1, 10-1) is ready to take on the Titans yet again  at 3 p.m. tomorrow.\r\n\r\nPaly first played Gunn on Sept. 15 and lost with a nail-biting score score of 195-192. Gunn is the only team that Paly has fallen to so far.\r\n\r\nCoach Doyle Knight says that his team can pull through this time around.\r\n\r\n\"I hope to give them a good battle. Last time it came down to our No. 5-6 players,\" Knight said. \"Our teams are so evenly matched that we haven't done anything differently, it's who has the better day.\"\r\n\r\nSophomore Emily Hwang says that the team has improved since their last match against Gunn.\r\n\r\n<span class=\"_5yl5\" data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0.0.$end:0:$0:0\">\"We've been working really hard on improving all aspects of our games during practice these last couple weeks, including our mental game,\" Hwang said. \"We're just going to go out there and try our best to play with confidence and not get down on ourselves after a bad shot.\"\r\n<\/span><\/span><\/span>\r\n\r\nKey Gunn players include recent Harvard recruit Anna Zhou. In their last meet against Homestead High School, Zhou shot two strokes under par (34) and freshman Lydia Tsai shot two over par (38) on Oct. 14.\r\n\r\n\"<span class=\"_5yl5\" data-reactid=\".j9.$mid=11413416074055=2e5c92520ce08a36478.2:0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413416074055=2e5c92520ce08a36478.2:0.0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413416074055=2e5c92520ce08a36478.2:0.0.0.0.0.0.$end:0:$0:0\">Gunn's No. 1 player, Anna Zhou, committed to Harvard women's golf last week, so she can obviously shoot really low,\" Hwang says. \"Their whole team is really good and I think it'll be a close match.\"<\/span><\/span><\/span>\r\n\r\nPaly is scheduled to tee off against Gunn at 3 p.m. on Oct. 16 at Santa Teresa Golf course in San Jose.\r\n\r\n&nbsp;\r\n\r\n<span class=\"_5yl5\" data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0.0\"><span data-reactid=\".j9.$mid=11413415937806=2a9af870438c4a7fb93.2:0.0.0.0.0.0.$end:0:$0:0\"> <\/span><\/span><\/span>\r\n\r\n&nbsp;","excerpt":"After falling to Gunn in a close match the first time they played them, the Palo Alto High girls' golf team hopes to pull out a win for the Vikings. ","date":"2014-10-16 13:33:56","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6716.jpg","categories":["Sports"],"tags":{"30252":"anna zhou","30067":"annazhou","30253":"doyle knight","30065":"doyleknight","30066":"emilyhwang","8738":"Golf"}},{"id":76463,"title":"Less parking, more biking – a dangerous mix","permalink":"http:\/\/palyvoice.com\/2014\/10\/16\/less-parking-more-biking-a-dangerous-mix\/","content":"[caption id=\"attachment_76491\" align=\"alignright\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-1.22.57-PM1.png\"><img class=\"size-full wp-image-76491\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-1.22.57-PM1.png\" alt=\"Due to the Caltrain crossing and traffic light, a large group of students will often aggregate in front of the Churchill and Castilleja intersection.“The second that a train passes by, all of the bikers rush towards the school entrance and block off a good portion of the road,” according to Palo Alto High School junior Spencer Yu. Photo by William Zhou.  \" width=\"620\" height=\"466\" \/><\/a> Due to the Caltrain crossing and traffic light, a large group of students will often aggregate in front of the Churchill and Castilleja intersection.“The second that a train passes by, all of the bikers rush towards the school entrance and block off a good portion of the road,” according to Palo Alto High School junior Spencer Yu. Photo by William Zhou.[\/caption]\r\n\r\nAttention is needed at the intersection of Churchill and Castilleja Avenue in light of two Palo Alto High School students getting hit by cars at the intersection last month as well as this past <a href=\"http:\/\/palyvoice.com\/2014\/05\/06\/paly-student-hit-by-car-on-route-to-school\/\">May.<\/a>\r\n\r\n“I was crossing the road when it [the accident on Sept. 12.] happened, so it was extra scary,” junior Tiffany Tsay said. “I didn't notice at first until I heard like a thud and a car hit the kid, and the next thing I saw was this kid on the ground. It's just surprising because you realize that that could happen to anyone of your friends and the chances of it happening are pretty high since a lot of people use that intersection.”\r\n\r\n[caption id=\"attachment_76492\" align=\"alignright\" width=\"620\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-1.24.39-PM.png\"><img class=\"size-full wp-image-76492\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-1.24.39-PM.png\" alt=\"“The number of middle and high school students bicycling to school increased from 840 in 2002 to 3,010 in 2012, by a factor of 3.6,” a safe routes coordinator of the City of Palo Alto Kathy Durham said. “Part of that was an increase in the student population but most is due to the percentage of students biking to school -- from about 22 percent to 55 percent in middle schools and from 11 percent  to 40 percent in high schools.” Data courtesy of Sylvia Star-Lack, Safe Routes to School assistant coordinator.\" width=\"620\" height=\"460\" \/><\/a> “The number of middle and high school students bicycling to school increased from 840 in 2002 to 3,010 in 2012, by a factor of 3.6,” a safe routes coordinator of the City of Palo Alto Kathy Durham said. “Part of that was an increase in the student population but most is due to the percentage of students biking to school -- from about 22 percent to 55 percent in middle schools and from 11 percent to 40 percent in high schools.” Data courtesy of Sylvia Star-Lack, Safe Routes to School assistant coordinator.[\/caption]\r\n\r\nAccording to Assistant Principal Jerry Berkson, on the way to school, students are biking against the traffic, and since cars can turn into the school from both sides of Churchill Avenue, it increases the chance of an accident.\r\n\r\n“In general, it's pretty dangerous because there's a lot of traffic during, after, and before school hours,” Tsay said. “And it's hard to keep track of pedestrians and bikers.”\r\n\r\nA growing number of students combined with a shrinking number of parking spots may also contribute to the issue.\r\n\r\nAccording to Berkson, there were about 1,600 students at Paly when he started working here but now there are around 1,960 students and 2,200 students are projected for the future.\r\n\r\nThe <a href=\"http:\/\/palyvoice.com\/2014\/08\/20\/construction-limits-space-in-embarcadero-lot\/\">construction <\/a>of the school’s new Performing Arts Center has taken up 107 parking spots from the Embarcadero Road lot. To compensate for the loss, students have also gained 27 spaces in the Churchill Avenue lot.\r\n\r\nAccording to Berkson, the combined construction of both the Big Gym and the Performing Arts Center will cause a net loss of 112 parking spaces.\r\n\r\nThe limited parking may make drivers more reckless and pose a larger danger to bikers.\r\n\r\n“I leave for school every morning at 7:30 a.m.,” senior Ellen Shuan said. “Yet I still have limited parking options. I think people are more competitive about parking now.”\r\n\r\nAccording the Berkson, the Paly administration will bring the issue up at the City of Palo Alto’s Bicycle Committee meeting, which happens every second Thursday of the month, and advise both bikers and drivers to be focused and cautionary.\r\n\r\nIf students have any concerns about any events happening at Paly, they should contact the administration.","excerpt":"Attention is needed at the intersection of Churchill and Castilleja Avenue in light of two Palo Alto High School students getting hit by cars at <a href=\"http:\/\/palyvoice.com\/2014\/10\/16\/less-parking-more-biking-a-dangerous-mix\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-10-16 13:33:26","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-16-at-1.22.57-PM1.png","categories":["Features","Spotlight","Uncategorized"],"tags":{"9669":"bike","30247":"chruchill","30246":"crash","30248":"intersection","8996":"play"}},{"id":76377,"title":"Girls&#8217; volleyball to play Dig Pink match","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/girls-volleyball-to-play-dig-pink-match\/","content":"[caption id=\"attachment_76411\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg\"><img class=\"size-full wp-image-76411\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg\" alt=\"Junior Claire Krugler, sophomore Katie Passarello, senior Molly Fogarty, and alumna Becca Raffel sit in assistant coach Jekara Wilson-Gaines's pink car during last year's Dig Pink event. Dig Pink matches include more decorations and  than normal games. Photo courtesy of Molly Fogarty.\" width=\"600\" height=\"480\" \/><\/a> Junior Claire Krugler, sophomore Katie Passarello, senior Molly Fogarty and alumna Becca Raffel (left to right) sit in assistant coach Jekara Wilson-Gaines's pink car during last year's Dig Pink event. Dig Pink matches include more decorations and exciting activities than normal games. Photo courtesy of Molly Fogarty.[\/caption]\r\n\r\nPalo Alto High School's girls' volleyball team (15-8, 1-5) will play Los Altos High School (21-3, 6-0) in its third annual Dig Pink match 6:45 p.m. tomorrow at Los Altos.\r\n\r\nAccording to the press release, Dig Pink aims to promote breast cancer awareness as well as raise money to fund research to find a cure. This event donates money to the Side-Out Foundation, a non-profit organization that advocates breast cancer awareness through volleyball.\r\n\r\nPaly has collaborated with Los Altos for the last two years, and has raised over $4,600 total through the previous annual events, according to the press release.\r\n\r\nSenior outside hitter Hayley Poore said that there are multiple ways that Dig Pink raises money.\r\n\r\n\"<span style=\"color: #3e454c;\">We have a bake sale during the game and sell baked goods, water, and t-shirts,\" Poore said. \"All the money we raise from that goes to the Side-Out foundation. We also collect cash and check donations at the match, or people can donate directly to the Side-Out foundation online.\"<\/span>\r\n\r\nThis year, the coordinators decided to fund-raise a little differently.\r\n\r\n<span style=\"color: #3e454c;\">\"We used to count digs and people could make a pledge to donate per dig, but most people preferred to just pick a specific amount of money to donate,\" Poore said. \"This year, we are not going to be tying donations to the number of digs.\"<\/span>\r\n\r\nWhile this match is scored like a normal game, it's much more exciting, according to Poore.\r\n\r\n<span style=\"color: #3e454c;\">\"It is a regular league match, but the gym is decorated in pink, students perform the National Anthem, in between sets the Los Altos dance team performs, and the game will be filmed by Cal-Hi Sports,\" Poore said.<\/span>\r\n\r\nAccording to sophomore setter Julie Chandler, the teams have fun with this event by dressing up.\r\n\r\n\"We wear the Dig Pink shirts and pink ribbons, and so does the other team,\" Chandler said.\r\n\r\nIn addition to the important charity event, the game will be exciting as Los Altos is one of the strongest teams in the league, according to Poore. Although their last meeting resulted in a Paly loss, Chandler hopes to fight hard this game.\r\n\r\n\"Last time against Los Altos we had a slow start, which made it harder for us to win,\" Chandler said. \"If we can have a strong start and play as a team, we can compete with them and do well.\"\r\n\r\nAccording to Chandler, Los Altos senior Carmen Annevelink will be a huge threat. She committed to UC Berkeley in November of her junior year to play volleyball, according to Annevelink.\r\n\r\n\"A key player to look out for on the other team is Carmen, their big outside hitter,\" Chandler said. \"Getting a good block up on her will be really important.\"\r\n\r\nDespite the strong opposing team, Poore expresses her excitement for the Dig Pink match.\r\n\r\n<span style=\"color: #3e454c;\">\"It's a great way to help a good cause,\" Poore said. \"Lots of people show up and it's fun to see everyone in pink.\"\r\n<\/span>\r\n\r\nClick <a href=\"https:\/\/www.side-out.org\/cb\/campaigns\/campaign\/9095\" target=\"_blank\">here<\/a> to donate to Paly's campaign.","excerpt":"Palo Alto High School girls' volleyball is playing Los Altos High School in the third annual Dig Pink event to raise breast cancer awareness and money for research.","date":"2014-10-15 19:31:33","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/digpink1.jpg","categories":["Sports"],"tags":{"29491":"breast cancer awareness","30048":"carmen annevelink","8642":"Dig Pink","8725":"fundraiser","11244":"girls volleyball","30049":"hayley poore","30050":"julie chandler","9849":"los altos"}},{"id":76174,"title":"Voice of the Week: James Franco","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/voice-of-the-week-james-franco\/","content":"<i>The Paly Voice and the <a href=\"https:\/\/soundcloud.com\/palyradio%20\">Paly Radio Club<\/a> met up with celebrity alumnus James Franco to discuss his murals on Paly's student center, his love for academic environments and whether he would prefer bananas for feet or for hands.<\/i>\r\n\r\n[caption id=\"attachment_76211\" align=\"alignnone\" width=\"445\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.25.08-PM.png\"><img class=\"wp-image-76211\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.25.08-PM.png\" alt=\"The mural painted by actor and alumnus James Franco is inspired by photos from Palo Alto High School’s 1993 yearbook, when Franco was a freshman. On the right lies the original yearbook photo where &quot;Mike Smith throws one of many touchdown passes.&quot; On the left lies James Franco's mural of the image that is now painted on the exterior of the Student Center. Photo by Adele Bloch and Ana Caklovic.\" width=\"445\" height=\"254\" \/><\/a> The mural painted by actor and alumnus James Franco is inspired by photos from Palo Alto High School’s 1993 yearbook, when Franco was a freshman. Right: The original yearbook photo in which “Mike Smith throws one of many touchdown passes.” Photo by Madrono Staff. Left: James Franco’s mural of the image that is now painted on the exterior of the Student Center. Photo by Adele Bloch.[\/caption]\r\n\r\nThe Paly Voice\/Paly Radio Club: What prompted you to paint this mural?\r\n\r\nJames Franco: I have done a lot of work with writing and artwork and even films that are inspired by teenagers or coming of age, and because I went to Paly, this is my main source of reference for this time. I just liked them [the photos in his freshman yearbook in 1993] because when they were in the yearbook, they were just photos of people going to school. But as time goes by, at least for me, my high school years became this weird mythical place. When I was a teenager, it seemed like I felt so much; everything seemed so important and there was so much pressure of all kinds and I was experiencing certain things for the first time. And so, the paintings, for me at least, captured that. Even though they're just paintings of a football game or a volleyball game or The Campanile, to me it evokes the feelings of that time. ... Instead of rebuilding a part of Paly, I could show the art work that was inspired by Paly at Paly.\r\n\r\nRC: Did your high school and your youth tend to have a big influence on your work?\r\n\r\nJF: It [high school] continues to inspire me. When I focus in on high school, the characters for me are much more alive in some ways than older characters. When you get older, you get a little bit more set in your ways. But when you're young, your life is still ahead of you. You haven't made all your most serious decisions about life yet and you're discovering things for the time. I just find that those kind of characters are the most alive when you work with them.\r\n\r\nRC: What's it like coming back to Paly and seeing everything again?\r\n\r\nJF: I love school, and I love being around academic environments. Woj [journalism teacher Esther Wojcicki] and I are even talking about a class that I might teach here in a year [at Paly]. I love it here. When I was in high school, I had a bit of a hard time, but I was just figuring out who I was. But now I love coming back.\r\n\r\n[caption id=\"attachment_76215\" align=\"alignnone\" width=\"393\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.31.07-PM.png\"><img class=\"wp-image-76215\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-14-at-6.31.07-PM.png\" alt=\"Screen Shot 2014-10-14 at 6.31.07 PM\" width=\"393\" height=\"383\" \/><\/a> Franco signs his name and class graduation date on the mural that he painted on the outside of the Student Center. “We wanted to tie it [the mural] in as something that was cool to look at and something that people could feel proud to have as a part of their campus,” Franco’s art studio manager Anna Kooris said.[\/caption]RC: What first got you interested in being an actor and being a part of the entertainment industry?\r\n\r\nJF: I've always loved movies and theater. When I was at Paly, I'd drive to San Francisco to see ACT [American Conservatory Theatre] productions. I'd see David Stratton do the \"Tempest\" there, and I think I saw \"Phantom of the Opera\" there, and \"Chicago\" and stuff like that. That was the only thing that was offered around here. And I've loved it for a long time, but I was very shy. And then in my senior year, I joined the drama class and I did two plays. ... Then I went to UCLA. Once I was in LA and I saw that everyone was trying to get into the movies, so I decided to give it a shot.\r\n\r\nRC: Did any specific teacher help shape your dreams and plans at Paly?\r\n\r\nJF: Since Paly, I've had many very influential teachers. I've been very lucky and I've got to go to a lot of great great schools, so I've had tons of great professors. At Paly, Woj is a big influence.\r\n\r\n[caption id=\"attachment_76207\" align=\"alignnone\" width=\"430\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg\"><img class=\"wp-image-76207\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg\" alt=\"IMG_9080\" width=\"430\" height=\"286\" \/><\/a> Paly alumnus Franco and journalism teacher Esther Wojcicki pose for a selfie in honor of the completed murals. Wojcicki is one of Franco's biggest influences at Paly, and they still keep in touch. Photo by Adele Bloch.[\/caption]\r\n\r\nRC: What was your first acting job after high school?\r\n\r\nJF: I went to UCLA and after a year, I left because I wasn't in the drama program and I wanted to act. So I went to acting school, and my parents said they wouldn't support me if I didn't go to college. So, I then went and worked in the cafeteria at UCLA even though I wasn't a student and then I worked at McDonalds. And then I got a Pizza Hut commercial – it was a Super Bowl commercial, so it paid pretty well, and it was a CG [computer generated] image of Elvis dancing in the Pizza Hut. And so it starts off with a bunch of guys in the parking lot saying, \"Hey, you heard they're selling the new deep-dish pizza at Pizza Hut, and Elvis is serving it?\" And they're like, \"No way, they don't have a deep-dish pizza.\" And then it cuts to Elvis serving a deep-dish pizza. And that was it, and then I could support myself from my acting from that point on. (Watch this commercial <a href=\"https:\/\/www.youtube.com\/watch?v=WIryAZFVKtw\">here<\/a>.)\r\n\r\nRC: Would you rather have banana hands or banana feet?\r\n\r\nJF: Oh, tricky. Like slip all over the place kind of thing?\r\n\r\nRC: No, if you just had five bananas right here on your hand jutting out?\r\n\r\nJF: But they'd break really fast.\r\n\r\nRC: I'd just like to think that they'd be ready for action as a hand or as a foot.\r\n\r\nJF: I think I use my hands more than my feet, so I'd have to do banana feet. If I got hungry, I can just eat my feet.\r\n\r\n[caption id=\"attachment_76221\" align=\"alignnone\" width=\"416\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg\"><img class=\"wp-image-76221\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9051.jpg\" alt=\"Two helpers hang up Franco's painting of a water polo player in 1993. Over 10 of Franco's paintings that are inspired from yearbook photos are spread throughout the Media Arts center. Photo by Adele Bloch.\" width=\"416\" height=\"277\" \/><\/a> Two helpers hang up Franco's painting of a water polo player in 1993. Over 10 of Franco's paintings that are inspired from yearbook photos are spread throughout the Media Arts Center. Photo by Adele Bloch.[\/caption]\r\n\r\nPV: Do you have any advice for students in general or student journalists?\r\n\r\nJF: What I love about that class [The Campanile] is that you're in school but you're working on something that creates a product for the school. What that means is that you are becoming aware of your readers. You aren't just writing for a grade – you're writing to get people to read it. That creates a completely different kind of relationship between you and your work, and it's on the way of creating a professional relationship with your work. So any time, if you want advice, any time you can have that situation or start to become aware of what it is you're doing or what you will be doing when you write professionally and how you're connecting to your audience is really valuable.\r\n\r\n<em>Franco is holding an art show and film premiere for the grand <span class=\"Apple-style-span\" style=\"color: #000000;\">opening of the Media Arts Center from 5 p.m. to 8 p.m. on Saturday, Oct. 18. Tickets can be bought <a href=\"http:\/\/www.eventbrite.com\/e\/james-franco-art-showfilm-debut-palo-alto-high-media-arts-celebration-registration-13079118997\">here<\/a>.<\/span><\/em>","excerpt":"The Paly Voice and the Paly Radio Club met up with celebrity alumnus James Franco to discuss the mural he painted on Paly's student center, his love for academic environments and whether he would prefer banana feet or banana hands.","date":"2014-10-15 18:30:47","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9080.jpg","categories":["Spotlight","Voice of the Week"],"tags":{"29992":"franco","29991":"james","8801":"james franco","8904":"mural","8939":"palo alto","10258":"voice of the week"}},{"id":76363,"title":"Slideshow: Paly volleyball takes on Mountain View","permalink":"http:\/\/palyvoice.com\/2014\/10\/15\/slideshow-paly-volleyball-takes-on-mountain-view\/","content":"The Palo Alto High School Vikings (15-8, 1-5) fell to the Mountain View High School Spartans (15-8, 3-3) in five sets, 21-25, 25-18, 21-25, 25-16 and 7-15. They will face the best league-record team Los Altos High School at 6:45 p.m. on Thursday on the road for the annual <a href=\"http:\/\/palyvoice.com\/?p=76377&amp;preview=true&amp;preview_id=76377&amp;preview_nonce=a727d7ea46\">\"Dig Pink\"<\/a> event that raises breast cancer awareness.\r\n\r\n[slideshow post_id=76363]\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School Vikings (15-8, 1-5) fell to the Mountain View High School Spartans (15-8, 3-3) in five sets, 21-25, 25-18, 21-25, 25-16 and 7-15. They will face Los Altos High School at 6:45 p.m. on Thursday on the road.","date":"2014-10-15 17:13:41","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/LRP_0875.jpg","categories":["Slideshow","Sports","Spotlight"],"tags":{"8770":"home","30009":"mountian view","8965":"paly volleyball","9107":"slideshow","9216":"volleyball"}},{"id":76153,"title":"What do I do on College And Career Awareness Day?","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/what-do-i-do-on-college-and-career-awareness-day\/","content":"Confused about what exactly each grade is doing tomorrow during College and Career Awareness Day? Worry no more, The Paly Voice is here to help you figure it all out.\r\n\r\nPalo Alto High School students will participate in their respective grades' college preparatory-related activities for College and Career Awareness Day tomorrow, with changes from last year and juniors still taking the <span style=\"color: #000000;\">Preliminary SAT\/National Merit Scholarship Qualifying Test.<\/span>\r\n\r\nThis year, the College and Career Awareness Day has been changed because of the discontinuation of the ACT Plan and ACT Explore tests.\r\n\r\nIn the past, freshmen would take the Explore test, sophomores would take the Plan test, juniors would take the <span style=\"color: #000000;\">Preliminary SAT\/National Merit Scholarship Qualifying Test®<\/span> and seniors would have college preparation workshops. Because the SAT is planned to change for the Class of 2016, the practice tests are no longer being given.\r\n\r\nInstead, freshmen and sophomores now have two seminars with their teacher advisers about career exploration and planning. Guidance counselor Charles Taylor says the goal this year was to try and find seminars that kept the theme of college and career awareness, in the place of taking practice tests.\r\n\r\nTaylor says that the senior workshops have been very successful in the past and they wanted to continue with them. However, Ann Deggelman, coordinator of the TA program, says a financial literacy session has been added to the senior workshops based on surveys from seniors in the past. Financial Literacy will teach students about checkbooks and bank accounts and other life skills, Deggelman says.\r\n\r\nFor seniors, some workshops will be held during both sessions and you can chose which workshops would be most beneficial. College Application Help is a general question session for seniors who still are confused on certain parts of the application process. The UC and CSU session goes over the differences in these two applications and the best way to go about these applications. College Essay help has group review and teacher review of college essays for a variety of opinions in order to obtain the best college essay.\r\n\r\nSome workshops are only offered during one session such as the new financial literacy workshop. Other one session workshops are helping with college interviews or figuring out if community college is the right option.\r\n\r\nMany seniors have been debating the importance of College and Career Awareness Day, but some are certain of its significance.\r\n\r\n“I would like to go to the College and Career [Awareness] Day because I think it will make me more aware of the college process,” senior Jack Brook said.\r\n\r\nThe full list of events for tomorrow can be found <a href=\"http:\/\/paly.net\/news\/college-and-career-awareness-day-october-15\">here<\/a>.","excerpt":"Palo Alto High School students will participate in their respective grades' college preparatory-related activities for College and Career Awareness Day tomorrow, with changes from last year as freshmen and sophomores will now attend college and career exploration pathways.","date":"2014-10-14 21:52:35","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9984.jpg","categories":["News"],"tags":{"9678":"career","8604":"college","29990":"college and career awareness","29217":"psat"}},{"id":76160,"title":"PTSA to host social justice presentation","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/ptsa-to-host-social-justice-presentation\/","content":"[caption id=\"attachment_76164\" align=\"aligncenter\" width=\"583\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg\"><img class=\" wp-image-76164\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg\" alt=\"Students watch Global Lives videos after school in the MAC. The video exhibit, which will be running Oct. 13-18, features footage of ordinary people from 17 different countries. Photo by Jeanette Wong.\" width=\"583\" height=\"437\" \/><\/a> Students watch the Global Lives videos, which feature rare, unedited footage of ordinary people around the world, after school in the Palo Alto High School Media Arts Center. The video exhibit, which will be running Oct. 13-18, is part of the Global Lives Project's overall promotion to reshape how we conceive cultures outside our communities. Photo by Jeanette Wong.[\/caption]\r\n\r\nThe Parent Teacher Student Association will host a presentation on the new Social Justice Pathway at 7:45 p.m. tomorrow in the Palo Alto High School Media Arts Center.\r\n\r\nSocial Justice Pathway teachers Eric Bloom and Erin Angell will speak on social justice and how social justice is used at Paly. The pathway is a three-year program geared towards students interested in \"empowerment, convinction and the passion to build a better world,\" according to the <a href=\"http:\/\/www.palysocialjustice.blogspot.com\/\">Paly Social Justice Pathway blog<\/a>. The website also states that the pathway is a new program implemented this school year.\r\n\r\nThe full event begins at 7 p.m., which gives visitors a chance to <a href=\"http:\/\/palyvoice.com\/2014\/09\/25\/local-nonprofit-invites-community-to-step-out-of-your-world\/\">view the Global Lives Project exhibit<\/a> before the presentation. Following the presentation, there will be a question and answer session on the topics of Global Lives and social justice. At the end of the program, attendees will have a chance to try food from a variety of places.\r\n\r\n<span style=\"color: #000000;\">The Global Lives Project aims to \"explore the diversity of human experience ... and encourage discussion, reflection, and inquiry about the wide variety of cultures, ethnicities, languages, and religions on this planet,\" according to its <\/span><a href=\"http:\/\/globallives.org\/about\/overview\/\">official website<\/a>.\r\n\r\nAttendees are encouraged to bring specialty desserts from their cultures, such as egg custard tarts from Hong Kong or baklava from Greece, according to the Yael Irom, Assistant Director of the Global Lives program.\r\n\r\n“I’m glad that we have this event,” sophomore Jenny Zhuge said. “It’s really cool that people are bringing food from different places.”","excerpt":"The Parent Teacher Student Association will host a presentation on the Social Justice Pathway at 7:45 p.m. tomorrow in the Palo Alto High School Media Arts Center.","date":"2014-10-14 18:24:28","author":"Jeanette Wong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo2.jpg","categories":["News"],"tags":[]},{"id":76129,"title":"Volleyball Liveblog: Paly vs. Mountain View","permalink":"http:\/\/palyvoice.com\/2014\/10\/14\/volleyball-liveblog-paly-vs-mountain-view\/","content":"<em>Palo Alto High School's volleyball team will take on Mountain View at 6:45 p.m. in the Big Gym. Check back then for live coverage. <\/em>\r\n\r\n[liveblog]","excerpt":"Palo Alto High School's volleyball team to take on Mountain View at 6:45 in the Big Gym. Check back then for live coverage. ","date":"2014-10-14 13:33:05","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/photo4.jpg","categories":["Sports"],"tags":{"29989":"mountain view","10021":"paly sports","9216":"volleyball"}}]