[{"id":72493,"title":"The speeches that didn&#8217;t make it, Class of 2014","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014\/","content":"[caption id=\"attachment_72507\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg\"><img class=\"wp-image-72507\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg\" alt=\"Students of the graduating class of 2014 toss their caps into the air after the graduation ceremony Wednesday afternoon. Photo by Molly Fogarty.\" width=\"800\" height=\"600\" \/><\/a> Students of the graduating class of 2014 toss their caps into the air after the graduation ceremony Wednesday afternoon. Photo by Molly Fogarty.[\/caption]\r\n\r\n<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-i\/\">Jack Hansen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-ii\/\">Travis Chen<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iii\/\">Yumi Temple<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iv\/\">Becca Althoff<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-v\/\">Jackie Sun<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/\">Maya Kitayama<\/a>\r\n\r\n<a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Hillel Zand<\/a>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Paly Voice acquired the following speeches from their authors, who wrote the speeches with the intention of delivering them at graduation, but were not selected to present. Read on to view speeches from the Class of 2014 that could have been given.","date":"2014-05-28 19:42:14","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_1606.jpg","categories":["Features","Spotlight"],"tags":[]},{"id":72381,"title":"The speeches that didn’t make it, Class of 2014: Part VII","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice,<\/em> nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Hillel Zand\r\n\r\nLadies and gentlemen, graduates of the class of 2014:\r\n\r\nI would like to start off by talking about where you are sitting. Welcome, one and all, to the Palo Alto High School Quad. The Quad is resilient. It is the hub of campus, a staple of daily life. But to me, what the Quad really represents is learning; it is where we as students learn to be social.\r\n\r\nI’ve learned quite a bit about human interaction in high school classrooms. I’ve learned about humans being social creatures, about how methods of communication have changed, about social tendencies. But let’s be real here: in 10 years, we’re only going to remember a fraction of what we’ve learned in the classroom. Learning really happens outside the classroom, places like the Quad — at parties, at friends’ houses, on meaningless car rides.\r\n\r\nJust as much as the Quad facilitates, it also depreciates. As hard as I try, I will rarely stand out from my peers on this patch of grass. There is little to differentiate one Viking from the other. So I began to wonder: Why is it so hard to stand out?\r\n\r\nConformity. In order to appease others’ needs, we conform. The boys and girls we were on the first day of freshman year are long-lost from the young men and women we are today. For better or worse, we’ve developed new habits, met new people and changed our lifestyles.\r\n\r\nOn the Quad, we conform. So today, I ask you this: On your last day at Paly, what have you done to be noticed?\r\n\r\nBoth inside and outside the classroom, it takes more effort to stand out than to go along with what everyone else is doing. And when we try to be different, we often fail. Thus, I have learned these four years that the answer to “What can I do to stand out” is just that: make mistakes.\r\n\r\nI hate mistakes. I hate them with all my power, and you probably do too, but we have to respect them.\r\n\r\nLet me tell you about a mistake I made:\r\n\r\nOn the very first day of senior year, on this very Quad, I made the mistake of taking off my clothes and running — ever so slowly — across the grass you sit on. Sure, it’ll be a good story to tell my grandchildren one day, but it was in the heat of the moment, a moment of deindividuation.\r\n\r\nAs I dealt with a two-day suspension, I realized that I had a choice. I could choose how I wanted to be different. Two roads diverged in a wood, and I decided to take the one less traveled by. When I returned to school, I made sure that I did not let that incident define me. I made the conscious decision to stand out by building relationships with the administration, fostering conversation and — with the support of Ms. Diorio — helping usher in a new wave of senior legacy.\r\n\r\nTo me, standing out means accepting the learning potential that comes with the inevitable mistakes we have made and will make. It's not the mistake itself that makes us stand out, it's the process of making sense of the past in a way that provides true learning and growth that makes us stand out.\r\n\r\nAs we begin a new chapter in our lives, we must not be afraid to make mistakes, but more importantly, we must not be afraid to learn from them. Most will conform to the stigma that their mistake binds them to. Most will be afraid of standing out.\r\n\r\nClass of 2014: In order to differentiate ourselves, we must make mistakes. Be the one to fail. In fact, I challenge you to fail. Learn from such mistakes. Defy societal expectations and stand out for the right reasons: for being innovative, for being witty, for not conforming.\r\n\r\nConformity squanders potential. Embrace the accidental potential that lies within each of us.\r\n\r\nThank you, good night and good luck.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:21:02","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72367,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part VI","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Maya Kitayama\r\n\r\nFour years ago, I would not have pictured myself standing here, speaking at graduation. When I started as a freshman on this campus, I immediately designated myself as a quiet, reserved, and semi-awkward adolescent who really liked to dance. I carried this identity as a shield, keeping myself restricted and closed off from other opportunities. All around me, I saw my class as a collection of labels. And I began to grow a hatred for the institution of high school, a school of classifications.\r\n\r\nFor a long time, I believed high school was about immediately identifying yourself and sticking to the hasty decision for the next four years. I never even bothered to consider that there could be more to the high school experience besides getting through as fast as possible. Rather, I’ve managed to morph into a person that my freshman year self wouldn’t recognize.\r\n\r\nAs a freshman, no one knew who I was. As a senior, people still don’t really know who I am, but I’m okay with that. It’s taken me four years, but I’ve come out on the other side without the label I placed on myself, alongside a class who has defied every preconceived notion I’ve had of them.\r\n\r\nLet’s face it, Paly is tough. And there’s nothing wrong with that. This school pushes us academically and forces us to work tirelessly in order to thrive. But Paly, whether we’re aware of it or not, also shows us what we’re truly capable of. This is the school that tests the limits and pushes boundaries, but ultimately turns out a graduating class each year bursting with capability, passion, anticipation, and the assurance that they are ready to take on the world. The class of 2014 is no exception. I am honored to graduate with a group of so many amazing individuals. Granted, I don’t know all of you, and to be quite honest, I don’t know if I like all of you either. But regardless of my personal preference, this is a class completely capable of taking on the next stage in life. And we all have this school to thank.\r\n\r\nOne of the stereotypes of being a teenager is the idea that we think we’re all free and invincible. And, in some cases, we prove this to be true. But an equally significant part of being a teenager is self-doubt. The unanswered question of whether or not the person I am is the person I’m supposed to be.\r\n\r\nI’d like to think I’m no longer the quiet freshman I thought I was supposed to be. Sure, I’m still semi-awkward, and yes, I still like to dance. But Paly has allowed me to find a greater version of myself. Someone not afraid to yell, throw out my opinion, and tackle a challenge. Someone who can stand before you all today and sincerely say she owes it to this school for helping her get here. Thank you.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vi\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:20:20","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72354,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part V","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-v\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice,<\/em> nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Jackie Sun\r\n\r\nPrincipal Diorio, members of the School Board, teachers, parents, friends, and fellow graduates, it is an honor to speak to all of you today. First off, I’d like to thank all the faculty who have devoted countless hours to making us better and more civilized people. I’d like to thank the parents who have sacrificed so much to give us opportunities to grow and expand our minds. And, most importantly, I’d like to thank the class of 2014 for shaping my Paly experience and molding me into the person I have become.\r\n\r\nHere I have 5 minutes to pass down some meaningful advice and inspiration to you all. Well, I’m only 17 years old. I haven’t even technically graduated from high school yet! I’m probably one of the least qualified people to be giving any advice. So instead of giving advice, I’m going to tell some stories, and hopefully something will be gleaned from them.\r\n\r\nFour years ago, when I moved to Palo Alto, I felt like a failure. I was not very sociable, my middle school years were not particularly pleasant, maybe most people can relate, and I felt isolated and distant from my fellow classmates. I came to Paly with no real sense of who I was. I was a just a face in the crowd, exacerbated by the fact that I knew no one and nothing about the culture of Paly. I was unhappy, mainly because I hadn’t found the group of people I wanted to spend time with. On Club Day, however, I signed up to join the Speech and Debate team. And suddenly, my life improved tremendously. Here I found a bunch of students, from all different grade levels, seniors to other freshmen, that I had a connection to, a common interest. I filled a gap that I hadn’t even realized was there. I felt I was finally a part of something. I learned so much from this team, not only about public speaking and research, but about also life, and how life gets so much easier when you share your experiences with other people.\r\n\r\nAnd therein I learned my first valuable lesson from Paly: discovering yourself is not a singular activity. It involves the people you surround yourself with, your peers, your collaborators, your friends. When you’re driving on the road that is your life, you’ll have a number of blind spots. So choose good friends that will look out for your blind spots, support you unconditionally, and love you for you, and you’ll be more than fine.\r\n\r\nI want to share another story. Over the summer, I had the wonderful experience of being a counselor at a summer camp for middle school students. I can safely say I understand how teachers feel when they are teaching second semester seniors. We had the challenge of injecting passion and enthusiasm into the adolescents, seeing as most of them were there because their parents signed them up. I was tired and frustrated at the time, because it was hard to motivate the students to do the activities we gave them. However, when I saw a fellow counselor bounding in from another room and how sociable and eager her charges were, it didn’t take long for me to realize that my students weren’t excited because I wasn’t passionate about what we were doing. How could I expect them to share my enthusiasm when I had no enthusiasm to share?\r\n\r\nThose kids taught me something important. When you are passionate about what you are doing, others will share in your passion as well. This leads to a wonderful symbiosis where everyone is united in their interests. Something like Spirit Week. All it takes is for one person to start a cheer and others will follow. It is not enough to achieve your own dreams; you must inspire the dreams of others. In the case of the summer camp, I found that once I perked up, the students started perking up and their excitement and achievements were so rewarding to see. So, going forth in my life, I will take the lesson that those kids gave to me: to lead with spirit and heart, and to include those important to me in my passions.\r\n\r\nI chose these two stories because I feel they illustrate something important: choose a group of people that will inspire you, and in turn, you will inspire them. Share your passions and others will share there’s. Give back to the community in any way that you can, because, after all they were the ones that made you, you. Life is not fun when you don’t share it with others, something that I learned my freshman year; and I am so glad that I got to share my years at Paly with these graduates here.\r\n\r\nActually, now, that I’m thinking about it, I lied at the beginning of my speech. I do have a piece of advice to give: don’t forget to turn the tassel on your way down the stairs! Thank you and congratulations to the class of 2014!!\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-v\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:19:27","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72351,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part IV","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iv\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Becca Althoff\r\n\r\nAt first, I wanted to title my speech, “You win some; you lose some.”\r\n\r\nI wasn’t sure if I needed a title or not so I picked a phrase that best described how I see my high school career at a quick glance.\r\n\r\nIn high school, I have found that it is easy to see individual events as separate “wins” and “losses”, especially among so many students who are driven to succeed.  By the time I had reached my senior year, I accepted that I’d have to face the fact that sometimes you win and sometimes you lose.\r\n\r\nSometimes you ace a test, sometimes you fail.\r\n\r\nSometimes you get what you want, sometimes you don’t.\r\n\r\nSome people get into their dream schools, some people go elsewhere.\r\n\r\nSometimes you feel like a winner, but sometimes, you really just don’t. And that’s okay.\r\n\r\nWhat makes Paly, particularly the class of 2014, different, is that we have established a community that supports.  A community that accepts the times in which we may not succeed and rejoices during the times in which we do.  We have established a community that consists of people who are shamelessly excited to sometimes live vicariously through the successes of their fellow classmates.  We’ve won some, we’ve lost some.  But the “wins” of few are often celebrated by many.  And that has made all the difference.\r\n\r\nWe are excited to read the latest articles produced by the talented students within the journalism program and are open minded to the events put on by various clubs.\r\n\r\nFans and athletes alike seem to have a feeling of victory in our hearts when the Vikings come home with a win and when Paly Rocks performs on the quad at Friday lunch, the long week of school that preceded seems to fade away and we can nod to ourselves thinking, “yes, I deserve this performance” and “Thank you Paly Rocks.  You win for providing us with this music.”\r\n\r\nOur class has won spirit week. We have also lost.  How many times? I guess that might just be something that we keep to ourselves.  But if it weren’t for Audrey and Kate working as hard as they could all week long, each year, I don’t know how we would’ve pulled off what we did.\r\n\r\nAnd while those memories might fade for some of us, the one thing that will never seem to go away is the community we have made here.  It’s cliche and sounds like it came off of a Hallmark card but it’s how I feel.  And I think it’s fantastic that here, on the day of my high school graduation, I don’t need to fake any sort of sincere happiness and pride.  I don’t need to casually say, “You win some; you lose some” to disguise any feeling of regret or indifference.\r\n\r\nBecause today I am standing next to downright hardworking people.  I am among people who have already started and sold their own companies, people who have brought Paly it’s first TEDx conference, people who produce their own music, people who have started their own clubs, someone who has represented our country at the Olympic games, and someone who has represented our country on the national physics team.  I am standing among people who have plans to travel the world, people who have plans to pursue their passions, people who have plans to continue learning, and people who might not have any plans at all quite yet.  And that’s exciting too.\r\n\r\nI haven’t scored a touchdown, I haven’t won an election, I haven’t been in charge of a publication, and I haven’t won any academic awards.  My greatest level of participation in organized activity at Paly was co-leading the spirit dance and being a part of the marching band at football games.\r\n\r\nBut even so, I have experienced a community that has made me feel supported and I have been genuinely excited to watch my classmates pursue their academic, athletic, artistic, political, and social goals.  Most importantly, I am a part of a class that has made me feel like I can be a part of it all.  Whatever it may be.\r\n\r\nI stand here today, looking back on the past four years I’ve spent with these amazing 481 people, knowing now more than ever, that in reality I have won a whole lot and really lost nothing at all.\r\n\r\nThank you, Class of 2014.  And Congratulations.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iv\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:18:46","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72348,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part III","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iii\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Yumi Temple\r\n\r\nHello Paly parents, relatives, faculty and students. Thank you all so much for being in attendance today to celebrate the achievements of the graduating class of 2014. My name is Yumi Temple, and I am a proud member of this graduating class, to whom I address this message.\r\n\r\nWe live in a world with numerous problems: poverty, global warming, and war are just the start. In the face of such daunting issues, some may conclude that we must wait until we’re older to impact our world. However, I respectfully disagree. When I look at this class, I see a passion for the betterment of this world, that outshines any inexperience, and a certain shameless optimism that makes me believe in our power for change. I see individuals alive with an irrepressible exuberance for change, and I see this zeal every day, in a classmate’s compassion towards autistic children or in another’s pursuit of gender equality. I ﬁrmly believe that each of us has a passion and a gift that we must give back, no matter our age or experience: and the beautiful thing is that we get to witness this process of giving back every day.\r\n\r\nEach day, my classmates give their gifts back to our community through tutoring, volunteer work at animal shelters and senior centers, involvement in athletics, and in congratulating a friend on beating 2048 and more. Every day, small gifts of kindness, determination, and knowledge are given and reciprocated. The gifts we’ve given back show how much we already impact our world, despite our inexperience. As young as we are, we make a difference to each other, and even better than witnessing the amazing gifts and passions of my classmates, is knowing that as we take up the mantle of responsibility as adults within our society, our impact will only grow, until perhaps one day, we solve the problems of this age.\r\n\r\nOne of my inspirations is The Dalai Lama, and he said “In order to carry a positive action, we must develop here a positive vision,” and my vision for the future is overwhelmingly positive, where the young adults of today grow into the adults of tomorrow, and never lose the vivacity and inspiration that makes them an integral component of change in our world. We have the potential to do great things in the\r\nfuture, but also the ability to do those things now. Looking at all of you today, that present potential is evident. I’m so proud of everything we’ve achieved together, and so excited to see what effects our individual gifts and passions will have on the world.\r\n\r\nThank you for everything you’ve taught me, and congratulations to the Class of 2014\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-iii\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:18:10","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72345,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part II","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-ii\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Travis Chen\r\n\r\nHello friends, teachers, parents, and grandparents of 2014 - I’m honored to speak in front of all of you today; it’s been quite a ride. If you were expecting a forward-looking, philosophically dense, and mature recollection of our potential for the future, I apologize in advance, because today, I invite us to take the magic school bus ride back in time.\r\n\r\nFor those of you who aren’t in line with the debacle we know as Facebook, Paly had a competition first semester to determine who had the best statuses of 2008-2010, the dark ages known as middle school. For the sake of minimizing embarrassment for those brave individuals who submitted statuses, I’ll maintain anonymity, but I do want to share a few highlights: “When life hands u crap make crap-aid” [pause]  “How the [F] do people get such high scores in doodle jump” [pause] “give me farm-ville presents!!” [pause]  “I'm peeing myself” [pause] “Yes!! Over 200 friends!!” [pause] My god! “terrible star test scores. I’m so mad! :( “ [pause] “Merry Christmas people!!! OMG Santa’s gonna break into my house in a couple hours!!! YAYYAYAYAYA!!!!” who by the way was already a <em>freshman<\/em> by the time he wrote this. [pause] “my mom just counted 27 dog poops, guess my brother and sis haven’t really been doing their job” [pause] and my personal favorite “via Jonas Brothers Live Video Chat. If u cud go enywhere in the world wher wud u go?” <em>– By the way, <\/em><em>seniors, I’m sorry if I haven’t chosen yours, I promise I still think whatever you said was hilarious.<\/em> This, I believe, captures the true spirit and mysteries of youth - our priorities may have shifted, from Doodlejump to SAT scores, from the Jonas Brothers and 2009 Miley Cyrus to 2014 Miley Cyrus, but the fundamental questions withstand the test of time: if you could do anything, what would you do with your life, where would you go, and who would you meet?\r\n\r\nOn the last day of our momentous Facebook contest, incidentally on the day before early apps were due, one of its organizers announced: “Deadline is tonight at midnight! Do this instead of college apps! College is only 4 years, but high school popularity is forever!” He’s right, [pause] in some ways. As we move forward into college, work, traveling abroad, I invite us to look back at the limitless potential of our youth and what we envisioned our future to be and whether it lines up. This does not imply that we should remain stuck in our past and its exigencies, but rather that we should draw upon the same energy of our youth as the guiding spirit for the future and its boundless potential. In the same way that we think Santa, Farm-Ville, and STAR test scores are beyond us, we may one day view our frenzy for college apps, grades, and Flappy Bird as silly. But what remain eternal is our energy, curiosity, and desire to progress. From Ms. Choy’s lively puns to Mr. Bungarden’s <em>occasional <\/em>moments of youthful pure joy, the spirit of youth exists within all of us. Our search for what is valuable is elusive as times change what we view as important, but ultimately, this search itself is what is valuable.\r\n\r\nToday signifies the day that we move on, 4 years older than when we first stepped foot on this campus, but let’s not forget to live life, doodle jump, keep dreaming, and most of all, stay young.\r\n\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-ii\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:17:44","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":72343,"title":"The speeches that didn&#8217;t make it, Class of 2014: Part I","permalink":"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-i\/","content":"<em>The Paly Voice<\/em> acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of delivering them at graduation, but were not selected. Each speech went through an evaluation process on May 19 by a panel of staff members. The views stated in these speeches do not necessarily reflect the views of <em>The Paly Voice, <\/em>nor those of its staff.\r\n\r\n<strong>Graduation Speech<\/strong>\r\n\r\nby Jack Hansen\r\n\r\nGood afternoon, everybody! I would like to start by saying thank you to everybody here.  For all of you who made sacrifices so that we graduates could be here today, on behalf of the entire class of 2014, we really appreciate it.  Thank you for being here today, and thank you for being there for us the past four years.  I say this because for many of us up here today, High School was hard, harder than we expected before we arrived here and sometimes harder than we understood in the midst of the experience.  It’s true: it was the hardest thing we have gone through in our lives so far.  Now, for those of you who are thinking right now, “if he thinks that High School was hard, he has another thing coming,” let me explain first. Four short years ago, we had no real idea how High School would challenge us to grow.  Many of the things that you hear in Middle School about High School turn out to be true.  It is just the way that High School works.  “There is going to be way more drama than what you are used to.” Yep.  “Reputations will stick with you.” Absolutely.  “You’re going to lose some of your best friends.” I didn’t think that would be true, but it was.  Not to mention that on top of it all, our school work was always getting in the way. Now, just a quick heads up, for those of you who have seen the new Spiderman movie, this next part is inspired by the graduation speech that is given in that.  It’s ok though because Emma Stone is awesome and gave a great graduation speech herself.  I’m not plagiarizing, consider this an homage. It is extremely easy for all of us up here to feel like we have made it right now, that we have conquered this beast that we call High School.  Especially on such a beautiful day in such a beautiful place, it is easy to think that this is it-- that from here on out it’s all smooth sailing.  Not to be a buzzkill, but that is not the case.  There are going to be much more difficult times in our lives.  We are going to feel alone.  There will be challenges far harder than anything we have experienced so far.  High School was not the worst, hardest, or longest 4 years of our lives.  In fact, I know without a doubt that there are going to be many more difficult things that we all will go through in our lives. I think that everybody sitting up here with me, as well as every high school graduate in the audience, can agree with me that there are struggles that we all go through in high school.  Some people may have had an easier time than others, myself probably being one of them, but we all have this shared experience of going through it together.  At Paly.  And for many of us, these were the first real challenges in our lives, which is what made them seem so hard. Very few, if any, of us up here have experienced the trials of real life to the extent that we probably all will at some point in our lives.  Of course there will be differences in our lives, and while some of us may get lucky and become successful, some of us are going to strike out and have actual, real world struggles.  But after graduating from this great school, and after having all the character-building experiences that our time here has provided, each of us has the foundation to accomplish great things. What I am saying right now, as I said before, is thank you.  Thank you Palo Alto High School for everything that you have given me and my classmates.  Thank you moms and dads that support us all at home.  Thank you teachers for making every day engaging and interesting and showing us what we are capable of.  Thank you to everybody up here behind me for going through it all with me.  I don’t know whether or not I would have been able to do it without all of you, but I know for a fact that you guys made it so much more worthwhile. Because aside from an excellent education and plenty of memorable experiences, there are several things that my peers and I will take with us from Paly that will help us get through the trials of the future.  In my opinion, the most important of these things is that we have learned to be hopeful about the future.  For the first time in my life, I truly understand what the phrase “upwardly mobile” means, it means that we have the possibility to improve our station in life, and that is thanks to the great opportunities and advantages that have been presented to us in our youth. There is no way for us or anybody around us to know exactly what the future will bring.  But going to Paly has given us all the ability to be hopeful, and because of that I know that we all look forward to the future trials coming our way and are excited to embrace them, because we know that we will be ok.  That is the greatest gift that we ever could have received and we all owe it to Palo Alto High School.  We are able to understand that life is going to be hard, harder than it ever has been before, and we are able to be ok with that.  Our time at Paly has taught us that we can work our way through any challenge and end up better people because of it. Thank you Palo Alto High School for preparing me and my peers for everything that is yet to come.  You have given us no reason to fear the future, and in fact, you have given us every reason to look forward to it!\r\n<span style=\"color: #000000;\">Click here to find: <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72343&amp;preview=true\">Part I<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72345&amp;preview=true\">Part II<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72348&amp;preview=true\">Part III<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72351&amp;preview=true\">Part IV<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72354&amp;preview=true\">Part V<\/a><span style=\"color: #000000;\">, <\/span><a style=\"color: #31318c;\" href=\"http:\/\/palyvoice.com\/?p=72367&amp;preview=true\">Part VI<\/a>, <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-vii\/\">Part VII<\/a>.","excerpt":"The Paly Voice acquired the following speeches from their authors, with their authors’ consent to publish. The authors wrote the speeches with the intention of <a href=\"http:\/\/palyvoice.com\/2014\/05\/28\/the-speeches-that-didnt-make-it-class-of-2014-part-i\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-28 18:17:06","author":"Noa Braun","categories":["Uncategorized"],"tags":[]},{"id":71358,"title":"All-girls robotics team mentors first Colombian robotics team","permalink":"http:\/\/palyvoice.com\/2014\/05\/27\/all-girls-robotics-team-mentors-first-colombian-robotics-team\/","content":"","excerpt":"Local all-girls robotics team mentors the creation of the first all-girls FRC robotics team in South America","date":"2014-05-27 11:44:38","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/svrbooth1.jpg","categories":["Editor's Pick","Features"],"tags":{"17501":"5311","17510":"Ames Research Center","17509":"Bogota","17505":"Colombia","17512":"Ebeth Mittman","17499":"FIRST","17498":"FRC","17504":"Girl Scouts","17503":"NASA","9049":"robotics","17507":"SENA","17511":"Silicon Valley Regionals","17506":"South America","17497":"Space Cookies","17500":"Space Stars","17508":"Stephenie Zhang","17502":"team 1868"}},{"id":72273,"title":"&#8220;Palo Alto&#8221; offers unconvincing, aimless portrayal of high school life","permalink":"http:\/\/palyvoice.com\/2014\/05\/27\/palo-alto-offers-unconvincing-aimless-portrayal-of-high-school-life\/","content":"[caption id=\"attachment_72452\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party1.jpg\"><img class=\"wp-image-72452 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party1.jpg\" alt=\"&quot;Palo Alto&quot; centers around the experiences of two teens, April (Emma Roberts) and Teddy (Jack Kilmer). Photo by tribecafilm.com.\" width=\"800\" height=\"422\" \/><\/a> \"Palo Alto\" centers around the experiences of two teens, April (Emma Roberts) and Teddy (Jack Kilmer). Photo by RabbitBandini Productions.[\/caption]\r\n\r\nIt turns out the only thing that angers Palo Altans more than James Franco’s novel “Palo Alto: Stories” is Gia Coppola’s film adaptation of that book, \"Palo Alto.\"\r\n\r\nThe drama, based on a select few of the stories written by Franco in his novel, follows the confusing, angst-ridden life of high school students. April (Emma Roberts) is a quiet girl who plays on the school soccer team. While her parents may be negligent, her coach Mr. B. (James Franco) gives her more than enough attention, appropriate or otherwise. Meanwhile, Teddy (Jack Kilmer) and his dangerously rebellious friend Fred (Nat Wolff) are constantly getting into trouble just for the sake of it.\r\n\r\nIf the plot sounds bland, that’s because it is. Nothing happens in this film. Perhaps Coppola wanted to simply show section of the lives of these characters, but their problems and actions are so useless the story ends up being average. It’s hard to relate to characters when they do things for no specific reason and barely, or never, learn from their mistakes.\r\n\r\nThe general explanation of these characters’ actions is their ubiquitously bad parents, but that hardly explains most of what happens in the film. If one of the characters had that problem, and the problem was really focused on, it would be excusable, but that’s not the case. It’s a lazy writing technique, and inspires no love for the characters.\r\n\r\nActually, that would be a good way of describing most of the writing: lazy. Every character besides Teddy and April are archetypal and act without reason or intention. Seriously, how many times are we going to see a high school film with unexplainably malicious popular girls until it gets boring?\r\n\r\nTo continue the motif of laziness, the film is full of pseudo-deep shots and scenes. The meaning or point of them is implied, but is not actually there. An example: a minute-long shot of April looking out a window is not deep, it’s boring. There’s no content to shots like these; if a character is supposed to be thinking, there are better ways to show that then to let the audience guess.\r\n\r\nThe one redeeming part of the writing was some of the humor. Most of it consists of stupid, immature jokes, or silly tidbits of dialogue, but its accuracy to the way that high school students act made it amusing. Someone blurting a lame, uninspired insult about their friend’s sexuality isn't inherently funny – it’s funny because it’s just the kind of obnoxious thing a teenager would do. Once again the issue comes back to laziness, when jokes and gags are repeated.\r\n\r\nPerformance-wise, the film was acceptable. None of the actors ended up being more than decent because, as good as their performances were, their roles were so boring and melodramatic it gave them few opportunities to actually show their ability.\r\n\r\nThe film actually had some great moments of camerawork and editing. A lot of the cinematography felt fitting and interesting, especially the shots of suburban night life. The pacing of shots complimented the content of the scenes well. The film seemed to have a high-contrast filter, which really helped the mood. Colors were vibrant and pleasing to look at, which contrasted interestingly with the darker content.\r\n\r\nSome residents of real-life Palo Alto have criticized the film for portraying the town in an unfairly negative light, but in reality nothing in the movie is specific or even connected to the actual city. None of Palo Alto’s notable attributes, such as Facebook headquarters or the presence of Stanford, are more than slightly alluded to, and the settings in which the film takes place are clearly <i>not <\/i>Palo Alto (to a native Palo Altan, at least). The movie was actually filmed entirely in Southern California.\r\n\r\nSo, rather than specifically criticising the local culture in the manner of “Silicon Valley,\" “Palo Alto” is actually meant to serve as a portrait of teenage life anywhere in the country. Its name ends up being little more than a placeholder that could potentially be interchanged with any other town – Palo Alto just happened to be James Franco’s childhood home and therefore the nominal location of his stories. The supposed denigration of the town turns out to be a non-issue; the <a href=\"http:\/\/verdemagazine.com\/james-francos-palo-alto\">\"shadowy side of Palo Alto\"<\/a> is really just the negative aspects of teenage life everywhere.\r\n\r\nIn the end, the film offers a generally reasonable but oversimplified look at the adolescent experience. The issues and challenges faced by the movie’s characters are certainly real, but the one-dimensional characters greatly reduce its believability – and there are certain moments of dialogue which simply don’t feel real (not to mention the unrealistically high amount of cigarette smoking by the teens in the supposedly present-day setting of the movie). The film manages to touch on elements of what it is like to be a teenager, but its lack of significant plot or point ultimately prevents it from being more than a pessimistic, apathetic adaptation.\r\n\r\n&nbsp;\r\n\r\n<b>“Palo Alto”<\/b>\r\n\r\n<b>1 hour, 40 minutes<\/b>\r\n\r\n<b>Rated: R for strong sexual content, drug and alcohol use, pervasive language, smoking, all involving teens<\/b>\r\n\r\n<b>Directed by Gia Coppola<\/b>\r\n\r\n<b>Starring: James Franco, Emma Roberts, Jack Kilmer<\/b>\r\n\r\n<b>Based on the novel <\/b><b><i>Palo Alto <\/i><\/b><b>by James Franco<\/b>","excerpt":"It turns out the only thing that angers Palo Altans more than James Franco’s novel “Palo Alto” is Gia Coppola’s film adaptation of that book by the same name.","date":"2014-05-27 11:17:34","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/emma_jack_party.jpg","categories":["Entertainment","Reviews","Spotlight"],"tags":{"19415":"Emma Roberts","8706":"film","19414":"Gia Coppola","8801":"james franco","8899":"movie","19416":"Nat Wolff","8939":"palo alto","9045":"review"}}]