[{"id":73812,"title":"Custom Craze","permalink":"http:\/\/palyvoice.com\/2014\/09\/17\/custom-craze\/","content":"<p style=\"text-align: left;\"><em>The evolution of custom attire and its effects at Paly <\/em><\/p>\r\n\r\n\r\n[caption id=\"attachment_73813\" align=\"alignright\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png\"><img class=\"wp-image-73813 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png\" alt=\"Palo Alto High School students show off their custom clothing during Club Day.  “Wearing custom clothing makes your club or team look more legitimate and improves your overall swag,” junior James Wang said. Photos by Jeanette Wong.\" width=\"587\" height=\"589\" \/><\/a> Palo Alto High School students show off their custom clothing during Club Day. “Wearing custom clothing makes your club or team look more legitimate and improves your overall swag,” junior James Wang said. Photos by Jeanette Wong.[\/caption]\r\n\r\nWalking around the Palo Alto High School campus, one cannot help but notice the plethora of custom clothing sported by the students.\r\n\r\nFrom tie-dyeing T-shirts to designing clothing to <em>dye<\/em> for, as technology continues to advance, it has become easier than ever to make customized attire to promote and unify groups.\r\n\r\nSites such as DesignAShirt, Zazzle and CustomInk enable people to design and order products from virtually anywhere. The clothing is also relatively easy and fast to make.\r\n\r\nAccording to junior Anna Lu who designed the Paly Debate team attire, it takes around 20 minutes to create a design and around two weeks to ship.\r\nThe availability of the latest T-shirt making processes seems to attract students.\r\n\r\n“I think it’s more readily available and more people have noticed it and have gotten on that bandwagon of [making custom clothing for their teams]... over the last 16 years,” Paly receptionist Vallen Queen said.\r\n\r\nNew methods for creating attire has simplified the overall process.\r\n\r\n“I would say that because of computers, we’re now able to print [shirts] directly from the computers which means that it’s a lot easier and cheaper to print small quantities of T-shirts,” said Randy Samuels, owner of Big Frog Custom T-Shirts &amp; More of Mountain View. “In the past, most shirts were made with screen printing, which means you have to use films and... separate each color in your image. Every shirt needs to [be individually made] which means it can be more time-consuming.”\r\n\r\nAccording to Samuels, the invention of new technology streamlines the price and decreases the cost of the production of a single T-shirt. Additionally, the larger the quantity of the order, the cheaper the price will be, according to Samuels.\r\n\r\nThe advanced process of T-shirt making opens doors for more opportunities of creative expression.\r\n\r\n“When I was in high school the only clothes I ever made were crazy tie-dye shirts,” Paly librarian Rachel Kellerman said. “I thought the shirts [my son’s classmate made a few years ago] were very clever and creative. I like the fact that anyone with a design idea could sell a shirt.”\r\n\r\nWhether it may be sports teams such as volleyball, cross country and cheer, or Paly clubs like YCS-Interact, Speech and Debate and Robotics, communities at Paly are taking advantage of the tools offered by custom wear.\r\n\r\nAccording to junior Bethany Wong, custom clothing is an effective way for students to express their interests.\r\n\r\n“In the case of my cross country sweatshirt, [it has a] somewhat sassy phrase on the back,” Wong said. “I’ve struck up conversations while wearing it as I went around Palo Alto because people mention how they were also on cross country in high school or that they have heard of our school.”\r\n\r\nCustom clothing also brings a sense of unity to groups,according to Wong.\r\n\r\n“It [custom clothing] is an excellent way to exhibit team or club unity on campus,” Wong said. “There's also a certain coolness factor because each piece of custom clothing might be ‘limited edition’ and reminds you of the group of people in that club or sport.”\r\n\r\nCustom clothing, however, can also create separate groups of unified students according to math teacher Suzanne Antink.\r\n\r\n“Teen club T-shirts overall became a sort of ‘separating’ or divisive style among groups of students — a sort of labeling when none was needed,” Antink said. “However, as some clubs compete outside of school, like [for] Robotics, Debate, Scioly or Math, club members like to have a unifying team shirts.”\r\n\r\nThe Paly Voice asked a group of 25 sophomores, juniors and seniors at Paly and found that the students from this sample size had up to four pieces and spent up to $100 a year on custom wear.\r\n\r\nAs clubs and sports have started, students are excited to obtain their custom wear to represent the activities they participate in.\r\n\r\n“I’m going to order a Speech and Debate sweater this year,” senior Dan Su said. “I’m really excited to represent the team I love.”","excerpt":"From tie-dyeing T-shirts to designing clothing to dye for, as technology continues to advance, it has become easier than ever to make customized attire to promote and unify groups.","date":"2014-09-17 19:00:34","author":"Will Zhou","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-16-at-3.41.19-PM.png","categories":["Features","Spotlight"],"tags":{"28779":"big frog","8596":"clothes","11711":"club day","11337":"clubs","28776":"custom","28775":"custom ink","28780":"shirts","28781":"swag","28777":"t-shirt","28778":"tshirt"}},{"id":74012,"title":"Freshman class decides Spirit Week theme","permalink":"http:\/\/palyvoice.com\/2014\/09\/17\/freshman-class-decides-spirit-week-theme\/","content":"[caption id=\"attachment_74020\" align=\"alignleft\" width=\"630\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_01361.jpg\"><img class=\"wp-image-74020\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_01361.jpg\" alt=\"DSC_0136\" width=\"630\" height=\"418\" \/><\/a> Freshman Vice President Claire Billman and Student Activities Director Matt Hall hold up the Spirit Week schedule from two years ago to show the range of themes that previous grades have come up with. A meeting was held for the freshmen class to decide the official Spirit Week theme in the Student Activities Office during lunch today, with the official decision of\"The Lion King.\" Freshman can dress up as animals from The Lion King or other Disney characters as well. Photo by Adele Bloch.[\/caption]\r\n\r\n<span style=\"color: #000000;\">\"Hakuna Matata!\" That might as well be the motto of t<\/span>he Palo Alto High School Class of 2018 who chose \"The Lion King\" as its theme for Spirit Week this year.\r\n\r\nThe freshmen, who were required to base their theme off of the color orange, voted for The Lion King at lunch in the Student Activities Office today. Other potential choices included “Nickelodeon,” “Jersey Shore” and “Giants\" for Spirit Week 2014.\r\n\r\nSeventeen people were present at the meeting led by Claire Billman, Vice President of the freshmen class.\r\n\r\n\"I am incredibly excited for Spirit Week,\" Billman said. \"I have two older sisters and I've seen how much fun they've had during Spirit Week, so I'm excited to have just as much fun with my classmates.\"\r\n\r\nFreshmen can receive updates on Spirit Week float ideas, spirit dances and T-shirts by joining the Paly Class of 2018 <a title=\"Facebook group.\" href=\"http:\/\/goo.gl\/AAbiSi\" target=\"_blank\">Facebook group<\/a>.\r\n\r\nEvery grade's Spirit Week theme has now officially been established: \"Red Card\" for sophomores, \"Pirates\" for juniors and \"Green light\" for seniors.\r\n\r\n<span style=\"color: #000000;\">With only 37 more days till Spirit Week, each grade begins to organize its spirit dance, float idea, and shirt design.<\/span>\r\n\r\n&nbsp;","excerpt":"\"Hakuna Matata!\" That might as well be the motto of the Palo Alto High School Class of 2018 who chose \"The Lion King\" as its theme for Spirit Week this year.","date":"2014-09-17 17:25:20","author":"Adele Bloch","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/DSC_0172.jpg","categories":["News"],"tags":{"28799":"Claire Billman","8721":"freshmen","9119":"Spirit Week","28800":"theme"}},{"id":73783,"title":"Recap: Girls’ golf falls in close match with Gunn","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/recap-girls-golf-falls-in-close-match-with-gunn\/","content":"The Palo Alto High School girls’ golf team (1-1) narrowly lost to crosstown rival Gunn High School in its second league match by a score of 192-195 yesterday at the Palo Alto Municipal Golf Course.\n\nSenior team captain Michelle Xie finished the round with a score of 32, while sophomore Emily Hwang, freshman Stephanie Yu, sophomore Celia Willner and sophomore Candace Wang came in with scores of 36, 39, 43, and 45 respectively.\n\nAccording to Xie, the team performed well and was unlucky not to win.\n\n“One of the players on the Gunn team shot the lowest round of their life,” Xie said. “So that took us down a little bit.  All the Gunn girls players played really well.”\n\nOne of the bright spots in the loss was the performance of sophomore Candace Wang, who had to step in for a sick sophomore Elise Kiya.\n\n“At the time, we didn’t know how well the other girl was playing at Gunn,” coach Doyle Knight said. “But her score at the time could’ve helped us win.  We didn’t because the other girl played better, but Candace’s score, in her first true match, was big,”\n\nWang, described by Knight as an up-and-comer, spoke about her effort at the match.\n\n[caption id=\"attachment_73991\" align=\"alignright\" width=\"292\"]<img class=\"wp-image-73991\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_4268.jpg\" alt=\"\" width=\"292\" height=\"214\" \/> Girls' golf coach Doyle Knight recaps yesterday's game with some of the players. The golf team lost to the Gunn team by three strokes in a close match. Photo by George Lu.[\/caption]\n\n“Yesterday was really one of the days where I tried hard to keep up with my group,” Wang said.  “Each shot is independent from the next, so you try to do your best on every single shot.”\n\nDespite the loss, Knight expects more strong performances from the rest of the team.\n\n“Michelle’s not going to be here next time we play Gunn,” Knight said. “So I was really challenging the girls to step up, and I think they can.”\n\nThe Vikings will take on Saratoga in their next home game at 3:30 p.m. on Thursday at Santa Teresa Golf Club.","excerpt":"The Palo Alto High School girls’ golf team (1-1) narrowly lost to crosstown rival Gunn High School in its second league match by a score <a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/recap-girls-golf-falls-in-close-match-with-gunn\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-09-16 22:54:43","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/MG_4266.jpg","categories":["Golf","Sports"],"tags":{"28798":"candace wang","10012":"emily hwang","10175":"girls golf","8738":"Golf","8751":"gunn","14522":"gunn golf","10010":"michelle xie","14521":"paly golf"}},{"id":73720,"title":"Preview: Football home opener Friday vs. Mitty","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/preview-football-home-opener-friday-vs-mitty\/","content":"[caption id=\"attachment_73945\" align=\"alignleft\" width=\"621\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg\"><img class=\"wp-image-73945 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg\" alt=\"LRP_6414\" width=\"621\" height=\"412\" \/><\/a> Junior quarterback Oliver Svirsky rushes past the defense while playing at Paly's Viking stadium. Photo by Liana Pickrell.[\/caption]\r\n\r\nAfter starting the season off with a last-second victory followed by a blow-out loss, the Palo Alto High School football team (1-1, 0-0) returns home this Friday to take on an out-of-division powerhouse, the Archbishop Mitty Monarchs (0-1, 0-0).\r\n\r\nThe Vikings, led by first-year head coach Jake Halas, began their season on a high note, defeating the Sequoia High School Ravens (1-1, 0-0) 30-28 on Sept. 5 thanks to a game-winning field goal by junior kicker Jose Patino. Last Friday, the team took a step back, getting shut out by the San Benito High School Greyhounds (2-0, 0-0), 33-0.\r\n\r\nAccording to junior wide receiver Eli Givens, the team needs to play better on both offense and defense in order to beat Mitty.\r\n\r\n\"We just need to execute on offense and finish on plays,\" Givens said. \"The [offensive] line will be a huge help for this game and we need them every play blocking for our running backs. We've also been working on our defense, focusing a lot on what Mitty is going to run.\"\r\n\r\nHalas, whose defense gave up 33 points to San Benito, is confident that they will play a more efficient game against Mitty.\r\n\r\n\"We're going to get after Mitty,\" Halas said. \"We're going to bring pressure defensively speaking, and we're going to execute better. We did not execute against them [San Benito].\"\r\n\r\nThe Vikings and Monarchs kick off at 7:30 p.m. Friday night at Paly's Hod Ray Field.\r\n\r\n&nbsp;","excerpt":"After starting the season off with a last-second victory followed by a blow-out loss, the Palo Alto High School football team (1-1, 0-0) returns home this Friday to take on an out of division powerhouse, the Archbishop Mitty Monarchs (0-1, 0-0).","date":"2014-09-16 22:15:43","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/LRP_6414.jpg","categories":["Football","Sports"],"tags":{"9656":"eli givens","8714":"football","25424":"jake halas","28787":"jose patino","17730":"Mitty","9059":"San Benito","25428":"sequoia"}},{"id":73830,"title":"Slideshow: Club Day 2014","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/slideshow-club-day-2014-3\/","content":"The first semester Club Day for the 2014-15 year has come and gone, featuring many returning clubs along with some new ones. There was free food, music, dancing and even a teacher juggling a Chinese yo-yo. The complete list of clubs at Paly can be found <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/clubs\" target=\"_blank\">here<\/a>.\"\r\n\r\n[slideshow post_id=73830]","excerpt":"The first semester Club Day for the 2014-15 year has come and gone, featuring many returning clubs along with some new ones. There was free <a href=\"http:\/\/palyvoice.com\/2014\/09\/16\/slideshow-club-day-2014-3\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-09-16 21:56:34","author":"Christian Leong","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/dsc_01251.jpg","categories":["Multimedia","Slideshow"],"tags":{"8496":"ASB","28772":"club","11337":"clubs","9679":"day","28773":"monday"}},{"id":73711,"title":"District hires new Chief Technology Officer","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/district-hires-new-chief-technology-officer\/","content":"A former school district technology expert will start work as chief technology officer for the Palo Alto Unified School District later this week.\r\n\r\nDerek Moore from San Jose Unified School District is replacing Ann Dunkin, who now works for the Environmental Protection Agency.\r\n\r\nAccording to Moore, one of the main attractions to working at PAUSD is that the district is often at the forefront of technology and has seemingly unlimited resources. “Palo Alto schools are always ahead of the game [in technology],” he said.\r\n\r\nAccording to Superintendent Max McGee, with the addition of new buildings throughout PAUSD, there are many ways to technologically improve the district's learning environment.\r\n\r\n“Mr. Moore joins our district at a critical time where technology touches nearly all aspects of the teaching and learning experience,” McGee said in a <a href=\"http:\/\/news.pausd.org\/post.cfm\/district-announces-new-chief-technology-officer\" target=\"_blank\">press release<\/a>.\r\n\r\nFor Paly students, Moore's success will be judged on his effectiveness in resolving ongoing problems like access to Wi-Fi. Many Paly students have difficulty with Wi-Fi, especially with the new buildings. “We tried to do an online assignment in [Advanced Placement] Psych on our phones, but none of them would connect to the Wi-Fi,” senior Cameron Aishin said.\r\n\r\n“Wi-Fi has got to be available,” Moore said. “There will always be some small things you’ll have to adjust.”","excerpt":"Ex-San Jose Unified School District Director of Technology Services Derek Moore will start work as Chief Technology Officer for the Palo Alto Unified School District.","date":"2014-09-16 14:36:09","author":"Alex Merkle","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/unnamed.jpg","categories":["News"],"tags":{"28583":"chief technology officer","28582":"derek moore","25038":"McGee","8912":"new","8977":"PAUSD"}},{"id":73696,"title":"Water polo girls focus on team unity","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/water-polo-girls-focus-on-team-unity\/","content":"The Palo Alto High School girls' water polo team hopes to improve from last year after failing to qualify for Central Coast Sectionals last year.\r\n\r\nThe Vikings only graduated two seniors last year, so they are hoping that they will be stronger over all. Seniors Olivia Scola, Tess Van Hulsen and Maddie Kinnaman will lead the team this year.\r\n\r\nThe girls will need to improve in some aspects of the game to have a more successful season than last year.\r\n\r\n“The big thing [to improve on] will be team unity, team play and making sure we continue to build on the team concept,” head coach Aileen Delaney said. “They need to build their confidence in their shooting and defense as those are two key things, especially the defense.”\r\n\r\nAccording to junior Katie Francis, even if Delaney is focusing on team unity she “is very dedicated to [helping] each individual improve in any way she can.”\r\n\r\nThe Vikings want to be successful this season. However, the success of the season will not only be based on their win and loss record.\r\n\r\n“Our hopes are to have a successful season,” Aileen said. “A season is not defined just by wins but by the unity we show as a team throughout the year though we do have the goal of reaching CCS.”\r\n\r\nThe team will face Homestead High School at 6:45 p.m. Sept. 16 at Homestead. For their first home game, the Vikings will play Los Gatos at 3:30 p.m. Sept. 18.","excerpt":"The Palo Alto High School girls' water polo team hopes to improve from last year after failing to qualify for Central Coast Sectionals last year.","date":"2014-09-16 14:16:22","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/pool.jpg","categories":["Sports"],"tags":[]},{"id":73716,"title":"Junior goes undefeated in debate tournament","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/junior-goes-undefeated-in-debate-tournament\/","content":"<div class=\"_5wd4 _1nc7 direction_ltr _5yt9\" style=\"color: #141823;\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136\">\r\n<div class=\"_5wd9\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0\">\r\n<div class=\"_5wde\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0\">\r\n<div class=\"_5wdf _5w1r\" style=\"color: #3e454c;\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0.0\">\r\n<div data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:0.0.0.0\">\r\n\r\n[caption id=\"attachment_73722\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n.jpg\"><img class=\"wp-image-73722\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n.jpg\" alt=\"Palo Alto High School junior Anna Lu (center) won the Saint Francis High School debate tournament this weekend. Lu and the second and third speakers received medical kits for trophies as a play on their debate topic of organ procurement. “What was really interesting about the tournament was that they didn't give us trophies for speaker awards, but gave us medical kits instead since the topic was about organ procurement,” Lu said. Photo courtesy of Anna Lu.\" width=\"300\" height=\"300\" \/><\/a> Palo Alto High School junior Anna Lu (center) won the Saint Francis High School debate tournament this weekend. Lu and the second and third speakers received medical kits for trophies as a play on their debate topic of organ procurement. “What was really interesting about the tournament was that they didn't give us trophies for speaker awards, but gave us medical kits instead since the topic was about organ procurement,” Lu said. Photo by Sakthi Swamy.[\/caption]\r\n\r\nA Palo Alto High School junior is celebrating the start of the debate season after going undefeated at the Saint Francis High School debate tournament this weekend, going 6-0 through the preliminary rounds and 3-0 in the final round.\r\n\r\nJunior Anna Lu came in first overall, and juniors Anna Nakai and Gabi Rossner made it to the quarterfinals.\r\n\r\nAccording to Lu, Paly has a history of success at the St. Francis tournament. Senior Noah Hashmi made it to the final rounds last year and current debate coach Alex Carter of the Class of 2012 won it his junior year.\r\n\r\n“I definitely could not have won without the help of our coach Matt DeLateur,” Lu said.  “He helped me a lot in adapting to parent judges and making my arguments sound more persuasive, so I'm really grateful to be able to work with him as well as all of the other phenomenal coaches on our team.”\r\n\r\nThe topic of the debate was organ procurement from the deceased.\r\n\r\n“We debated about whether or not the government and society should assume that individuals want to donate their organs after they die,” Lu said.\r\n\r\nLu was sick for most of the tournament and had to sleep in between rounds. Despite this, she was the only competitor to go undefeated.\r\n\r\n“When I saw that my name was first on the list and that I was the only undefeated debater, I honestly could not believe that it was true,” Lu said. “That was by far my favorite moment during the tournament.”\r\n\r\nThis was the first major tournament of the debate season and Lu’s second major victory, having gone undefeated at the Catholic Forensics League 3 tournament last year.\r\n\r\n\"I think my biggest takeaway from this tournament is an increased confidence in my debating ability,\" Lu said. \"I was definitely an underdog sophomore year, as most sophomores are, so now I feel like I have to ability to compete against the best of the best.\"\r\n\r\n&nbsp;\r\n<div class=\"_3ry4\" data-reactid=\".1y.$mid=11410757608069=2614843293c0c8ea136.2:1\">\r\n\r\n\r\n\r\n\r\n","excerpt":"A Palo Alto High School junior went undefeated at the Saint Francis High School debate tournament this weekend, going 6-0 through the preliminary rounds and 3-0 in the final round.\r\n","date":"2014-09-16 14:05:03","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/10346523_846914058672168_8296186943263715459_n-22.jpg","categories":["News","Spotlight"],"tags":{"28579":"alex carter","28577":"anna lu","28580":"anna nakai","8638":"debate","28581":"gabi rossner","10542":"paly debate","28578":"st francis debate tournament"}},{"id":73610,"title":"Call-in show with Supt. to air next month","permalink":"http:\/\/palyvoice.com\/2014\/09\/16\/call-in-show-with-supt-to-air-next-month\/","content":"The Palo Alto Unified School District will host a live call-in TV broadcast featuring Supt. Max McGee at 6:30 p.m. on Oct. 8. The show will be available on <span style=\"color: #000000;\">AT&amp;T Channel 99, Comcast Channel 28 and<\/span> Mid Peninsula Media Center's Watch Now page.\r\n\r\nThe district hopes to improve communication and transparency with the community through the show \"A Conversation with PAUSD Superintendent Dr. Max McGee,\" according to PAUSD Communications Coordinator Tabitha Kappeler-Hurley.\r\n\r\n\"It's all a part of a goal to communicate more with the community about all the great things that's happening in schools, and obviously making ourselves available,\" Kappeler-Hurley said. \"Hearing from the parents and community directly through a live call-in show allows people to ask their own questions or voice any concerns.\"\r\n\r\nMcGee hopes the broadcast will encourage the community to ask hard-hitting questions.\r\n\r\n\"[The purpose of the broadcast is] to really be able to answer what's on people's minds,\" McGee said. \"I think a lot of times, people keep tough questions to themselves, or they make assumptions. Well, here's a chance to check out your assumptions about the district.\"\r\n\r\nThe show is open to any type of question regarding the district from anyone in the community, according to Kappeler-Hurley.\r\n\r\n\"Anyone can call in and ask any questions that is on their mind,\" Kappeler-Hurley said. \"It could be around curriculum, funding, bonds or anything of that nature. If they have a question for Dr. McGee that is something of broad interest, I would encourage someone to call in and ask.\"\r\n\r\nQuestions can be submitted via <a href=\"mailto:thurley@pausd.org\">email to Kappeler-Hurley<\/a> until Oct. 1. Call-in questions will be accepted during the show, however the phone number is yet to be released.\r\n\r\nAs this is the first call-in broadcast, Kappeler-Hurley is curious to see the turnout, which she will take into account for future methods of communication.\r\n\r\n\"I'm going to kind of test this the first time and see how the community reacts to this or enjoys this format,\" Kappeler-Hurley said. \"I'm hoping we can do two or three [live call-in shows] this year. But Dr. McGee is also open to doing things in a variety of ways, maybe community forums, tv shows or using video.\"\r\n\r\nMcGee looks forward to answering any questions or concerns as the star of the show.\r\n\r\n\"I am hoping to get to answer some really tough questions,\" McGee said. \"But overall, I am looking forward to some lively interaction.\"","excerpt":"The Palo Alto Unified School District will host a live call-in TV show featuring Supt. Max McGee at 6:30 p.m. on Oct. 8. ","date":"2014-09-16 13:38:22","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/Screen-Shot-2014-09-15-at-2.36.11-PM.png","categories":["News"],"tags":{"27729":"ask","27724":"broadcast","27722":"call in","27728":"communication","8611":"Community","27721":"lifestream","27175":"live","25038":"McGee","27726":"mid pen","27725":"mid peninsula media center","8977":"PAUSD","27727":"questions","11606":"superintendent","27723":"tv"}},{"id":73705,"title":"Paly junior wins St. Francis Debate Tournament","permalink":"http:\/\/palyvoice.com\/2014\/09\/14\/paly-junior-wins-st-francis-debate-tournament\/","content":"","excerpt":"","date":"2014-09-14 22:45:01","author":"Emma Chiu","categories":["Uncategorized"],"tags":[]}]