[{"id":75969,"title":"Opinion: Care about the PSAT","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/opinion-care-about-the-psat\/","content":"This time of the year, all juniors are faced with the eternal question: to study for the Preliminary SAT\/National Merit Scholarship Qualifying Test® or not to study.\r\n\r\nBut what is the <a href=\"https:\/\/www.collegeboard.org\/psat-nmsqt\" target=\"_blank\">PSAT\/NMSQT<\/a>? And why does it matter?\r\n\r\nBack when we were juniors, we also had these questions. The PSAT\/NMSQT is a national test that students across the nation take, typically during their junior year. After you take the test, you receive your results, and if you score in or above the 96th percentile you could be recognized as a semifinalist at the beginning of your senior year, after which you have to submit your scores from the SAT and an essay in order to find out if you are a National Merit Scholar. This year, juniors at Palo Alto High School will be taking the PSAT on Wednesday as a part of College and Career Awareness Day.\r\n\r\nSo, what should you do about the PSAT?\r\n<ol>\r\n\t<li>The PSAT is linked to <a href=\"http:\/\/www.nationalmerit.org\/\" target=\"_blank\">National Merit Scholarships<\/a> (as the name implies), which means if you become a finalist, you could win scholarship money.<\/li>\r\n\t<li>National Merit looks good. It’s an opportunity to pad your college app with a national award. Colleges love having National Merit Scholars. Becoming a finalist means getting scholarships from <a href=\"http:\/\/www.nationalmerit.org\/Merit_Sponsor_Leaflet.pdf\" target=\"_blank\">schools like Washington University in St. Louis and Tufts University<\/a>, and even being a semi-finalist looks good.<\/li>\r\n\t<li>People who have already taken the SAT have a huge headstart.  If you are one of those people, don’t sweat it. If you aren’t, keep reading.<\/li>\r\n\t<li>You don’t have to go overboard if you want to get a good score. In Advisory, you should have received a practice PSAT packet. Do that. To be honest, over-practicing can get you too hyped up, and stressing can cause a lot of people to under-perform. Three practice PSATs are plenty.<\/li>\r\n\t<li>If you’re like the majority of Paly students who haven’t gotten started with SAT prep, the PSAT is a perfect benchmark. If you don’t care about National Merit, just go into it without studying. It can give you a good idea of the areas you’re going to need to focus on when it comes to the actual SAT. Don’t be the kid who starts studying for the SAT the week before and expects a 2400.<\/li>\r\n\t<li>If you don’t like your score, don’t worry! The PSAT is just a preliminary score. Plenty of people we know got scores they didn’t like, and ended up scoring 200 points higher on the real thing. By using the right materials (e.g. <a href=\"http:\/\/www.amazon.com\/Official-Study-Guide-Second-Edition\/dp\/0874478529\" target=\"_blank\">THE OFFICIAL BIG BLUE BOOK<\/a> and free prep questions on <a href=\"https:\/\/connection.naviance.com\/family-connection\/auth\/login\/?hsid=pahs\" target=\"_blank\">Naviance<\/a>) or by getting the right test prep (AJ tutoring anyone?), you can greatly improve your score. Remember, the SAT is not for everyone. Plenty of people don’t do well on the SAT but get a great ACT score. When results come in, compare your PSAT score to your PLAN score from sophomore year and figure out which test you want to take.<\/li>\r\n\t<li>STUDY, BUT DON’T STRESS. If you don’t get National Merit, you don’t get National Merit. Remember that only the top, top percentage of students in the nation will get it. Some top schools like Princeton and Stanford don't even care if you got National Merit or not, as long as you do well on the actual test<\/li>\r\n\t<li>If you do get National Merit, when you’re a senior, you can feel special when you get a call slip that isn’t for detention or being a hooligan.<\/li>\r\n<\/ol>\r\nGood luck you crazy kids!","excerpt":"Confused and concerned about the relevance of the upcoming PSAT? Here are some helpful tips.","date":"2014-10-13 19:19:26","author":"Wesley Woo","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/sat-image.jpg","categories":["Opinion"],"tags":{"29937":"helpful","29217":"psat","29938":"psat\/nmsqt","29935":"sat","29936":"studying","14866":"tips"}},{"id":75671,"title":"Guide to School Board candidates","permalink":"http:\/\/palyvoice.com\/2014\/10\/13\/guide-to-school-board-candidates\/","content":"Click <a href=\"http:\/\/www.scrollkit.com\/s\/KGBaPkj\">here<\/a> to see the original interactive article.\r\n\r\nAs Election Day on Nov. 4 approaches, five candidates will compete for two seats on the Board of Education for the Palo Alto Unified School District. The two elected members will replace current board members Barb Mitchell and Dana Tom, and will serve on the School Board for the next four years.\r\nThe newly-elected members will join the board as it faces multiple issues concerning the community. One of these issues involves the U.S. Department of Education's Office for Civil Rights cases regarding a mishandled bullying incident, where opinions differ among candidates on necessary actions. Another issue is the increasing number of students in the district, which faces the need for a 13th elementary school and even possibly a fourth middle school, however candidates unanimously agree on the need.\r\nMost importantly, the newly-elected members must focus on the emotional well-being of students in a competitive environment and the need to improve transparency to ensure that the community is well-informed and cooperative.\r\n\r\nScroll down below for a brief profile of each candidate.\r\n\r\n&nbsp;\r\n\r\n<strong>Catherine Crystal Foster<\/strong> — Founder and Principal at Policy &amp; Advocacy Consulting, 48\r\n\r\nFoster believes in instituting good teachers, implementing world language as core subjects at a younger age, enhancing students' writing skills and opening new schools. She expresses the necessity to shrink the achievement gap through concrete goals and allowing for students to reach their highest potential without increasing pressure from the community. Contrary to other candidates, Foster believes citizens should not blame the current School Board for the controversy involving the Office of Civil Rights without knowing the complete details, but still agrees with other candidates that the School Board should not spend precious resources on the case.\r\n\r\n<b style=\"color: #111111;\">Boldest Idea: <\/b><span style=\"color: #111111;\">Evaluating specific issues to ensure the best actions and goals the district can achieve\r\n<\/span><b>Endorsers you've heard of: <\/b>U.S. Congresswoman Anna Eshoo, State Senator Jerry Hill\r\n<b>Campaign Finance: <\/b>$29,039\r\n<b>Education: <\/b>B.A. in History, Yale University\r\nJ.D., Harvard Law School\r\n<b>Family: <\/b>Husband Jon and two children attending Paly and Nueva Middle School\r\n<b>Community Involvement: <\/b>Former Site Council member of Duveneck Elementary School\r\nFormer PTA Council Liaison\r\nFormer board member of Palo Alto Partners in Education (PiE)\r\nBoard member of Palo Alto Community Fund\r\n\r\n&nbsp;\r\n\r\n<strong>Gina Dalma <\/strong>— Executive Director at Community LIFE Network, 34\r\n\r\nDalma is focused on creating a collaborative, connected and creative educational program in schools in order for students to not just adapt to the changing 21st century, but to thrive in it. She believes that the PAUSD should be pushing the boundaries in order to curb complacency and satisfaction of being a high-achieving district, including focusing on closing the achievement gap. Dalma has spoken out against laning because she believes it sets students on seemingly unbreakable paths.\r\n\r\n<b style=\"color: #111111;\">Boldest Idea: <\/b><span style=\"color: #111111;\">Collaborating with Stanford University to promote innovative education\r\n<\/span><b>Endorsers you've heard of: <\/b>Esther Wojcicki, Former State Senator Becky Morgan\r\n<b style=\"color: #111111;\">Campaign Finance: <\/b><span style=\"color: #111111;\">$22,688\r\n<\/span><b>Education: <\/b>B.A. in Economics, Instituto Tecnológico Autónomo de Mexico in Mexico City\r\nM.Sc. in Economics, University of London\r\nM.A. in International Policy, Stanford University\r\n<b>Family: <\/b>Husband Gabriel and two children attending Paly and JLS\r\n<b>Community Involvement: <\/b>Former Site Council member of Ohlone Elementary School\r\nVolunteer for Strong School's Bond\r\nParticipated in Paly's WASC Process\r\n\r\n&nbsp;\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n<div style=\"color: #111111;\">\r\n\r\n<strong><strong>Jay Blas Jacob Cabrera <\/strong><\/strong>— Executive Director at Community LIFE Network, 34\r\n\r\nCabrera mainly focuses on projecting his ideas to the public through the election, rather than running to win a seat on the School Board. He has unsuccessfully run for public office multiple times, including running for mayor of San Francisco. With no campaign committee, his volunteer-based campaign focuses on empowering the community through full interactivity by using online and direct voting systems in real time, so that everyone, including students, can participate in board decisions.\r\n\r\n<strong>Boldest Idea:<\/strong> Teaching coding as a basic skill in every school\r\n<strong>Endorsers you've heard of:<\/strong> He does not have any\r\n<strong>Campaign Finance:<\/strong> N\/A — No campaign committee\r\n<strong>Education:<\/strong> B.A. in Environmental Science and Biology, UC Santa Cruz\r\n<strong>Family:<\/strong> Lives with parents, who are both Stanford University professors\r\n<strong>Community Involvement:<\/strong> Alumnus of Henry M. Gunn High School\r\n\r\n&nbsp;\r\n\r\n<strong>Ken Dauber <\/strong>— Software Engineer at Google, 52\r\n\r\nDauber's vision includes ensuring social and emotional well-being of students, opening new schools, expanding foreign language and computer instruction, strengthening cooperation with special needs families and increasing the School Board's transparency. He strives to specify these goals rather than have vague objectives. Dauber has been committed to attending every School Board meeting for the past few years and ran for School Board in the last election in 2012.\r\n\r\n<b>Boldest Idea: <\/b>Fully implementing policy that monitors the quantity and quality of homework\r\n<b>Endorsers you've heard of: <\/b>Palo Alto Weekly, Esther Wojcicki, Former Mayor of Palo Alto Betsy Betchel\r\n<b>Campaign Finance: <\/b>$29,580\r\n<b>Education: <\/b>B.A. in Sociology, Yale University\r\nM.A. in Sociology, Yale University\r\nPh.D. in Sociology, University of Arizona\r\n<b>Family: <\/b>Wife Michele and four children\r\n<b>Community Involvement: <\/b>Barron Park PTA\r\nFormer Committee Chairman of Cub Scouts Pack 52\r\nGirl Scouts Daisy Leader\r\n\r\n<strong>Terry Godfrey<\/strong> — Financial Director at New Americans Campaign, 50\r\n<p style=\"text-align: left;\"><span style=\"color: #111111;\">Godfrey<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">believes<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">in<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">providing<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">the<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">best<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">teachers<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">and<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">staff<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">with<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">innovative<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">methods<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">and<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">technology<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">in<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">order<\/span><span style=\"color: #111111;\"> <\/span><span style=\"color: #111111;\">to facilitate each student's full potential. She expresses the need for an environment that puts students at the center of education, stating that the decisions made by the district should reflect community and youth voices, also advocating for more transparency to ensure a fair and continuously improving district.<\/span><\/p>\r\n<p style=\"text-align: left;\"><b style=\"color: #111111;\">Boldest Idea: <\/b><span style=\"color: #111111;\">Reimagining environment of middle schools to be inviting, kind and creative\r\n<\/span><b>Endorsers you've heard of: <\/b>Palo Alto Weekly, State Senator Jerry Hill, Palo Alto Educators Association\r\n<b>Campaign Finance: <\/b>$27,946\r\n<b>Education: <\/b>B.A. in Mathematics, UC Irvine\r\nMBA in Finance, UCLA\r\n<b>Family: <\/b>Husband Steve and two children, both attending Paly\r\n<b>Community Involvement: <\/b>Former President of Palo Alto PTA Council\r\nFormer President of PiE\r\nCity of Palo Alto Community Star Award, 2013<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Get to know the candidates for the School Board election coming up on Election Day on Nov 4.","date":"2014-10-13 18:28:15","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/USE-THIS-ONE.jpg","categories":["Features","Spotlight"],"tags":{"12701":"2014","29783":"4","29785":"4th","29781":"board","29796":"Cabrera","29798":"campaign","29782":"candidate","29802":"candidates","29790":"catherine","8601":"coffee","29791":"crystal","29794":"Dalma","29789":"dauber","9679":"day","8647":"district","8666":"election","29799":"finance","29792":"foster","29793":"Gina","29787":"godfrey","29801":"interactive","29795":"Jay","29788":"ken","29784":"nov","27711":"november","8939":"palo alto","8950":"Palo Alto Unified School District","8977":"PAUSD","9001":"poll","9068":"School","29786":"terry","29797":"timeline","9218":"vote","29800":"voter","9219":"voting"}},{"id":75633,"title":"Style Sunday: Laura Maystead","permalink":"http:\/\/palyvoice.com\/2014\/10\/12\/style-sunday-laura-maystead\/","content":"<p><i>Welcome to the first ever Style Sunday by Molly and Adele. We will highlight a Palo Alto High School style icon on Sundays to give you inspiration for your outfits of the week. Check back on Sundays for a weather inspired outfit from a fashionista near you.<\/i><\/p>\r\n<p>[caption id=\"attachment_75639\" align=\"alignleft\" width=\"144\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-05-at-10.02.16-AM.png\"><img class=\"wp-image-75639\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-05-at-10.02.16-AM.png\" alt=\"Screen Shot 2014-10-05 at 10.02.16 AM\" width=\"144\" height=\"352\" \/><\/a> Junior Laura Maystead poses in her outfit targeted for sunny weather. This upcoming week will have temperatures ranging from 70 to 90 degrees, and Laura recommends the following outfit for a comfortable and confident day.[\/caption]<\/p>\r\n<p>This upcoming week will have temperatures ranging from 70 to 90 degrees Fahrenheit. With another week of warm weather, we sat down with junior Laura Maystead to find out her fashion plans for the week.<\/p>\r\n<p>“I like to go on <a href=\"http:\/\/www.polyvore.com\/\">Polyvore<\/a>, and see what new outfits are trending,” Maystead said. “Typically it [my outfit] is whatever comes to mind.”<\/p>\r\n<p>With the upcoming warm weather, Maystead plans to dress simply but uniquely.<\/p>\r\n<p>“You can never go wrong with a graphic T-shirt,” Maystead said. “When paired with the right accessories, they look put together. This week I’d go with something simple like that. Pair it with a denim mini [jacket] or with a leather vest.”<\/p>\r\n<p>Maystead’s light wash denim vest was $10 from Forever 21, while the “Summer Rock” old band tee was free; however, one can typically get a similar shirt for around $10.<\/p>\r\n<p>[caption id=\"attachment_75641\" align=\"alignnone\" width=\"447\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9865.jpg\"><img class=\"wp-image-75641\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9865.jpg\" alt=\"IMG_9865\" width=\"447\" height=\"298\" \/><\/a> Maystead wears the navy blue skater skirt, which she got from a boutique for $40.[\/caption]<\/p>\r\n<p>The tee-vest combination is tucked into a navy blue skater skirt, which she got from a boutique for $40.<\/p>\r\n<p>“A flared skirt for something more quirky,” Maystead said.<\/p>\r\n<p>According to Maystead, warmer weather requires less effort in layering.<\/p>\r\n<p>“I love dresses,” Maystead said. “It’s like an outfit all in one, no planning.”<\/p>\r\n<p>[caption id=\"attachment_75643\" align=\"alignnone\" width=\"495\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9858.jpg\"><img class=\"wp-image-75643\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9858.jpg\" alt=\"IMG_9858\" width=\"495\" height=\"330\" \/><\/a> Maystead’s heeled booties ($30) are paired with gray socks ($8).[\/caption]<\/p>\r\n<p>Regarding shoes, Maystead is a big fan of boots.<\/p>\r\n<p>“I hate dressing for summer because I can’t wear boots.”<\/p>\r\n<p>Heeled booties are Maystead’s favorite and can be worn when the weather falls just short of the hot side. Maystead’s heeled booties are paired with gray socks that cost her $30 and $8, respectively.<\/p>\r\n<p>[caption id=\"attachment_75644\" align=\"alignnone\" width=\"423\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9849-3.jpg\"><img class=\"wp-image-75644\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9849-3.jpg\" alt=\"IMG_9849-3\" width=\"423\" height=\"282\" \/><\/a> Maystead wears a mix of bought, custom-made and hand-me-down jewelry.[\/caption]<\/p>\r\n<p>When it comes to jewelry, Maystead not only buys her own, but also wears hand-me-downs and custom-made pieces. Maystead layers jewelry to dress up any simple outfits for the week.<\/p>\r\n<p>“Simple pieces are easy to make and when you pair them with a lot of other necklaces it looks like you actually tried,” Maystead said.<\/p>\r\n<p>The slim ring can be bought for under $20, while the bracelet can be bought for $28 at <a href=\"http:\/\/www.alexandani.com\/\">Alex and Ani<\/a>.<\/p>\r\n<p>Maystead looks forward to fall fashion and layered outfits.<\/p>\r\n<p>“Scarves with dresses and big coats and boots and socks,” Maystead said. “I just love all those pieces, so that’s my favorite [season].”<\/p>\r\n","excerpt":"Check out Style Sunday, where a Paly fashion icon gives you inspiration for your outfits of the week.","date":"2014-10-12 18:00:21","author":"Molly Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9839.jpg","categories":["Blog","Spotlight"],"tags":{"29478":"blog","8697":"fashion","29735":"laura","29734":"laura maystead","9133":"style","29736":"style sunday","29737":"sunday"}},{"id":76001,"title":"Deadline to submit senior portrait to yearbook Oct. 15","permalink":"http:\/\/palyvoice.com\/2014\/10\/12\/deadline-to-submit-senior-portrait-to-yearbook-oct-15\/","content":"","excerpt":"","date":"2014-10-12 10:27:19","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8636":"deadline","8862":"Madrono","23891":"senior portrait","23892":"yearbook"}},{"id":75999,"title":"Parking permit lottery open for juniors until 4 p.m. on Oct. 16, forms in main office","permalink":"http:\/\/palyvoice.com\/2014\/10\/12\/parking-permit-lottery-open-for-juniors-until-4-p-m-on-oct-16-forms-in-main-office\/","content":"","excerpt":"","date":"2014-10-12 10:24:29","author":"Lizzie Chun","categories":["Ticker"],"tags":{"9760":"juniors","29940":"parking permits"}},{"id":75995,"title":"Viking mascot tryouts at 2:45 p.m. on Oct. 16 in the small gym","permalink":"http:\/\/palyvoice.com\/2014\/10\/11\/viking-mascot-tryouts-at-245-p-m-on-oct-16-in-the-small-gym\/","content":"","excerpt":"","date":"2014-10-11 15:31:24","author":"Lizzie Chun","categories":["Ticker"],"tags":{"29939":"mascot","9188":"tryouts"}},{"id":75441,"title":"The ultimate pearl milk tea challenge: The Castro Quadruplets","permalink":"http:\/\/palyvoice.com\/2014\/10\/11\/the-ultimate-pearl-milk-tea-challenge-the-castro-quadruplets\/","content":"Hello, I am Alex, and I have taken it upon myself to bring you the news and my opinions surrounding all the boba places in the Bay Area (and maybe even beyond). I am, personally, an avid fan of all boba drinks, having consumed over 80 of them since April.\r\n\r\nFirst things first, what is boba? Boba tea has many different names. Boba, PMT, pearl milk tea, bubble tea, tapioca milk tea or balls drink are all names that are frequently used for this beverage. Boba and PMT are the most commonly used, so I will be using that terminology for this blog.\r\n\r\nAccording to <a href=\"http:\/\/www.sfgate.com\/food\/article\/Bubble-tea-The-fad-that-forgot-to-fade-5751614.php\">SFgate<\/a>, there are currently 75 PMT shops in San Francisco, the East Bay and the Peninsula. For this first installment, I thought it would only be appropriate to review the most commonly visited places by Palo Alto High School students: the Castro Quadruplets. In downtown Mountain View, there are four stores that sell PMT, all within a three block radius: Verde Tea Cafe, Tapioca Express, Tea Era Cafe and Jazen.\r\n\r\n<b>Verde Tea Cafe<\/b>\r\n\r\n<em>Overall rating: <\/em>8.5\/10\r\n\r\n<em>Student opinion:<\/em>\r\n\r\n“I like their variety of drinks,\" freshman Leo Trejo said. \"They serve food as well, and the environment is comforting.”\r\n\r\n<em> What I ordered: <\/em>Coconut Pearl Milk Tea with extra pearls ($3.97)\r\n\r\n[caption id=\"attachment_75464\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_96032.jpg\"><img class=\"wp-image-75464\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_96032.jpg\" alt=\"The small size at Verde Tea Cafe is the larger size at most other PMT places. This is the only place that also features a &quot;tub&quot;. The pearls at Verde are also the largest to date.  \" width=\"300\" height=\"400\" \/><\/a> The small size at Verde Tea Cafe is the larger size at most other PMT places. This is the only place that also features a \"tub\". The pearls at Verde are also the largest to date. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\n<em>Features:<\/em>\r\n\r\nVerde is one of the most commonly visited PMT places by Paly students. There is always a line, but the servers are very efficient and get even large orders done quickly. The small size, 22 ounces, at Verde is the larger size at most other PMT places, so it is the best bargain. They are also the only place with a \"tub,\" which is the largest size, 32 ounces, PMT available nearby.\r\n\r\nOne of the reasons for this rating is because of the large variety of drinks Verde has available. Not only are there around 30 milk tea flavors, but freeze blends and smoothies are also available. Pearls, jelly or bricks can be added to any order or not included at all, if that suits you. The pearls are large and chewy.\r\n\r\nOne of the biggest issues I have with Verde is the inconsistency. Often, there is too much powder or too much sweetener, and other times, there is not enough, and it's like drinking a giant cup of milk. When Verde gets the proportions right, it's one of the best places available, but it can be risky.\r\n\r\nVerde also has meal options if the drink isn't filling enough for you, which range from chicken on a stick to cheesecake. Other upsides to Verde are its use of the super easy rewards system FIVESTARS and the availability of free WiFi.\r\n\r\n&nbsp;\r\n\r\n<b>Tapioca Express<\/b>\r\n\r\n<em>Overall rating: <\/em>5\/10\r\n\r\n<em>Student opinion:<\/em>\r\n\r\n“I love the assortment,\" sophomore Victor Carlsson said. \"There are so many flavors to choose from. I really like the service and rewards program.”\r\n\r\n<em>What I ordered: <\/em>Coconut Milk Tea with extra pearls ($3.70)\r\n\r\n[caption id=\"attachment_75466\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9606.jpg\"><img class=\"wp-image-75466\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9606.jpg\" alt=\"Tapioca Express has very soft pearls and has the largest variety of flavors available. The staff is very friendly and gives recommendations on the extensive menu. \" width=\"300\" height=\"400\" \/><\/a> Tapioca Express has very soft pearls and has the largest variety of flavors available. The staff is very friendly and gives recommendations on the extensive menu. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\n<em>Features:<\/em>\r\n\r\nThe staff at Tapioca Express is very friendly and patient. There are so many flavors – even to the point that it can almost be a little overwhelming. When looking at the menu, the cost of pearls is not already added into the price on the sign, so it can be difficult when budgeting.\r\n\r\nThe pearls are very large and soft, allowing them to easily get stuck in the straw, which makes it very difficult to drink. They are also overly sweet and difficult to chew. Additionally, the tea flavor is very pungent, almost to the point of bitterness.\r\n\r\nThere are meal options, but I have never seen anyone order any food whenever I go there, which is a little unsettling. The rewards system at Tapioca Express is a little complicated. Large drinks and small drinks are stamped separately, and you can only redeem a free drink of the same size as the 10 drinks you've already bought.\r\n\r\n&nbsp;\r\n\r\n<b>Jazen Tea <\/b><b>(Served at Pho Hoa)<\/b>\r\n\r\n<em>Overall rating:<\/em> 6\/10\r\n\r\n<em>Student opinion:<\/em>\r\n\r\n“It’s a fun place, and I like that they have both noodles and PMT available,\" senior Kelly Shi said. \"Their PMT is really good and their noodles have a really good flavor. I really like their pearls.\"\r\n\r\n<em>What I ordered: <\/em>Jasmine Pearl Milk Tea ($3.55)\r\n\r\n[caption id=\"attachment_75465\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9633.jpg\"><img class=\"wp-image-75465\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9633.jpg\" alt=\"The three flavors offered at Jazen are all quite sweet. Jazen is served at a Pho restaurant with a variety of other fruity beverages available. \" width=\"300\" height=\"400\" \/><\/a> The three flavors offered at Jazen are all quite sweet. Jazen is served at a Pho restaurant with a variety of other fruity beverages available. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\n<em>Features:<\/em>\r\n\r\nJazen is part of a larger restaurant that serves pho and has smoothies and fruit drinks. The PMT offered only comes in three different flavors: Jasmine, Original and Apple Jack.\r\n\r\nJazen is one of the few places that uses syrup as a flavoring, and it's very obvious. There is often a ribbon of syrup along the inside the cup, which can make the drink too sweet and causes the buyer to shake the drink around to attain a uniform sweetness.\r\n\r\nWhile Jazen specializes in adding fruit to the drinks, the pearls are still good: large and firm. The cups are larger and wider than at most PMT stores. They do not fit in the average cup holder or smaller hand.\r\n\r\nThe staff often waits for orders to build up before making them all, so it might take a while before the drinks are ready. Jazen uses a FIVESTARS  rewards system and also participates in various coupon sites.\r\n\r\n&nbsp;\r\n\r\n<b>Tea Era Cafe<\/b>\r\n\r\n<em>Overall rating:<\/em> 7\/10\r\n\r\n<em>Student opinion:<\/em>\r\n\r\n“The service is kind of bad,\" freshman Hollie Chiao said. \"Some drinks I ordered were kind of sandy. Their coconut is not up to my standards, which are pretty high. It’s too frothy.\"\r\n\r\n<em>What I ordered: <\/em>Large Jasmine Pearl Milk Tea with extra pearls ($4.08)\r\n\r\n<em>Features:<\/em>\r\n\r\n[caption id=\"attachment_75467\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9647.jpg\"><img class=\"wp-image-75467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9647.jpg\" alt=\"Tea Era Cafe is very authentic. Often the drinks have remnants of the powder flavor. The pearls are very small and firm and given generously. \" width=\"300\" height=\"400\" \/><\/a> Tea Era Cafe is very authentic. Often the drinks have remnants of the powder flavor. The pearls are very small and firm and given generously. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nTea Era is a very small restaurant that is covered in handmade signs of drinks and rewards cards. The menu is in Chinese and English and has some very unique flavors. Besides the usual honey, coconut and strawberry milk tea flavors, Tea Era has Genmai brown rice, barley and mulberry to name a few.\r\n\r\nThe pearls are small and firm, making it very easy to drink many at a time. The powder never dissolves all the way into the drink and ends up coating the inside of the cup and the straw. Sometimes, there may even be a clump of powder that requires vigorous shaking to break it up.\r\n\r\nEven though the tea might not be a very smooth texture, it does have lots of flavor and is rarely too sweet. The granule texture is a trademark of Tea Era that you quickly get used to and come to enjoy. I have gone many times and they have never messed up my order, which cannot be said of many other PMT places.\r\n\r\nThere can be a long line, and the service is not very fast for the large amount of staffers there. The rewards card is a stamp system. After buying 10 drinks, the next drink is free as long as there are no additions.","excerpt":"Each week, staff writer Alex Merkle-Raymond will take on the Pearl Milk Tea world, one cup at a time. Here are her reviews of the four most popular PMT places among Paly students. ","date":"2014-10-11 12:22:02","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_9842.jpg","categories":["Blog","The ultimate PMT challenge"],"tags":{"29706":"abc","29478":"blog","29703":"boba","29707":"bubble tea","29708":"jazen","29705":"pearl milk tea","29704":"pmt","29872":"tapex","29709":"tapioca express","29710":"tea era","29871":"ultimate pmpt challenge","9202":"verde"}},{"id":75054,"title":"Theatre program starts new ComedySportz team","permalink":"http:\/\/palyvoice.com\/2014\/10\/10\/theatre-program-starts-new-comedysportz-team\/","content":"[caption id=\"attachment_75291\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8527.jpg\"><img class=\"size-full wp-image-75291\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8527.jpg\" alt=\"Senior Will Kast plays with an air balloon during the improv troupe auditions.Photo by Emma Chiu\" width=\"600\" height=\"400\" \/><\/a> Senior Will Kast plays with an air balloon during the Improv Troupe auditions. Photo by Emma Chiu[\/caption]\r\n\r\nWho knew that the drama could be considered a sport?\r\n\r\nFor the first year ever, the Palo Alto High School Theatre Department will partake in competitive improvisation as part of its newly-created ComedySportz team, according to Paly Theatre instructor Kathleen Woods.\r\n\r\nComedySportz is a competitive improv comedy organization that exists at the high school, college and professional level .\r\n\r\n“The competitions actually have a referee, and one of the teams ends up winning the competition,” Woods said.\r\n\r\nBecause this is the Paly team’s first year, it will not compete regularly and instead participate in a total of two tournaments over the course of the entire school year, according to junior and two-year Improv Troupe member Zoe Limbrick.\r\n\r\n“It’s going to be two events on the weekend [per year], and it’s either going to be competitions … within the troupe or with other schools nearby,” Limbrick said. “We’re going to bring in professionals to teach us and work on our improv.”\r\n\r\nAccording to Woods, one of the competitions the team will likely partake in is a South Bay tournament in April.\r\n\r\nSenior Chris Hinstorff, a Voice staff member, created the team after meeting with an adult member from the <a title=\"San Jose ComedySportz\" href=\"http:\/\/comedysportzsanjose.com\/]\" target=\"_blank\">ComedySportz team in San Jose<\/a> at the Northern California Thespian Leadership Conference in September.\r\n\r\n“As part of his [Hinstorff’s] honors project as head of Paly’s Improv Troupe, he’s decided to take that additional step and have students train in ComedySportz,” Woods said.\r\n\r\n[caption id=\"attachment_75297\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8498.jpg\"><img class=\"size-full wp-image-75297\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_8498.jpg\" alt=\"Sophomore Jason Pollak, junior Paul Bleich and sophomore Joey Kellison-Linn enjoy comedy sports in the Haymarket theater. Photo by Emma Chiu.\" width=\"600\" height=\"400\" \/><\/a> Sophomore Jason Pollak, junior Paul Bleich and sophomore Joey Kellison-Linn enjoy ComedySportz in the Haymarket Theater. Photo by Emma Chiu.[\/caption]\r\n\r\nThe training that troupe members receive will help them practice for not only ComedySportz competitions, but for other theatre-related competitions as well, such as the California State Thespian Festival, which the Paly Theatre Department attends every year.\r\n\r\nAccording to Woods, the improv competition at the Thespian Festival has a slightly different format from the ComedySportz competitions.\r\n\r\n“It’s usually three different students from three different schools [who] have to make up a team,” Woods said. “Then, [they] all compete with other student groups from different schools.”\r\n\r\nLast year, all 18 students who went to the festival earned some sort of statewide recognition, according to Woods. This included first and second place in both categories of Lighting and Sound. In addition, two students won statewide scholarships.\r\n\r\n“That’s exceptional,” Woods said. “That’s really, really unusual for any one school to have that much.”\r\n\r\nWith talented resources in the department, Woods is looking forward to the year ahead with regards to ComedySportz.\r\n\r\n“Every ComedySportz event that I’ve attended … is just very clever and sharp and quick,\" Woods said. \"It’s just a lot of fun to watch as an audience member, and it’s really rewarding for the students participating in the improv. I’m really looking forward to the added element of having ComedySportz.”","excerpt":"For the first year ever, the Palo Alto High School Theatre Department will partake in competitive improvisation as part of its newly-created ComedySportz team.","date":"2014-10-10 13:30:11","author":"Samuel Desré","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_8527.jpg","categories":["Entertainment"],"tags":{"29694":"chris hinstorff","29692":"comedy sports","29691":"comedysportz","29693":"improv","29689":"kathleen woods","9159":"theater","9160":"theatre","29695":"thespian","29690":"zoe limbrick"}},{"id":75828,"title":"Highlights from Sen. Wyden&#8217;s roundtable discussion with tech leaders","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/highlights-from-sen-wydens-roundtable-discussion-with-leaders-of-technology\/","content":"<em>At a <a href=\"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/\" target=\"_blank\">Senate Finance Committee Chairman's roundtable<\/a> <i>held yesterday in the Palo Alto High School Big Gym<\/i>, United States Sen. Ron Wyden and five tech leaders examined how consumer and foreign government responses to U.S. mass surveillance programs are challenging U.S. innovation and global competitiveness. Following the slideshow are excerpts from each panel member's contribution to the discussion.<\/em>\r\n\r\n<span class=\"Apple-style-span\" style=\"color: #000000;\">[slideshow post_id=75828]<\/span>\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Senate Finance Committee Chairman Ron Wyden<\/span><\/strong>\r\n\r\n\"People from all over the country do not want America's political system to fritter away [all of the] hard-earned opportunities for foreign competitors [and] high wage industries. As chairman of the Senate Finance Committee, I'm here to tell you that I will not let that happen.\"\r\n\r\n\"Make no mistake, America's intelligence [agencies] are made up of thousands of overwhelmingly dedicated men and women who make enormous sacrifices to protect this nation. No one that I know in the senate or at this table wants to deprive our intelligence agencies of the tools that will actually make the world safer. But it's now clear that dragnet surveillance conflicts with core American values and doesn't make us safer.\r\n\r\n\"The government ought to stop requiring American companies to participate in this suspicion-less collection of customers data and begin the process of rebuilding trust at home.\"\r\n\r\n<b><span class=\"Apple-style-span\" style=\"color: #000000;\">Executive Vice President and General Counsel of Microsoft Brad Smith<\/span><\/b>\r\n\r\n\"Just as people would not put their money in a bank they don't trust, they will be reluctant to put their information in a data center or in a phone they don't trust.\"\r\n\r\n\"When trust is shattered, it needs to be rebuilt.\"\r\n\r\n\"[We need] to go back to the fundamental personal rights that are at stake. I think all of us stand for a straightforward proposition: If you're a consumer or a company, you own your email, your text messages, your photos and all the content that you create. Even when you put your content in our data centers or the devices that we make, you still own it. You are entitled to the legal protection under our Constitution and our laws, and we will not rebuild trust until our own government recognizes that straightforward principle.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Executive Chairman of Google Eric Schmidt<\/span><\/strong>\r\n\r\n\"We want to thank you [Sen. Wyden] for being a phenomenal champion for technology [and] for jobs. And I think, and we probably all think, that you are a true patriot.\"\r\n\r\n\"Thank goodness that you [Sen. Wyden] led the fight against bulk surveillance, but things are getting worse.\"\r\n\r\n\"I think the simplest outcome is that we're going to end up breaking the Internet. What's going to happen is the government will ... eventually say, 'We want our own Internet in our own country because we want it to work our way. We don't want the NSA and other people in it.' The cost of that is huge, in terms of knowledge, discovery, science, growth and jobs.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">General Counsel of Facebook Colin Stretch<\/span><\/strong>\r\n\r\n\"One of the biggest challenges we're confronting as an industry is the inability for most of the world's population to access the Internet. ... Eighty percent of the people without Internet access around the world are within range of a cell tower. The reason they do not have Internet access is because it costs too much. One of the big challenges for us as an industry is to bring technology to address that problem, to get the rest of the world. Data localization takes us in exactly the wrong direction, simply because it costs too much money.\"\r\n\r\n\"From our perspective, the most profoundly disturbing [disclosures] was ... hacking, the sort of things we do see from some other countries that are involved with state-sponsored espionage. That put the relationship between the industry and the U.S. government on a slightly different footing. ... What those disclosures [hacking] brought to light was there was this effort outside of what we all thought of as the appropriate legal process to attain user data. ... It placed renewed focus on our need to protect ourselves from these sorts of unauthorized overseas attacks.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">General Counsel of Dropbox Ramsey Homsany<\/span><\/strong>\r\n\r\n\"We need to be committed to providing good security and encryption for our users.\"\r\n\r\n\"Encryption is a critically important technology for everything we do and everything that happens on the Internet. Why would we start to hamper with it ... rather than wanting to develop great encryption and apply it so that consumers can have a lot of trust and faith in the fact that what they do store online is safe? There are many other ways for the government to get data when they're doing investigations ... which has been the legal norm for hundreds of years.\"\r\n\r\n<strong><span class=\"Apple-style-span\" style=\"color: #000000;\">Partner of Greylock Partners John Lilly<\/span><\/strong>\r\n\r\n\"Most people want to follow the law. Most people want to stay safe ... but [there's] this bifurcation of citizenry and law enforcement and government, and we're getting a drumbeat of that, and that's increasingly the society we do not want.\"\r\n\r\n&nbsp;","excerpt":"At a Senate Finance Committee Chairman's roundtable held yesterday in the Paly Big Gym, United States Sen. Ron Wyden and five tech leaders discussed the \"Impact of Mass Surveillance on the Digital Economy.\"","date":"2014-10-09 22:39:19","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_1585.jpg","categories":["Multimedia","Slideshow","Spotlight"],"tags":{"11286":"big gym","29857":"brad smith","29858":"colin stretch","29832":"digital economy","29826":"economy","29861":"eric schmidt","29860":"john lilly","29830":"mass surveillance","8944":"palo alto high school","29859":"ramsey homsany","29833":"roundtable","29855":"senate finance committee","29818":"senator","29854":"senator ron wyden","29829":"surveillance","29820":"Wyden"}},{"id":75806,"title":"Senator visits student journalists","permalink":"http:\/\/palyvoice.com\/2014\/10\/09\/senator-visits-student-journalists\/","content":"[caption id=\"attachment_75885\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_4196.jpg\"><img class=\"wp-image-75885\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/MG_4196.jpg\" alt=\"Senator Ron Wyden addresses relevant political issues for high school students including college affordability, the future of tech industry and climate change. Ron Wyden spoke preceding his roundtable discussion with tech leaders on 'Impact of Mass Surveillance in our Digital Economy'. Photo by Takaaki Sagawa\" width=\"600\" height=\"400\" \/><\/a> Sen. Ron Wyden addresses relevant political issues for high school students, including college affordability, the future of tech industry and climate change. Wyden spoke yesterday morning at the Media Arts Center, preceding his roundtable discussion with tech leaders on the 'Impact of Mass Surveillance in our Digital Economy'. Photo by Aisha Chabane.[\/caption]\r\n\r\nUnited States Senator and Palo Alto High School alumnus Ron Wyden (D-Oregon) informed Paly student journalists of the current political issues and its relevance as well as his memories from Paly.\r\n\r\nThe senator addressed the main topic of mass surveillance at 10 a.m. yesterday in the MAC, later to be discussed in the <a href=\"http:\/\/palyvoice.com\/2014\/10\/07\/sen-ron-wyden-paly-alumnus-to-hold-hearing-on-campus\/\">roundtable discussion<\/a> with tech leaders.\r\n\r\n\"There's been a tremendous amount of discussion about digital surveillance related to privacy, national security and those issues,\" Wyden said. \"But there has been virtually no discussion on digital surveillance as to what it's doing to cutting-edge companies.\"\r\n\r\nWyden elaborated on the topic, providing relevance from a perspective for the future generation.\r\n\r\n\"I think your generation understands the potential of digital goods and digital services for both the economy and quality of life and what it's meant to your generation,\" Wyden said. \"And the thing is, the technology jobs pay good wages when arguably the premier economic issue of our time is wage growth.\"\r\n\r\nThe reason for the selection of Paly's Big Gym as the venue for the discussion became evident as Wyden recounted his favorite memories from Paly.\r\n\r\n\"A special Paly memory was this basketball game in the winter of 1967 when the gym had to be locked because there were so many people,\" Wyden said. \"The sidelines were three or four people deep, and Paly beat Sequoia [High School]. ... But I remember so many wonderful memories. I guess Peninsula Creamery is still around – my favorite place. ... I was also voted most fun to be with in the Madrono.\"\r\n\r\nClick on a topic of the conference below to listen to the recordings from the conference.\r\n\r\n[soundcloud url=\"https:\/\/api.soundcloud.com\/playlists\/54305704\" params=\"auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\" width=\"100%\" height=\"450\" iframe=\"true\" \/]","excerpt":"Sen. Ron Wyden spoke with student journalists yesterday to talk about his story at Paly as well as current political issues facing America.","date":"2014-10-09 21:40:26","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/photo.PNG.jpeg","categories":["News"],"tags":{"29838":"alumnus","10098":"basketball","14850":"climate","29840":"DC","29827":"Democrat","29842":"domestic","29843":"economic","8727":"gay","29836":"journalists","29841":"laws","18366":"mac","29835":"press conference","27727":"questions","29844":"rights","29819":"Ron Wyden","29818":"senator","29837":"story","9129":"student","29839":"Washington"}}]