[{"id":70666,"title":"Science Olympiad places second at state competition","permalink":"http:\/\/palyvoice.com\/2014\/04\/17\/science-olympiad-places-second-at-state-competition\/","content":"[caption id=\"attachment_70694\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/10269736_10202813653197451_1883630144_o.jpg\"><img class=\"wp-image-70694\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/10269736_10202813653197451_1883630144_o.jpg\" alt=\"Science Olympiad team captains, senior Annie Chen, junior Ken Chen and senior Grace Lin, pose with the hardware they earned at the regional competition in March. The team earned second place in the Northern California State Championship Saturday. Photo courtesy of Yingjian Chen. \" width=\"600\" height=\"401\" \/><\/a> Science Olympiad team captains, senior Annie Chen, junior Ken Chen and senior Grace Lin, pose with the hardware they earned at the regional competition in March. The team earned second place in the Northern California State Championship Saturday. Photo courtesy of Yingjian Chen.[\/caption]\r\n\r\nAfter earning a spot in the state competition with a <a href=\"http:\/\/palyvoice.com\/2014\/03\/27\/science-olympiad-wins-regional-competition-heads-to-states\/\">regional win in March<\/a>, the Palo Alto High School Science Olympiad team capped off its season Saturday, placing second out of 24 teams, in the Northern California Science Olympiad.\r\n\r\nWhile the team had its sights set on repeating last year's success by winning and moving on to the national competition, senior captain Grace Lin was proud of her team's work and expects her teammates to build on this season's success next year.\r\n\r\n\"Although we hoped to win, I am very proud of how we performed this year,\" Lin said. \"We have a young team [with only four seniors on a competition team of 15], so the experience of competing at the States level will be an advantage to all of our returning members next year.\"\r\n\r\nJunior Max Krawczyk agreed that the team's youth was an asset to both this year's success and future accomplishments.\r\n\r\n\"I think the tournament was a success in a bunch of ways,\" Krawczyk said. \"We got to train a lot of new members that we added this year and we've improved over all from last year. We've definitely grown a lot.\"\r\n\r\nPaly competed impressively against the 24 other teams in attendance, placing in the top five in 17 of 23 distinct events. The team performed particularly well in the areas of chemistry, physics and biology, according to Lin.\r\n\r\n\"We won in Materials Science [a chemistry\/physics lab event], Technical Problem Solving [a chemistry\/physics lab event], Entomology [biological identification event], and Anatomy and Physiology [a biological study event],\" Lin said. \"One of the most satisfying moments was our Mission Possible, a really difficult [and] fickle Rube Goldberg device, placing second after many hours of perfecting all of the energy transitions.\"\r\n\r\nEven though Paly performed very well to earn its second-place finish, Lin says the team is ready for a rematch with rival Mira Loma High School, which took first place. Before the 2013 competition which the Vikings won, the Mira Loma Matadors had immense success, winning the state championship in each of their previous eight seasons.\r\n\r\n[caption id=\"attachment_70697\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/10167963_10202794237192063_1114331910087502015_n.jpg\"><img class=\"wp-image-70697\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/10167963_10202794237192063_1114331910087502015_n.jpg\" alt=\"Seniors Annie Chen and Grace Lin pose with sophomores Sylvia Targ and Ivy Li before driving to Prom in San Francisco straight from the Northern California Science Olympiad competition in Turlock. Photo courtesy of Nick Quach.\" width=\"300\" height=\"400\" \/><\/a> Seniors Annie Chen and Grace Lin pose with sophomores Sylvia Targ and Ivy Li before driving to Prom in San Francisco straight from the Northern California Science Olympiad competition in Turlock. Photo courtesy of Nick Quach.[\/caption]\r\n\r\n\"Although they [the Matadors] have got another win on their record this year, we're not planning to let them continue that streak for nearly as long as eight years,\" Lin said.\r\n\r\nFor some of the teammates, Saturday's competition only marked the first half of that day's celebrations: many of the second-place finishers went straight from California State University at Stanislaus, where the competition was held, to Paly's Prom at the Exploratorium in San Francisco.\r\n\r\n\"Having States and Prom on the same day definitely added to the excitement of Prom and will no doubt be a States and a Prom we'll never forget,\" Lin said.\r\n\r\nLin expressed her gratitude to the Paly community for the support it has given the team.\r\n\r\n\"We greatly appreciate the support we've been getting from the school and community,\" she said. \"I think people often do not know that we compete against and win against teams that are better equipped than we are. We absolutely need this support, and we hope the students, staff and families of Paly will continue supporting the Science Olympiad team.\"","excerpt":"After earning a spot in the state competition with a regional win in March, the Palo Alto High School Science Olympiad team capped off its season Saturday, placing second out of 24 teams, in the Northern California Science Olympiad.","date":"2014-04-17 12:46:03","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/10269736_10202813653197451_1883630144_o.jpg","categories":["News","Spotlight"],"tags":{"12859":"exploratorium","14168":"grace lin","14176":"max krawczyk","14167":"norcal science olympiad","8944":"palo alto high school","14166":"paly scioly","9074":"science olympiad"}},{"id":70693,"title":"Girls&#8217; lacrosse falls to SHP in Dog-Fight","permalink":"http:\/\/palyvoice.com\/2014\/04\/17\/girls-lacrosse-falls-to-shp-in-dog-fight\/","content":"The Palo Alto High School girls' lacrosse (5-4,4-1) team lost, 20-15, in a toughly contested game against Sacred Heart Preparatory High School (7-3,4-0) in a non-league game Wednesday at Palo Alto High School.\r\n\r\nPaly got on the scoreboard first with a goal early in the first half from junior Allie Peery.  This was first of her five goals of the night.  SHP struck back with three straight goals all coming in under two minutes after the first goal was scored.  With less than ten minutes left in the first half, SHP led , 8-4.  The Vikings, however, mounted a comeback, and brought the score to 8-7 by the end of the half, with goals from seniors Kristen Destefano and Ami Drez and sophomore Maya Benatar.\r\n\r\nThe Vikings came out of halftime hot with two quick goals from junior Paige Bara and another from Drez to give them a 9-8 advantage.  SHP proceeded to go on a six to three run to push their lead to 15-12. Benatar put in a goal with 11 minutes left in the game to cut the lead to two, but SHP was too strong for the Vikings down the stretch. SHP pulled away to a 18-14 lead with  three minutes left in the game. Bara added another goal near the end of the game to make the final 20-15.\r\n\r\nDestefano praised her team's effort in the closely fought game.\r\n\r\n\"I think we played one of our best games tonight even though we lost,\" Destefano  said.\r\n\r\nThe Vikings' next matchup will be at 4 p.m. Friday evening at Palo Alto High School against Mountain View High School\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls&#8217; lacrosse (5-4,4-1) team lost, 20-15, in a toughly contested game against Sacred Heart Preparatory High School (7-3,4-0) in a <a href=\"http:\/\/palyvoice.com\/2014\/04\/17\/girls-lacrosse-falls-to-shp-in-dog-fight\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-04-17 09:33:55","author":"Malcolm Davis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/493.jpg","categories":["Sports","Sports Recap"],"tags":{"8736":"girls' lacrosse","8836":"Lacrosse"}},{"id":70517,"title":"San Francisquito Creek listed among most endangered in US","permalink":"http:\/\/palyvoice.com\/2014\/04\/16\/san-francisquito-creek-listed-among-most-endangered-in-us\/","content":"American Rivers, a conservation group advocating for river restoration and protection, named Palo Alto's San Francisquito Creek the fifth-most endangered river in an annual report Wednesday, April 9.\r\n\r\nThe creek, which runs just a mile from Palo Alto High School campus, contains one of the last remaining wild steelhead fish populations in the San Francisco Bay and also shelters endangered salamanders.\r\n\r\nAmerican Rivers is calling for the removal of Stanford University's Searsville Dam, which blocks fish migration and contributes to habitat degradation in downstream areas.  In addition to habitat degradation, various environmental groups have blamed the university for tapping water from the reservoir behind the dam contributing to a more dry downstream environment.\r\n\r\nThe opportunity to restore a river in the bay area is extremely rare, because most have been coated in concrete to prevent flooding and manage water.\r\n\r\nEnvironmentalists believe that the creek being named among the nations most endangered will bring the publicity necessary to help restore the river.\r\n\r\n\"We hope that listing San Francisquito as one of America's most endangered rivers will raise both local and national awareness about the issue and put additional pressure on Stanford to do the right thing and remove this harmful and unnecessary dam,\" associate director of California river restoration for American Rivers Kerri McLean said.\r\n\r\nIf the dam were removed, experts suggest that fish populations would return rather quickly based on other dam removal projects around the country.  This return, would provide recreational opportunities for Paly students as well as members of the Palo Alto community.\r\n\r\n\"Too many people live right along the creek without ever realizing how special this resource really is,\" McLean said.  \"The more people who appreciate the creek, the better protected it will be.\"<a href=\"http:\/\/www.youtube.com\/watch?v=wc1gUJGZQh8\">\r\n<\/a>\r\n\r\nStanford University is already in the middle of an investigation into the best way to handle this situation.  This study is supposed to come to a close in the end of 2014.\r\n\r\nFor more information on how you can help with the effort to remove the dam visit <a title=\"beyond searsville dam\" href=\"http:\/\/www.beyondsearsvilledam.org\">http:\/\/www.beyondsearsvilledam.org<\/a>.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"American Rivers is calling for the removal of Stanford University's Searsville Dam, which blocks fish migration and contributes to habitat degradation in downstream areas.  In addition to habitat degradation, various environmental groups have blamed the university for tapping water from the reservoir behind the dam contributing to a more dry downstream environment.\r\n","date":"2014-04-16 22:30:56","author":"Matthew Fogarty","categories":["News"],"tags":[]},{"id":70650,"title":"Girls lacrosse to host Sacred Heart","permalink":"http:\/\/palyvoice.com\/2014\/04\/16\/girls-lacrosse-to-host-sacred-heart\/","content":"The Palo Alto High School girls lacrosse team will host its crosstown rival, the Sacred Heart Prep High School Gators (7-3, 4-0) at 7 p.m. Wednesday.\r\n\r\nStopping Sacred Heart will not be an easy task for the Vikings, who will have to focus on junior Brigid White, a Northwestern University commit, as well as Libby Muir, a sophomore who has already pledged to Stanford.\r\n\r\n\"Our plan is to pretty much double team [White and Muir] as soon as they get the ball,\" junior Paige Anderson said.\r\n\r\nAnderson explained that in addition to blanketing the Gators' stars, the Vikings will have to do a better job communicating on defense.\r\n\r\n\"We need to work on talking a lot on defense and making sure to send the slides when we are double teaming,\" Anderson said.\r\n\r\nAccording to Anderson, as far as offense goes, the Vikings will look to play a fundamentally sound game by keeping the ball moving and retaining possession.  More time with the ball means less opportunities for the Gators to score.\r\n\r\n\"[I believe] we have a chance of winning as long as we get the 50-50 balls from the draw and keep possession,\" Anderson said.\r\n\r\nThe Vikings will stay at home to play Mountain View High School at 7 p.m. Thursday.","excerpt":"The Palo Alto High School girls lacrosse team will play host to its crosstown rival, the  Sacred Heart Prep High School Gators (7-3, 4-0) at 7 p.m. Wednesday.\r\n","date":"2014-04-16 15:29:59","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/03\/mce_030213_0033.jpg","categories":["Sports"],"tags":[]},{"id":70556,"title":"Students respond to Phil Winston story","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/students-respond-to-phil-winston-story\/","content":"[caption id=\"attachment_70564\" align=\"alignright\" width=\"340\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg\"><img class=\"size-full wp-image-70564\" alt=\"Phil Winston was under investigation for misconduct during the time of his decision to step down from his principal position. Photo by Veronica Weber.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg\" width=\"340\" height=\"227\" \/><\/a> Former Paly principal Phil Winston was under investigation for misconduct during the time of his decision to step down from his principal position at Palo Alto High School. Photo by Veronica Weber.[\/caption]\r\n\r\nPalo Alto High School students are responding to a Palo Alto Weekly <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">story<\/a> detailing former Paly Principal Phil Winston's notice of misconduct, which was received by him last summer.\r\n\r\nThe story contains numerous examples of alleged misconduct by Winston towards both students and staff. Many of the examples in the Weekly story are related by a staff member or parent who claimed to have seen the situations unfold.\r\n\r\nThere is now push back on social media from some students who saw no misconduct from Winston during his time at Paly.\r\n\r\n\"This Winston story is completely a misrepresentation of Mr. Winston as a guy,\" junior Phil Lewis said. \"I had the pleasure of knowing him well, and he really cared about each individual. It's a shame that he was forced to leave Paly because now the students are stuck with a misconception of him as a person.\"\r\n\r\nNot only current students, but also Paly alumni, disagree with the claims made about Winston.\r\n\r\n\"During my time at Paly I never witnessed Mr. Winston doing or saying anything inappropriate,\" said Paly alum Olivia Maggi, Class of 2013. \"He would always talk to students and was very friendly, but I thought that was good. I thought he was very involved with students' lives and cared about how they were doing. It made me feel like he actually cared and supported us. When I read the Weekly's story about Mr. Winston, it made me sad that this could happen to him. I feel that words can sometimes be taken the wrong way and that Mr. Winston was never intending to be inappropriate. I think he was very good at his job.\"\r\n\r\nHowever, now some students said they felt uncomfortable with Winston after reading the article.\r\n\r\n\"Honestly, I was pretty on board with the 'Chill Phil' thing, too,\" senior Jessica Feinberg said. \"After reading the evidence and documentation against him and having discussions with teachers and fellow students, I feel a really sick sense of being used. He created a good rapport with students ... but he used that as a shield to protect him from these allegations because it became nearly impossible for students and teachers to report their harassment. His popularity among students — this shield — allowed a culture of silence to be created, where speaking up would create backlash against those who spoke. And I was part of that shield.\"\r\n\r\nWinston argued against <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1397016468.pdf\">six specific allegations<\/a> made against him by sending a <a href=\"http:\/\/www.paloaltoonline.com\/media\/reports\/1397016279.pdf\">letter<\/a> to Assistant Superintendent of Human Resources Scott Bowers on June 14, according to the Weekly.\r\n\r\n\"It is always disappointing when statements or conduct are misinterpreted, but I understand that this is going to happen from time to time, and I do my best to avoid such misinterpretations,\" Winston said to Bowers. \"I am certain I can do still better in that respect and I will take these comments as a learning experience that will help me further improve.\"","excerpt":"Palo Alto High School students are responding to a Palo Alto Weekly story detailing former Paly Principal Phil Winston's notice of misconduct, which was received by him last summer.","date":"2014-04-15 14:20:07","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/30980_main.jpg","categories":["News","Spotlight"],"tags":{"8939":"palo alto","8953":"paly","8984":"Phil Winston","9013":"principal","11609":"resignation","13859":"student response"}},{"id":70630,"title":"Preview: New York Times bestselling author to discuss college life","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/preview-new-york-times-bestselling-author-to-discuss-college-life\/","content":"The Palo Alto High School and Gunn High School Parent Teacher Student Associations are bringing a New York Times bestselling author to Gunn's Spangenberg Theater tonight at 7 p.m. to discuss students' transitions to college.\r\n\r\nHarlan Cohen, author of the student handbook on college life <em>The Naked Roommate,<\/em> will hold a free presentation for seniors, juniors and parents in preparation for their upcoming move to college and for the college search process, according to PTSA parent Jennifer Landesmann.\r\n\r\nCohen encourages asking questions, so the audience will be able to text in their questions about any topic concerning the college experience, including making friends, relationships, peer pressure, time management and finances, according to a <a href=\"http:\/\/archive.constantcontact.com\/fs164\/1102270631099\/archive\/1117083571959.html\" target=\"_blank\">PTSA Paly Link email<\/a>.\r\n\r\nCollege advisor Sandra Cernobori praised Cohen's presentation skills.\r\n\r\n\"His book is good, and he's engaging and entertaining,\" Cernobori said.\r\n\r\nCohen has visited more than 400 college campuses and has written five books, according to his <a href=\"http:\/\/www.NakedRoommate.com\/\" target=\"_blank\">website<\/a>.","excerpt":"The Palo Alto High School and Gunn High School Parent Teacher Student Associations are bringing a New York Times bestselling author to Gunn's Spangenberg Theater tonight at 7 p.m. to discuss students' transitions to college.","date":"2014-04-15 14:05:56","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_4.jpeg","categories":["News"],"tags":{"14165":"cernobori","14162":"harlan cohen","14163":"new york times","9019":"PTSA","14164":"the naked roommate"}},{"id":70582,"title":"Voice of the Week: Erik Olah","permalink":"http:\/\/palyvoice.com\/2014\/04\/15\/voice-of-the-week-erik-olah\/","content":"[caption id=\"attachment_70587\" align=\"aligncenter\" width=\"576\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg\"><img class=\" wp-image-70587 \" alt=\"erik olah\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg\" width=\"576\" height=\"432\" \/><\/a> Palo Alto High School science teacher Erik Olah poses outside his home at Paly, the science building. Photo by Kate Marinkovich.[\/caption]\r\n<p style=\"text-align: left;\"><span style=\"line-height: 1.5em;\">This week The Paly Voice sat down with science teacher Erik Olah to talk about northern elephant seals, Prom and Twitter. <\/span><\/p>\r\n<p style=\"text-align: left;\">The Paly Voice: Tell me a little bit about yourself. How would you describe yourself in three words?<\/p>\r\nErik Olah: I hate questions like that. Describe myself in three words? Well if you know if someone repeats the question they're totally stalling. We can come back to that.\r\n\r\nTPV: What's your favorite marine animal?\r\n\r\nEO: Probably the northern elephant seal. There's a difference between northern and southern elephant seals. There's a big difference.\r\n\r\nTPV: Why the northern?\r\n\r\nEO: Well that's the one I studied when I did my studying of marine biology at Santa Cruz. I observed and studied northern elephant seals quite a bit. They're not that different than southern elephant seals, but they are the one's that I've seen.\r\n\r\nPV: How do you like teaching seniors?\r\n\r\nEO: Oh, it's interesting. Seniors are fine, I'm used to it. It's my third year teaching seniors so you start getting used to the pattern.  You kind of see them fall out, some sooner than others, some depending on when they get into college. But usually by this time of year the vast majority are checked out, so it's hard to keep them focused. But that's why with Marine Biology [class] I do marine mammals now, because I think that's the thing people are most interested in, so I try to do the thing people are most interested in when it's most likely they will be checked out of the class.\r\n\r\nPV: What do you like better, marine biology or AP biology?\r\n\r\nEO: That's a tough question. Marine biology is my class, I designed it, I'm the only one's who's teaching it. It's my thing, so that would be the thing I am most excited to do and always thinking about. AP biology is great too, I am really enjoying that.\r\n\r\nPV: When you go to the aquarium what's your favorite animal to see?\r\n\r\nEO: I used to really like sea otters, but they are always there. I don't know if it's my favorite but I always like looking at the sunfish because it's like what the heck, what is that thing? It doesn't look like a thing that should be. I don't think it's my favorite, but I like seeing it and noticing how ridiculous it looks. Also, all the parasites that are on it usually.\r\n\r\nPV: Any words on the Paly boys' basketball season?\r\n\r\nEO: Pretty good season. We had a lot of seniors graduate last year, so pretty much all the guys on this year's team had zero varsity basketball experience. Expectations might have been a little bit lower, but they definitely way overachieved and they did quite well. I think they definitely overachieved. It was a fun year.\r\n\r\nPV: You have a pretty popular Twitter feed that's well-read among the Paly students. Anything to say about that?\r\n\r\nEO: Is it that well-read?\r\n\r\nPV: You were just featured in the Verde.\r\n\r\nEO: I'm always featured in the Verde. I don't know. My thing with it is I know some teachers use it as a teaching tool, and I've thought about that, but you have Schoology for all your work stuff and you can look for that there so I just try to use it as an outlet to connect with students in a more fun way. If kids think it's funny that's great. I try to say a few things here and there that are funny.\r\n\r\nPV: What's your favorite marine-biology-themed pun?\r\n\r\nEO: Whale, I don't know. Let me sea if I can think of one. I otter do better than that.\r\n\r\nPV: You recently helped a student ask another student to Prom. Do you like to stay pretty involved with the student community?\r\n\r\nEO: It was fun. I went to Gunn and I don't remember people doing those crazy fun things like that, so I think it was kind of fun to experience that. I mean I didn't ask the person, but it was fun to be a part of that experience.\r\n\r\nPV: Did you go to Prom?\r\n\r\nEO: I went to my junior Prom but not my senior Prom.\r\n\r\nPV: Did you ask the girl?\r\n\r\nEO: I don't remember. I think I didn't. I know one of the Homecomings, actually both of the Homecomings, I went to I didn't, the girl asked me. I was kind of lazy about that. But to backtrack, I didn't go to my senior Prom because my sister's college graduation was the same weekend. It's not because I couldn't get a date, I'm sure there were plenty of offers. Back to the Prom thing, it was fun. It was fun because it was a student I really liked so it was fun to give her a funny experience that she hopefully remembers. But that's not the only one I did. I did a pop quiz question for a kid up on the projector. Another kid came in and sang, but I wasn't really part of that.\r\n\r\nPV: If you had one thing to say to the Voice audience, what would you want to say?\r\n\r\nEO: I know that Paly can be stressful and that high school is stressful, but try to find the things you enjoy and focus on the positive and get the most out of those things.\r\n\r\nPV: Specifically to seniors?\r\n\r\nEO: Good luck. For the seniors, I feel like the college process is so stressful that it takes the fun out of getting into college, but I hope once fall rolls around you realize what a great opportunity you have. It's fun, and you have a good opportunity to learn a lot. There's so much you can get out of college. I hope you can get past the frustrations that are happening now and get to the good stuff.\r\n\r\nPV: That's really nice.\r\n\r\nEO: I can be really nice.\r\n\r\n<em>If you know a student (or student group) who you think should be interviewed, please leave a comment below.<\/em>\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"This week The Paly Voice sat down with science teacher Erik Olah to talk about northern elephant seals, Prom and Twitter.\r\n","date":"2014-04-15 13:31:47","author":"Kate Marinkovich","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/erik-olah.jpg","categories":["Features","Spotlight","Voice of the Week"],"tags":{"13930":"erik olah","8953":"paly","10258":"voice of the week"}},{"id":70409,"title":"Construction continues, with several projects nearly finished","permalink":"http:\/\/palyvoice.com\/2014\/04\/13\/construction-continues-with-several-projects-nearly-finished\/","content":"[caption id=\"attachment_70430\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg\"><img class=\"size-full wp-image-70430\" alt=\"The exterior of the new math building, which could open in just two weeks. Photo by Drew Keller.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg\" width=\"600\" height=\"450\" \/><\/a> The exterior of the new math building, which could open in just two weeks. Photo by Drew Keller.[\/caption]\r\n<p dir=\"ltr\">The new math and social science building and Media Arts Center are nearing completion, while construction work continues on many smaller projects including several that were implemented over the course of Spring Break.<\/p>\r\n<p dir=\"ltr\">The new math and social science building will open soon, according to Assistant Principal Jerry Berkson, with only about two weeks left of preparation.<\/p>\r\n<p dir=\"ltr\">“There’s furniture in the math [and social science] building, so that building is ready to go,” Berkson said. “We could probably do it [open the math and social science building] today … other than phone lines and sewage.”<\/p>\r\n<p dir=\"ltr\">According to Berkson, the administration wants to get math classes in the new building sooner, so that the old math building is ready to <a href=\"http:\/\/palyvoice.com\/2014\/01\/28\/pe-to-invade-math-department-as-construction-comes-to-a-conclusion\/\">accommodate PE students<\/a> next year due to the demolition of the old gym building this summer.<\/p>\r\n<p dir=\"ltr\">Construction on the Media Arts Center will also be finished soon, though not as promptly as construction on the math and social science building.<\/p>\r\n<p dir=\"ltr\">“Construction is definitely done, it’s just more stuff on the inside,” Berkson said. “I’d say if we really wanted to we could move in within a month.”<\/p>\r\n<p dir=\"ltr\">While the building could be open in a month, it may not be ready for all the media arts students until next year. Due to its large size, the Advanced Journalism class (which publishes the Campanile newspaper) will have first priority to move in to the new building if construction is completed before summer.<\/p>\r\n<p dir=\"ltr\">“It’ll be fully functional for next year,” Berkson said.<\/p>\r\n<p dir=\"ltr\">In addition to the ongoing construction of the two new buildings, several small construction projects and changes took place on campus over spring break. These projects included taking down the fences by the east and north side of the campus, relocating trees in the Embarcadero parking lot and adding new walkways between the English building and Library.<\/p>\r\n<p dir=\"ltr\">“They’re [the construction workers] going to be making adjustments for their next projects,” Berkson said regarding the fences.<\/p>\r\n<p dir=\"ltr\">Starting next year, students will also have to take the bike path next to the railroad tracks to get to Town and Country Village because there will be construction at the current Embarcadero Road pedestrian crosswalk.<\/p>\r\n<p dir=\"ltr\">With the Media Arts Center and math and social science building construction coming to a close, work on the school’s next projects will be able to begin, according to Berkson.<\/p>\r\n<p dir=\"ltr\">“New gym construction will start over the summer, hopefully,” Berkson said.<\/p>\r\n<p dir=\"ltr\">Other upcoming construction plans include remodeling the science building to create four additional classrooms and remodeling the library.<\/p>","excerpt":"Many small construction projects have been carried out over the course of Spring Break, while the new media arts and math buildings are nearing completion.","date":"2014-04-13 17:56:58","author":"Drew Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1.jpg","categories":["News","Spotlight"],"tags":{"8616":"construction","9954":"jerry berkson","11127":"media arts center"}},{"id":70450,"title":"Sophomore and junior testing on Monday","permalink":"http:\/\/palyvoice.com\/2014\/04\/13\/sophomore-and-junior-testing-on-monday\/","content":"Palo Alto High School sophomores and juniors will take the annual science section of the California Standardized Test and the new Smarter Balanced Test starting at 8:15 a.m. Monday.\r\n\r\nAccording to Dean of Students Craig Tuana, the scores from the Smarter Balanced Test will not count since it is a new online standardized test that the California Department of Education is field testing this year. The results from this year, however, will be examined to make any changes to the scored test that will be administered next year.\r\n\r\nThe purpose of the Smarter Balance Test is to test students'  college preparedness, according to Tuana. The Smarter Balance Test is replacing the Early Assessment Program that has been taken annually by juniors in the past. Additionally, Paly has recently changed its common core standards, so this new test will be meeting those new requirements.\r\n\r\nEven though the Smarter Balance Test is not a scored test, this trial will give vulnerable feedback to both Paly and the Department of Education on whether or not online tests of this scale are effective to give at the same time. It will give feedback to teachers as it will reveal if students have learned the material on the test or not, according to Tuana.\r\n\r\n\"[The staff] wants to see if we can handle [the test] and if not, we want to learn from this one to make sure that we can handle it for the test next year,\" Tuana said.\r\n\r\nThe Smarter Balance Test was supposed to have originally been administered to juniors on March 18 and 19, while the sophomores were taking the California High School Exit Examination, but due to the fact that the test was not ready then, the Department of Education decided to postpone its release date.\r\n\r\nThe Smarter Balance Test will be taken on a computer, and it will have a different format than the  Standardized Testing and Reporting test administered in previous years.  The test will consist of multiple choice questions, fill-in-the blank questions and even questions which involve drawing on the computer.\r\n\r\n\"[The test will] benefit students who are taking it,\" Tuana said. \"I think this is a wave of future testing that they could possibly experience [this type of testing] in college.\"\r\n\r\nSophomores, on the other hand will be taking the CST. The CST is not a new test. It is a general science test for sophomores, which contains two parts and will end at 10:20 a.m., according to Tuana.\r\n\r\nThe school expects that students will come for both exams like any other standardized test, according to Dean of Students, Craig Tuana.\r\n\r\n\"[The school] really expects the students to come,\" Tuana said. \"We are just asking for two hours of [the students'] time for the tests and to test our system.\"\r\n\r\nWhile sophomores and juniors will have to attend school Monday, freshmen and seniors will have the day off.\r\n\r\nHere is more information about the <a href=\"www.cde.ca.gov\">Smarter Balance Test<\/a> and the <a href=\"http:\/\/www.cde.ca.gov\/ta\/tg\/sr\/cefstar.asp\">CST<\/a>.<a href=\"http:\/\/www.cde.ca.gov\/ta\/tg\/sr\/cefstar.asp\">\r\n<\/a>","excerpt":"Palo Alto High School sophomores and juniors will take the annual science section of the California Standardized Test and the new Smarter Balanced Test starting at 8:15 a.m. Monday.","date":"2014-04-13 12:44:32","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/test.jpg","categories":["News"],"tags":{"13288":"cst","9760":"juniors","9072":"science","12317":"smarter balance test","9114":"Sophomores","12056":"standardized testing","12319":"test","13289":"testing"}},{"id":70551,"title":"NHSJC Online News Package submission: Feeding the convention","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/nhsjc-online-news-package-submission-feeding-the-convention\/","content":"","excerpt":"Takaaki Sagawa and William Dougall's submission for the National High School Journalism Convention Online News Package contest.","date":"2014-04-11 15:33:47","author":"Takaaki Sagawa","categories":[],"tags":[]}]