[{"id":79767,"title":"Opinion: Living Skills, an incomplete study","permalink":"http:\/\/palyvoice.com\/2014\/12\/12\/opinion-living-skills-an-incomplete-study\/","content":"[caption id=\"attachment_79808\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1754.jpg\"><img class=\"size-full wp-image-79808\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1754.jpg\" alt=\"The Living Skills curriculum is misleading if the name of the class is to be taken literally. More practical subjects should be included in the course. Photo by Maya McNealis. \" width=\"600\" height=\"450\" \/><\/a> The Living Skills curriculum is misleading, if the name of the class is to be taken literally. More practical subjects should be included in the course. Photo by Maya McNealis.[\/caption]\r\n\r\nLiving Skills: a rite of passage that all Palo Alto High School students must complete to graduate high school and prove that they are prepared for adulthood. A class that should cover such interesting and important topics as applying for a job, managing finances, nutrition, and health. A class that is only a semester of basic education on mental, sexual and emotional health, which are all important topics but should be taught with the addition of topics like managing household appliances and transportation.\r\n\r\nWhile we commend the Palo Alto Unified School District for covering challenging health topics relevant to adult life, we believe that Living Skills should be revised to include education on managing finances and entering and navigating the workforce.\r\n\r\nThe Living Skills class was originally created because Paly parents were worried about teen pregnancy and student knowledge about safe sex practices, according to Living Skills teacher Letitia Burton. The current Living Skills class also focuses on topics such as teen depression, mental health and racism. Though these are all very important topics that ought to be discussed with all Paly students, we believe that the course should include a greater focus on everyday life skills including taxes, managing a household and keeping of track of money.\r\n\r\nSome people may feel that teaching students to protect their physical and mental health should be the top priority. We agree, but if students do not know how to pay their utility bills, and therefore don’t have hot water and electricity, Paly will be doing a poor job of protecting their health.\r\n\r\nAnother argument that is used to justify the Living Skills curriculum is that the class was created to address depression and pregnancy. However, students feel that QPR (the question, persuade, respond method of combating depression) and sexual education can be taught faster than they currently are. Some students, like junior Aiva Petriceks, believe that the current Living Skills content could be compressed.\r\n\r\n“We spent a lot of time just talking about race and stuff,” Petriceks said. “I think we spent a couple weeks on it ... but I think that kind of stuff you just need a day to do.”\r\n\r\nWe feel that especially after tragedies such as Ferguson, topics such as racial identity and affirmative action are definitely important to discuss. One day would not be a long enough time to cover these topics, but if the class was streamlined a bit there would be time for subjects such as managing budgets and entering the workforce.\r\n\r\nAlthough Paly offers other resources, like the required semester of Economics and the four-year Advisory system, those courses should not be students’ sole sources of information on managing finances and applying for jobs. Living Skills would be a better course to introduce such basic skills because managing money is a skill needed in independent adult life.\r\n\r\nSenior Anna Zhang, who took Living Skills in summer school, says that the class could benefit from new additions to the curriculum.\r\n\r\n“A lot of things that could actually be applied to life were not taught,” Zhang said. “But [my teacher] did ask for our feedback and we asked him to teach us about taxes and insurance. He did go over that with us even though it wasn’t in the curriculum. I feel like a lot of other classes didn’t have that opportunity.”\r\n\r\nHowever, when asked, Burton said there was no room for additional material.\r\n\r\n“As much as finances would be really interesting, it [the class] is only one semester,” Burton said. “And within that one semester we’ve got a lot of curriculum to cover. There just really isn’t time or space to add anything else. If Living Skills was a year long class? Yeah. But as things stand now, there’s just not enough time.”\r\n\r\nBurton explained that she understands the false impressions that accompany the name of the course.\r\n\r\n“I know students like to think ‘Oh, well it should be a class on living skills cause its called ‘Living Skills,’ but really students need to understand that this is primarily a health class, where we look at physical, social and emotional health issues,” Burton said.\r\n\r\nAll Living Skills classes should ask for student feedback to see if students would like to learn about practical topics, such as finances and household management. The purpose of high school is to equip teenagers with the skills that adults use to thrive in the real world, which is why we believe that our proposed additions to the one-semester Living Skills curriculum is vital. Sometimes the simple, practical skills are the most important, and Paly should make sure students are taught all of them.\r\n\r\n&nbsp;","excerpt":"Living Skills. The infamous rite of passage is both a dreaded and anticipated class that every Palo Alto High School student must pass in order to graduate high school and prove they are prepared for adulthood. ","date":"2014-12-12 14:27:22","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1754.jpg","categories":["Opinion","Spotlight"],"tags":{"25039":"education","33866":"finances","33865":"living skills","33867":"sex education"}},{"id":80149,"title":"Community service opportunities this winter","permalink":"http:\/\/palyvoice.com\/2014\/12\/12\/community-service-opportunities-this-winter\/","content":"For students who are currently taking Living Skills and need the required 15 hours of community service, or anyone who simply wants to give back to the community, winter break is a great time to receive credit for a class and also contribute to the gift-giving spirit.\r\n\r\nHere is a list of notable volunteering events happening this winter season:\r\nDec. 13: Edgewood Kinship Support Network event\r\nDec. 13: St. Anthony's Padua Dining Room food serving\r\nDec. 13: Palo Alto Art Center arts and crafts\r\nDec. 14: InVision Shelter Network's food serving\r\nDec. 20: Covenant Food Pantry food distribution\r\nDec. 23: Project Open Hand food preparation\r\nDec. 27: Full Circle Farm gardening\r\n\r\nHover above the calendar to see the stars and then hover around each individual star to read about the details of the event on that day. The red stars are community service opportunities that are ongoing, while the green starts are single-day events.\r\n\r\n<img class=\"alwaysThinglink\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/599682882646048770\/1024\/10\/scaletowidth#tl-599682882646048770;1043138249'\" alt=\"\" \/>\r\n\r\n&nbsp;\r\n\r\n<script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"To students who are in Living Skills and need the required 15 hours, or to simply to anyone who wants to give back to the community, winter break is a great time to catch up on those community service hours and contribute to the gift-giving spirit. The Paly Voice gathered information on Community Service Opportunities that will be able available this winter break.\r\n","date":"2014-12-12 14:17:32","author":"Ana Caklovic","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/Screen-Shot-2014-12-11-at-12.55.20-PM.png","categories":["Multimedia"],"tags":{"10310":"calender","14812":"community service","34196":"december","33928":"Gift drive","33663":"winter break"}},{"id":79908,"title":"Column: When Life gives you lemons before finals","permalink":"http:\/\/palyvoice.com\/2014\/12\/11\/column-when-life-gives-you-lemons-before-finals\/","content":"<p style=\"text-align: left;\">I am sitting at my computer with textbooks, notes and study guides all spread out around me. Suddenly, I hear a knock at the door. It’s Life. Life arrogantly enters without my invitation and immediately begins to shout, “Yooo maaaa, I brought you some lemons.\" I sigh, “Life, what are you doing? It is 2 o'clock in the morning, what do you expect me to do with lemons?” And Life is like, “Make lemonade, Stupid!” and I am like, “Life, I have five finals to study for. I do not have time to make lemonade.\"<\/p>\r\n\r\n\r\n[caption id=\"attachment_80207\" align=\"alignright\" width=\"373\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/DSC_0009.jpg\"><img class=\"wp-image-80207\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/DSC_0009.jpg\" alt=\"DSC_0009\" width=\"373\" height=\"250\" \/><\/a> Lemons that Life dropped off at my house last night. Life was all like, \"Lemonsss?\" and I was all like, \"APUSHHH?\" Photo by Saba Moussavian[\/caption]\r\n\r\nYou are probably wondering two things right now:\r\n\r\n1. Why is Life talking like that?\r\n2. What the heck is going on here?\r\n\r\nTo answer the first question, I don’t know why Life is talking like that. I guess Life just kinda does his\/her (Life is gender-ambiguous) own thing.\r\n\r\nTo answer the second question, let me tell you where we are: We are in the pre-final zone.  Life is currently dropping off a lot of lemons. Sometimes, more lemons than we can handle.\r\n\r\nSo, we are left to question, \"How will I maintain my sanity throughout the pre-final zone?\" Using advice from Social Sciences teacher Alexander Davis and what I have learned as an experienced junior, I have constructed a list of ways to deal with this large intake of citrus juice.\r\n\r\n<strong>1. Organize the lemons<\/strong>\r\nI’ve got math, and history, and bio, and English, and — whoa, chillax bruh! I know it may seem like you have a lot, and you probably do, but there is no need to panic. Grab a piece of paper and a pencil and make lists. How many finals do you have? What do you need to study for each final? How much time do you need for each task? Make a calendar to schedule for when you will work on what — maybe even color-code it. Finals studying is all about being on top of your work. Spreading out the big jumble of work you have onto a piece of paper will also hopefully show you that this isn’t impossible.\r\n\r\n<strong>2. Take one lemon at time<\/strong>\r\nI know teachers tell us this all the time, but I’m going to say it anyways: Don’t procrastinate — break your work up, spread it out. All of your work left for the night before can be more lemons than possible to handle. But, you can probably deal with a basket of lemons a day, or even a few lemons an hour.\r\n\r\n<strong>3. Prioritize between which lemons are more important to handle<\/strong>\r\nIf you have five finals to study for and a limited amount of time, odds are you won’t be able to get to all of them. Consider which subject you are struggling in most and in which class the grade matters most.\r\n\r\nI encourage all of you to calculate the grade you need on your final in order to achieve your desired grade in the class — not to give yourself the overconfidence of being able to flunk the final, but so you can be aware of exactly where you stand in each class.\r\n\r\n<strong>4. Tell your teachers about all the lemons you have<\/strong>\r\n\r\n“You know, your teacher wants you to do well,\" Davis said. \"Your teacher isn’t trying to screw you over.\"\r\n\r\nYes, there remain a hand full of oddball teachers who I am still convinced are plotting against me, but I have found that most teachers are willing to work to help you however possible in regards to finals and other issues. They probably can’t make a test disappear, but can give you great advice on how to do well on your final. Oftentimes, teachers are also willing to let you take your final on a different day if the day you are scheduled to take it on is already overloaded.\r\n\r\n<strong>5. Take a little sugar with your lemons<\/strong>\r\n\r\nJust because finals are important doesn't mean you have to suffocate yourself with work. Taking breaks to exercise, hang out with friends or watch some TV can be healthy and might actually give you the energy to keep working. Maybe you'll want to catch up on 30 minutes of Netflix after every two hours of studying. Whatever it is, remember: Lemons aren't so sour with a little bit of sugar.\r\n\r\n<strong>6. Complain with your friends about all the sour lemons Life keeps giving you<\/strong>\r\nWalk into the library on finals week and I guarantee you there will be a good number of people complaining about their finals, maybe even more than there are actually studying. And perhaps that’s not a bad thing!\r\n\r\nJust know that there are nearly 2,000 other people in this school ready to vent with you about how horrible their lives are right now; that’s right, we’re all in this together. Sometimes, just knowing you’re not alone and getting out all that frustration can make you feel better. Maybe you can’t make much lemonade by yourself, but if you get 2,000 people to make it with you — well, that’s a lot of lemonade.\r\n\r\n<strong>7. Remember that these lemons will be gone soon and you can have all the lemonade you want during your winter break<\/strong>\r\nEight, seven, six, five, four, three, two, one and then we’re there. In less than two weeks you will be free(ish) from the stresses of school.\r\n\r\nBut, being free will also make your grades untouchable. This is your last chance to turn those “B+s” into “A-s” and \"C+s\" into \"B-s,\" so make it worth it.\r\n\r\nJust think of all the food, Netflix and sleep you will consume. Yes, it’s true, Life will keep knocking on your door with more lemons, but sometimes you just need to chug and get through the rough parts, and thinking about how close you are to a break can help you do that.\r\n\r\nConsider these while you fight your way through the pre-finals stress or any other stressful studying time you may encounter in the future. And next time Life comes knocking at your door in the middle of the night delivering lemons, you can be all like, \"Cool, lemons. I can handle that.\"\r\n\r\n&nbsp;","excerpt":"Staff writer Saba Moussavian shares her experiences with pre-finals stress in a light-hearted, yet relatable analogy to lemons.","date":"2014-12-11 18:05:33","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/DSC_0009.jpg","categories":["Opinion","Spotlight"],"tags":{"33420":"advice","34112":"alexander","34111":"austin","33421":"column","34113":"davis","10172":"finals","34110":"funny","33415":"lemons","33414":"life","34109":"stess","29936":"studying","34114":"xander"}},{"id":80154,"title":"Storm spouts leaks, leads to evacuations","permalink":"http:\/\/palyvoice.com\/2014\/12\/11\/storm-spouts-leaks-leads-to-evacuations\/","content":"<p>[caption id=\"attachment_80234\" align=\"aligncenter\" width=\"696\"]<img class=\" wp-image-80234\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0417.jpg\" alt=\"A student walks through the flooded area of the campus near the Student Center. Flooding in some areas of the campus reached over one foot deep today. Photo by Molly Fogarty.\" width=\"696\" height=\"464\" \/> A student walks through the flooded area of the campus near the Student Center. Flooding in some areas of the campus reached over one foot deep today. Photo by Molly Fogarty.[\/caption]<\/p>\r\n<p>A powerful storm left its mark on the Palo Alto High School campus today, causing minor flooding, a leak in the Library roof and evacuations of several classrooms.<\/p>\r\n<p>Several areas of the campus flooded this morning, resulting in an evacuation in the English Building, which has since been resolved, according to Assistant Principal Jerry Berkson.<\/p>\r\n<p>\"It was a lot worse earlier when the water was up to about a foot from the door,\" Berkson said. \"We unclogged the drain back there and that enabled things to flow better.\"<\/p>\r\n<p>The flooding in various areas of the campus have reached above one foot in depth. This is mainly due to the overflow of the campus drainage system, according to Berkson.<\/p>\r\n<p>\"So a lot of those drains flow into a box in the ground, and when it gets saturated that is as good as it’s going to get,\" Berkson said. \"The newer drains next to the constructions blow out somewhere and that is why you don't see puddles over there.\"<\/p>\r\n<p>A roof leakage in the entrance of the library facing the Quad has librarian Rachel Kellerman worried for potential damage to the building.<\/p>\r\n<p>\"We reported the leak to campus supervisors and put in a work order for them to check it out,\" Kellerman said. \"The biggest concern is that there are a lot of electronics in the roof, so hopefully they will be able to check those out and make sure that nothing up there is too wet.\"<\/p>\r\n<p>Navigate and click on the map to see photos from across campus.<\/p>\r\n<p><iframe src=\"https:\/\/www.google.com\/maps\/d\/u\/1\/embed?mid=zBfVdZykpi1c.kgIZhadtJsYM\" width=\"640\" height=\"480\"><\/iframe><\/p>\r\n","excerpt":"A storm has caused floods and a leak across the Palo Alto High School campus today, potentially causing further damage.","date":"2014-12-11 17:41:49","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0417.jpg","categories":["News","Spotlight"],"tags":{"34277":"english building","34276":"evacuation","34274":"flood","34275":"lake paly","34199":"pineapple express","9027":"rain","34178":"storm"}},{"id":80013,"title":"Camp Everytown nominations due today","permalink":"http:\/\/palyvoice.com\/2014\/12\/11\/camp-everytown-nominations-due-today\/","content":"[caption id=\"attachment_80304\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/hug-necklace.jpg\"><img class=\"size-full wp-image-80304\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/hug-necklace.jpg\" alt=\"Camp Everytown &quot;hug necklaces&quot; are given every year on the last day of camp and can be seen worn by alumni. Photo by Emma Chiu.\" width=\"600\" height=\"470\" \/><\/a> Camp Everytown \"hug necklaces\" are given every year on the last day of camp and can be seen worn by alumni. Photo by Emma Chiu.[\/caption]\r\n\r\nNominations to attend the annual Camp Everytown experience in January are due by email today.\r\n\r\nThe camp seeks to foster intense interactions between students and to find solutions to problems on the Palo Alto High School campus, according to Living Skills teacher and Camp Everytown Committee member Letitia Burton.\r\n\r\n“Camp Everytown is a leadership training [opportunity],” Burton said. \"It’s four days, we deal with issues of diversity and equity, we also deal with our own personal journey and how do we step into our own leadership. It’s not leadership like being in ASB or Congress, but just as a citizen of this country how can you step into your leadership.”\r\n\r\nStudents may email any one of the teachers on the Camp Everytown Committee to nominate themselves, or they may be nominated by one of their teachers. The camp is from Jan. 15 to Jan. 18.\r\n\r\nThis year, Burton anticipates the discussion on race will bring up the Ferguson ruling and police brutality linked to racism.\r\n\r\n“I’m sure those issues will come up, as we deal with issues of race and ethnicity,” Burton said. \"We deal with sexual orientation, we deal with gender issues and also family issues\".\r\n\r\nThis session, many students in the Associated Student Body and the Social Justice pathway are hoping to participate in the camp, but Burton hopes that any student, regardless of their interests and background, considers attending.\r\n\r\n“Any student, any background, any socioeconomic status, any class, we want a full spectrum of kids from Paly,” Burton said.\r\n\r\nJunior Dorothy Han, who attended the event last year, found it to be an eye-opening experience.\r\n\r\n\"It definitely shows you the privilege you have around you,\" Han said. \"It made me more compassionate toward others to know that we don't always know what is happening in other peoples' lives\".","excerpt":"Nominations to attend the annual Camp Everytown experience in January are due by email today.","date":"2014-12-11 14:10:22","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/hug-necklace.jpg","categories":["News"],"tags":{"8496":"ASB","10072":"camp everytown","10074":"letitia burton","34098":"nominations","9024":"race","34200":"social justice"}},{"id":79649,"title":"Opinion: Leave college reactions at home","permalink":"http:\/\/palyvoice.com\/2014\/12\/11\/opinion-leave-college-reactions-at-home\/","content":"[caption id=\"attachment_80200\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1654.jpg\"><img class=\"wp-image-80200\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1654.jpg\" alt=\"Seniors Jozy Prabhu and Ankita Avadhani scroll through college emails in the Paly Library. Students check college-related emails frequently on campus. Photo by Lydia Barry. \" width=\"300\" height=\"225\" \/><\/a> Seniors Jozy Prabhu and Ankita Avadhani scroll through college emails in the Paly Library. Students check college-related emails frequently on campus. Photo by Lydia Barry.[\/caption]\r\n\r\nYou unlock your phone. Your heart beat accelerates and your stomach drops. You tap on the email from [insert name of the college of your choice], and for a moment, the world seems to halt as you search for key words.\r\n\r\nSubmitting college applications can ignite a slew of stress and anxiety. But what's worse than this is that moment when other people announce to you the results of their applications when you have been rejected, have not heard back or have decided not to attend college.\r\n\r\nWe propose that seniors save all the college reactions for when they get home.\r\n\r\nPeople used to find out the fate of their applications when they returned home after school and checked the mail. No matter the results, their reactions were confined. Only family and close friends were privy to this information. These are the people who have helped you to this point and are there to congratulate or to console you.\r\n\r\nPeers in class, students on the Quad or teammates at practice are not people to whom you should turn. Yes, they could be proud and happy for your acceptance. Yes, they could empathize with and support you over a rejection. Yes, they could make you feel better. But you could make them feel worse. To hear that someone else was accepted to or even rejected from your dream school only increases the possible angst, disappointment and jealousy that surround college admissions.\r\n\r\nScreaming, whether of excitement or disappointment, is always inappropriate.\r\n\r\nSome people may simply not want the added distraction of college reactions during their classes. College decisions revealed in class have caused more awkwardness than positive reactions, according to Biology teacher Erik Olah.\r\n\r\n\"I've seen it where people hear about it in class and everyone else gets super happy, but then I've also seen it where someone's super happy and it gets really awkward for someone else who got rejected,\" Olah said. \"The safest thing would be to keep it at home, away from school.\"\r\n\r\nAssistant principal Jerry Berkson agrees that the best place to receive college decisions is at home.\r\n\r\n\"There might be some kid sitting right next to you who might not have gotten in where they want, meanwhile you're jumping up and down,\" Berkson said. \"I think the safest thing is to be with your family and let them enjoy your success or help you out with your disappointment.\"\r\n\r\nToday, Dec. 15, April 1 or any day in-between, we must resist the urge to gossip about, criticize others' or boast about our own college admissions decisions. By the end of the year, everyone will know your final choice. It is unnecessary to publicize all acceptances and rejections.\r\n\r\nWe will be keeping our college news relatively private, and we invite you to join us.\r\n\r\nSo, let's turn off our email notifications during school. Let's contain our impulses to ask others where they have gotten accepted or rejected. In doing so, we will be respecting not only our classmates but also ourselves.\r\n\r\n&nbsp;","excerpt":"Seniors should save college reactions for when they get home. ","date":"2014-12-11 14:03:18","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1654.jpg","categories":["Editor's Pick","Opinion"],"tags":[]},{"id":80131,"title":"Storm-ify: &#8220;The Pineapple Express&#8221; through the eyes of the Palo Alto community","permalink":"http:\/\/palyvoice.com\/2014\/12\/11\/storm-ify-the-pineapple-express-through-the-eyes-of-the-palo-alto-community\/","content":"While many school districts around the Bay Area have shut down school in preparation for this week's severely <a href=\"http:\/\/palyvoice.com\/2014\/12\/10\/what-to-do-during-a-storm-at-paly\/\" target=\"_blank\">stormy weather<\/a>, the Palo Alto Unified School District will continue in its daily operations. Dubbed the \"Pineapple Express\" due to its origins in the Pacific Ocean, the ongoing storm is causing flooding in Palo Alto. Below are social media posts and news updates from the Palo Alto community in the \"eye of the storm.\"\r\n<div class=\"storify\">\r\n\r\n<iframe src=\"\/\/storify.com\/thepalyvoice\/stormify\/embed?header=false&amp;border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/thepalyvoice\/stormify.js?header=false&amp;border=false\"><\/script>\r\n\r\n<noscript>[<a href=\"\/\/storify.com\/thepalyvoice\/stormify\" target=\"_blank\">View the story \"Thanksgiving 2014\" on Storify<\/a>]<\/noscript>","excerpt":"While many schools in the Bay Area have shut down in preparation for this week's severely stormy weather, PAUSD will continue in its daily operations. Follow social media posts and news updates through the eyes of the Palo Alto community in the \"eye of the storm.\"","date":"2014-12-11 13:03:23","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0476.jpg","categories":["Multimedia","Spotlight"],"tags":{"30939":"instagram","8944":"palo alto high school","9797":"photos","34199":"pineapple express","9027":"rain","30938":"social media","30934":"storify","34178":"storm","34181":"stormify","29808":"twitter","31353":"weather"}},{"id":80098,"title":"What to do during a storm at Paly","permalink":"http:\/\/palyvoice.com\/2014\/12\/10\/what-to-do-during-a-storm-at-paly\/","content":"<strong>Editor's note: <span style=\"color: #373e4d;\">Correction <span style=\"color: #545454;\">— <\/span>Castilleja will announce tomorrow morning whether or not school will be held. It has not been confirmed, as stated in an earlier version of this article, that its school day tomorrow has been canceled.<\/span><\/strong>\r\n\r\n<em>A storm is set to begin later tonight and Palo Alto is currently on high wind warning, flash flood watch and hazardous weather outlook. Tomorrow, the city will possibly see thunderstorms and winds up to 43 mph, according to the <a href=\"http:\/\/forecast.weather.gov\/MapClick.php?lat=37.41776&amp;lon=-122.1235054&amp;lg=english&amp;FcstType=text&amp;TextType=2\" target=\"_blank\">National Weather Service.<\/a> In an email message sent to Palo Alto parents today, Superintendent Max McGee stated, \"<span style=\"color: #000000;\">We are aware that several school districts in the North Bay are closing, but most South Bay school districts are remaining open as is Palo Alto Unified. \"<\/span><\/em>\r\n\r\n[caption id=\"attachment_80128\" align=\"aligncenter\" width=\"457\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/rsz_rsz_1907883_997393870277410_8530660136812276996_n.jpg\"><img class=\"size-full wp-image-80128\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/rsz_rsz_1907883_997393870277410_8530660136812276996_n.jpg\" alt=\"School custodians placed foot bridges across campus to prepare for the flooding that is expected to occur on campus tomorrow. Photo by George Lu. \" width=\"457\" height=\"402\" \/><\/a> School custodians placed foot bridges across campus to prepare for the flooding that is expected to occur on campus tomorrow. Photo by George Lu.[\/caption]\r\n\r\nSo it starts raining, a lot. What are students and employees on Palo Alto High School campus supposed to do? Of course, we hope for the best, but let's also prepare for the worst scenarios in order to ensure the safety of all people on campus if an emergency situation were to occur. After all, San Francisco, Oakland and North Bay school districts have already <a title=\"School Closings: San Francisco, Oakland, North Bay Districts Cancel Classes\" href=\"http:\/\/www.nbcbayarea.com\/news\/local\/Bay-Area-School-Closings-285399581.html\" target=\"_blank\">canceled<\/a> school for tomorrow because of the storm, and <a title=\"Castilleja\" href=\"http:\/\/www.castilleja.org\/\" target=\"_blank\">Castilleja<\/a> is currently considering canceling class. Here are some tips as to what to do during these times.\r\n\r\n<strong>1) What to do if the <a title=\"What to do during an electrical outage\" href=\"http:\/\/www.safeelectricity.org\/information-center\/library-of-articles\/62-storm-preparation-fallwinter\/318-what-to-do-during-an-electrical-outage\" target=\"_blank\">power goes out<\/a><\/strong>\r\n\r\n<span style=\"color: #545454;\">— <\/span>Stay away from fallen power lines, as they may still be active.\r\n\r\n<span style=\"color: #545454;\">— <\/span>If you are on campus, stay on school grounds until given directions from a teacher or administrator.\r\n\r\n<span style=\"color: #545454;\">— <span style=\"color: #222222;\">Turn off or disconnect any electronic equipment you were using when the power went out. (For people who sit in the back of the classroom to charge their iPhones, this means you.)<\/span><\/span>\r\n\r\n<strong>2) What to do around heavily flooded areas<\/strong>\r\n\r\n<span style=\"color: #545454;\">— <\/span>Take caution when proceeding over the bridges set up by the school. We suggest wearing rain boots tomorrow so you don't need to use the bridges in the first place.\r\n\r\n<span style=\"color: #545454;\">— <\/span>If an area seems unsafe, say something to an administrator or custodian so they can make it safe.\r\n\r\n<span style=\"color: #545454;\">— <\/span>Do not go swimming in flooded areas.\r\n\r\n[caption id=\"attachment_80105\" align=\"aligncenter\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/405064_10200296470633798_1605053619_n.jpg\"><img class=\"wp-image-80105\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/405064_10200296470633798_1605053619_n.jpg\" alt=\"Paly alumnus Jack Anderson goes puddle jumping during a storm in November 2012. While flood control at Paly has improved over the past two years, we do not recommend puddle jumping in severely affected areas. Photo by Keri Gee. \" width=\"450\" height=\"600\" \/><\/a> Paly alumnus Jack Anderson goes puddle jumping during a storm in November 2012. While flood control at Paly has improved over the past two years, we do not recommend puddle jumping in severely affected areas. Photo courtesy of Keri Gee.[\/caption]\r\n\r\n<strong>3) When driving to and from school<\/strong>\r\n\r\n<span style=\"color: #545454;\">— <\/span>Don't drive over the speed limit, and avoid sharp turns and stops. Yes, this is the law, but it is extra important to remember this while rushing to get to school on time.\r\n\r\n<span style=\"color: #545454;\">— <\/span>Beware of hydroplaning, which occurs when a layer of water between your tires and the road causes your vehicle to skid, resulting in a possible loss of control. Here are <a href=\"https:\/\/www.rightturn.com\/tire-safety\/hydroplaning\/what-to-do\/\">instructions on what to do<\/a> if your car begins to hydroplane.\r\n\r\n<span style=\"color: #545454;\">— <\/span>Don't drive into flooded areas, ever. It is hard to tell how deep they are.\r\n\r\n<span style=\"color: #545454;\">— <\/span>Drive with headlights on for better visibility during the day if possible.\r\n\r\nDuring these times, it is important to stay alert in order to ensure the safety of both you and those around you. If it's any consolation, it's supposed to be mostly sunny this weekend, according to the <a href=\"http:\/\/forecast.weather.gov\/MapClick.php?lat=37.41776&amp;lon=-122.1235054&amp;lg=english&amp;FcstType=text&amp;TextType=2\">National Weather Service<\/a>.\r\n\r\n&nbsp;","excerpt":"A storm is set to begin later tonight and Palo Alto is currently on high wind warning, flash flood watch, and hazardous weather outlook. Here are some tips as to what to do during these times.","date":"2014-12-10 22:22:00","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/rsz_405064_10200296470633798_1605053619_n.jpg","categories":["Features","Spotlight"],"tags":{"11240":"emma chiu","8796":"jack anderson","8831":"Keri Gee","19302":"lydia barry","8944":"palo alto high school","8953":"paly","34179":"power","9027":"rain","34178":"storm","10249":"water","31353":"weather"}},{"id":80054,"title":"The final word on finals: A review of the resources","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/the-final-word-on-finals-a-review-of-the-resources\/","content":"As finals week approaches, Palo Alto High School students are starting to review for their semester exams. The Paly Voice investigated the resources available to Paly students, which include the library’s extended hours, tutoring by teachers in the Writing Center and free dinner for students staying late.\r\n\r\nPaly librarian Rachel Kellerman expects between 50 and 100 students to use the extended hours program.\r\n\r\n“This is our third year that we’ve done a late hours program, which was [started] in response to students wanting to work here late,\" Kellerman said.\r\n\r\nHover around the photo to learn more.\r\n\r\n<iframe src=\"\/\/www.thinglink.com\/card\/599001324889047042\" width=\"600\" height=\"600\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\nThe library, Student Center and Writing Center are open from 4 p.m. to 8 p.m., Monday through Thursday this week and Monday through Thursday next week. Dinner will be served in the Student Center between 5:30 p.m. and 6 p.m. each night.","excerpt":"As finals week approaches, The Paly Voice investigated the resources available to Paly students, such as the library’s extended hours, tutoring by teachers in the Writing Center and free dinner for students staying late.","date":"2014-12-09 18:47:51","author":"Maya McNealis","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_1776-copy.jpg","categories":["Features","Uncategorized"],"tags":{"34102":"extended hours","10172":"finals","33526":"first semester","8848":"Library","9045":"review","34116":"semester final","34117":"study","34115":"winter finals"}},{"id":79957,"title":"Students protest jury rulings on Quad","permalink":"http:\/\/palyvoice.com\/2014\/12\/09\/students-protest-jury-rulings-on-quad\/","content":"Palo Alto High School's Black Scholars United club arranged a peaceful protest today during Lunch on the Quad as a response to the recent Ferguson and Staten Island grand jury rulings.\n\nWhile protests were held in downtown Palo Alto on <a href=\"http:\/\/palyvoice.com\/2014\/11\/25\/ferguson-protesters-gather-at-palo-alto-city-hall\/\" target=\"_blank\">Nov. 25<\/a> and on <a href=\"https:\/\/www.facebook.com\/video.php?v=10152529283086305\" target=\"_blank\">Dec. 3<\/a> after grand juries ruled against indicting police officers Darren Wilson and Daniel Pantaleo, respectively, today was Paly's first student-led response to the grand jury decisions.\n\n[caption id=\"attachment_80045\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg\"><img class=\"wp-image-80045\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg\" alt=\"bsu\" width=\"350\" height=\"233\" \/><\/a> Palo Alto High School students in the Black Scholars United club hold signs on the Quad during Lunch. These posters read messages like \"#blacklivesmatter\" and \"I can't breathe.\" Photo by George Lu.[\/caption]\n\nStudents held signs with phrases such as \"When will this stop\" and \"Hands up, don't shoot\" and chanted \"No justice, no peace\" and \"Stop the violence.\" Unity Club members also drew chalk outlines of bodies, names of unarmed minorities who were killed by police officers and hashtagged catchphrases around campus.\n\nSenior Tiffany Fields, who held a sign saying \"My brother's keeper,\" told the crowd, \"Mike Brown could be my brother any day because he would put his hands up if someone's going to shoot him. Like Eric Garner, my brother is big, he's tall, and he could be choked to death because he is big – because he is intimidating, because of the color of his skin, and that's a problem for me.\"\n\nJunior Dami Bolarinwa's sign said, \"This is the United States. Are we truly united? This ain't a black thing, this ain't a white thing. It's all our problems.\"\n\n[soundcloud url=\"https:\/\/api.soundcloud.com\/tracks\/180759869\" params=\"color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false\" width=\"100%\" height=\"166\" iframe=\"true\" \/]\n\nSenior BSU co-president Jamina Kirkendoll wanted to promote awareness and a sense of unity within the community with this protest.\n\n\"The impact I was hoping for was to get this issue known on campus so that people can join, that black lives do matter, that we should support each other – it doesn't matter what skin color we are – that we are all together as one,\" Kirkendoll said.\n\nJunior Siggi Bengston said she believes that the youth play a crucial role in social issues.\n\n[caption id=\"attachment_80033\" align=\"alignright\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8522.jpg\"><img class=\"wp-image-80033\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8522.jpg\" alt=\"Paly's Black Scholars United senior co-president Jamina Kirkendoll led chants during the protest. Photo by George Lu.\" width=\"250\" height=\"375\" \/><\/a> Paly's Black Scholars United senior co-president Jamina Kirkendoll leads chants during the protest. Photo by George Lu.[\/caption]\n\n\"I don't think people realize how real racism is on Paly campus and people don't realize how serious this issue is,\" Bengston said. \"We have the means to change society, and it starts with us. We are the younger generation. If we don't do anything and we sit around and are silent, nothing is going to change.\"\n\nOnly a few other students joined the 15 or so BSU members in the protest, but Fields said that this was not a concern to the club.\n\n\"We [BSU] weren't expecting anything,\" Fields said. \"We were doing this for a cause that we wanted to support. We wanted to do it for ourselves to show everyone that we care.\"\n\nSenior Sabrina Goyal felt that the fact that the protest was on the Quad during Lunch lessened the effectiveness of the protest.\n\n\"I would say I'm kind of disappointed that it's only a small group [of protestors] because I feel like everyone kind of shares these views,\" Goyal said. \"I believe in what they're saying, but I don't feel comfortable going up there and standing with them. I think that's kind of a shame. I guess it [the protest] is a start.\"\n\nPaly librarian Rachel Kellerman said that more students should feel comfortable expressing themselves on campus.\n\n\"I think it's part of our democracy, and it's great that students can participate in this democracy,\" Kellerman said. \"Part of that is peaceful protests sanctioned by the administration or the government. ... That's a big part of democracy – to express yourself in a peaceful way. Frankly, I wish students would do more of that here to express themselves.\"\n\nJunior Ariya Momeny felt that the protest was not well-timed and said he believed that if the protest supported the officers in question, the school would not be as supportive.\n\n[caption id=\"attachment_80037\" align=\"alignleft\" width=\"250\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0197.jpg\"><img class=\"wp-image-80037\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_0197.jpg\" alt=\"Chalk outlines of bodies, phrases like &quot;Don't shoot&quot; and &quot;Black lives matter&quot; and names of unarmed minorities who have been killed by police officers were drawn around campus. Photo by Lizzie Chun.\" width=\"250\" height=\"334\" \/><\/a> Chalk outlines of bodies, phrases like \"Don't shoot\" and \"Black lives matter\" and names of unarmed minorities who have been killed by police officers were drawn around campus. Photo by Lizzie Chun.[\/caption]\n\n\"This is and could be interpreted as affecting my education because lunchtime is my only time that I can unwind, especially during this period when I'm studying for finals and am really stressed out,\" Momeny said. \"I don't personally mind, but I could totally see how someone could be offended by this. It's a question of the guidelines and rules of how this [protest] is allowed, but if I was protesting something that the school itself didn't like or wasn't completely accepted by people, I would get shut down.\"\n\n<em>Editor's note: The story was corrected on Dec. 10 to attribute the chalk-drawn outlines to the Unity Club, not the Black Scholars United club.<\/em>","excerpt":"Palo Alto High School's Black Scholars United club arranged a peaceful protest today during Lunch on the Quad as a response to the recent Ferguson and Staten Island grand jury rulings.","date":"2014-12-09 14:44:08","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/12\/IMG_8478.jpg","categories":["News","Spotlight"],"tags":{"34108":"ariya momeny","34103":"black scholars united","33962":"bsu","34106":"dami bolarinwa","33964":"daniel pantaleo","33958":"eric garner","33464":"ferguson","33961":"grand jury ruling","33465":"indictment","34104":"jamina kirkendoll","10167":"lunch","33462":"michael brown","33960":"mike brown","8944":"palo alto high school","33468":"peaceful","33467":"protest","9021":"quad","9025":"rachel kellerman","34107":"sabrina goyal","9102":"siggi bengston","33959":"staten island","34105":"tiffany fields","34180":"unity club"}}]