[{"id":70551,"title":"NHSJC Online News Package submission: Feeding the convention","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/nhsjc-online-news-package-submission-feeding-the-convention\/","content":"","excerpt":"Takaaki Sagawa and William Dougall's submission for the National High School Journalism Convention Online News Package contest.","date":"2014-04-11 15:33:47","author":"Takaaki Sagawa","categories":[],"tags":[]},{"id":70388,"title":"Next week dedicated to staff appreciation","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/next-week-dedicated-to-staff-appreciation\/","content":"As second semester begins to dwindle down, Palo Alto High School students will have an opportunity to get on their teachers' good sides with Staff Appreciation Week taking place next week April 14-18.\r\n\r\nAccording to Rebecca Fox, current president of the Parent Student Teacher Association, there will be a latte cart for the staff serving complimentary drinks on Wednesday.\r\n\r\nFox also encouraged students to participate in what she described as a Palo Alto tradition by either sending staff emails or dropping notes into teachers' baskets located in the front office.\r\n\r\n\"We are also encouraging parents and students to write letters of appreciation to teachers and staff,\" Fox said.\r\n\r\nIn addition, Fox said that there will be a luncheon held for staff on Friday.\r\n\r\n\"I certainly think it is well deserved and a good idea,\" Fox said.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"As second semester begins to dwindle down, Palo Alto High School students will have an opportunity to get on their teachers' good sides with Staff Appreciation Week taking place next week April 14-18.\r\n","date":"2014-04-11 09:51:48","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo.jpg","categories":["News"],"tags":[]},{"id":70392,"title":"Opinion: Put the arrest talk to rest","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/opinion-put-the-arrest-talk-to-rest\/","content":"<p dir=\"ltr\">Human curiosity is a completely normal tendency. So it is not surprising that following the release of a Palo Alto High School senior’s mugshot on several social media sites during the last days of spring break, the Paly community, along with the larger Palo Alto community, became captivated with searching for a better understanding of the situation.<\/p>\r\n<p dir=\"ltr\">Unfortunately, this search has led the community to gossip and make unfounded assumptions about the arrested student and his actions. This tendency has an even greater effect as the discussions are taking place not only on the Quad or between friends, but also in heated discussions online.<\/p>\r\n<p dir=\"ltr\">The comment sections of websites, such as Facebook in particular, are especially vile as members of the community get heated in their discussions. For example, the mugshot of the student arrested, which the Palo Alto Police Department <a href=\"https:\/\/www.facebook.com\/photo.php?fbid=664812860221181&amp;set=a.349604361742034.72544.288613124507825&amp;type=1&amp;stream_ref=10\">posted<\/a> on its Facebook page, contains racist and threatening comments and plenty of gossip and speculation. This kind of activity sparks rumors and spreads falsities that can negatively affect this student’s reputation. The student already will face repercussions for his actions, so there is no need to further antagonize the situation.<\/p>\r\n<p dir=\"ltr\">In addition to social media blasts, there is then the aspect of the face-to-face gossiping that occurs on Paly campus. Over the past week, Paly students have been telling a variety of different versions of the story, which twists the details of the actual occurrences and subsequently leads others to jump to false conclusions. By spreading these falsities the student body unnecessarily adds on to the problems of the student.<\/p>\r\n<p dir=\"ltr\">While I do not necessarily support the actions of the student, this treatment of the student is simply unacceptable. By resorting to such low methods as gossiping, spreading rumors and racist or threatening remarks, the community is portraying itself in a poor moral-light.<\/p>\r\n<p dir=\"ltr\">A more appropriate response would have included a way for the student to deal with the repercussions more privately without the community members sticking their noses into and judging the situation. In time, the true events of the situation will become apparent, so spreading false information in the mean time is just pointless. I believe that the Paly community can act much better than we are doing so now. We often pride ourselves on being a progressive and supportive high school and this is our opportunity to prove that we really do fulfill that description.<\/p>","excerpt":"Following the arrest of a Palo Alto high school senior over spring break, the Paly campus leaped into heated discussion. This discussion overstepped the line by making unfounded assumptions and spreading rumors. Read on to find out why this response was inappropriate.","date":"2014-04-11 07:34:20","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/photo-2.jpg","categories":["Opinion","Spotlight"],"tags":{"12970":"student arrest"}},{"id":70527,"title":"Former principal subject to disciplinary action, according to PA Weekly investigation","permalink":"http:\/\/palyvoice.com\/2014\/04\/11\/former-principal-subject-to-disciplinary-action-according-to-pa-weekly-investigation\/","content":"<div title=\"Page 5\">\r\n\r\n[caption id=\"attachment_70529\" align=\"alignright\" width=\"310\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg\"><img class=\"size-full wp-image-70529 \" alt=\"Former Principal Phil Winston speaking to a American Classics H class in   October, 2013. Photo by Grant Raffel.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg\" width=\"310\" height=\"259\" \/><\/a> Former Principal Phil Winston speaking to an American Classics H class in October 2013. Photo by Grant Raffel.[\/caption]\r\n\r\nThe Palo Alto Weekly released a <a href=\"http:\/\/www.paloaltoonline.com\/news\/2014\/04\/11\/ex-paly-principal-disciplined-for-harassment\">story<\/a> early Friday morning that contained information about the district's investigation into the behavior of former Palo Alto High School Principal Phil Winston.\r\n\r\nAccording to the Weekly's story, Winston, who is currently a special education teacher at Jordan Middle School, received a formal notice from the Palo Alto Unified School District lawyers on Aug. 13 stating that six student — and four staff — related incidences of misconduct would require him to take actions including \"refraining from using profanity, sexual comments and innuendo, and derogatory terms; commenting on the physical attributes and the dress of students or colleagues; having any physical contact with students or staff; and engaging in actions and language that are flirtatious or sexual in nature; as well as complete a sexual-harassment prevention training within 90 days.\"\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">\r\n<div title=\"Page 5\">According to the Weekly, Winston, who resigned from his position at Paly at the end of the 2012-13 school year citing health and personal reasons, was critical of the district's release of a packet to the Weekly that contained information regarding his unprofessional conduct.\r\n<div title=\"Page 28\">\r\n\r\n\"It is important to note that the statements and inferences contained in the packet lack context and are as a result highly misleading,\" Winston said to the Weekly. \"They inaccurately represent me and my character. In addition, they do not represent my performance over time, but rather highlight a short period of time during which I was under extreme pressure, stress and had personal challenges.\"\r\n\r\n<em>We will continue to cover this story as more information becomes available. <\/em>","excerpt":"The Palo Alto Weekly released a story early Friday morning that contained information about the district's investigation into former Palo Alto High School Principal Phil Winston.","date":"2014-04-11 07:32:39","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/pressconference1-310x259.jpg","categories":["News","Spotlight"],"tags":{"13735":"former principal","13736":"investigation","8944":"palo alto high school","8952":"palo alto weekly","8984":"Phil Winston","11609":"resignation"}},{"id":70324,"title":"Student arrest publicity brings petition, mixed reactions","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/student-arrest-publicity-brings-petition-mixed-reactions\/","content":"[caption id=\"attachment_70402\" align=\"aligncenter\" width=\"587\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg\"><img class=\" wp-image-70402  \" alt=\"The petition created by a Paly student on change.org requests the PAPD stop posting pictures of arrested offenders on Facebook and Twitter. Photo by Emma Chiu.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg\" width=\"587\" height=\"440\" \/><\/a> The petition created by a Paly student on change.org requests the PAPD stop posting pictures of arrested offenders on Facebook and Twitter. Photo by Emma Chiu.[\/caption]\r\n<p dir=\"ltr\">After the Palo Alto Police Department posted on its social media feeds the press release of the arrest of a Palo Alto High School student, members of the Paly community have responded with various reactions, including a petition.<\/p>\r\n<p dir=\"ltr\">The <a title=\"Press Release\" href=\"http:\/\/www.cityofpaloalto.org\/civica\/press\/display.asp?layout=1&amp;Entry=1051\">press release<\/a> was posted not only on the City of Palo Alto’s website, but also on the PAPD’s <a title=\"PAPD Facebook Page\" href=\"https:\/\/www.facebook.com\/PaloAltoPolice\">Facebook<\/a> and <a title=\"PAPD Twitter Page\" href=\"https:\/\/twitter.com\/PaloAltoPolice\">Twitter<\/a> pages. The direct inclusion of the student’s photo and full name (released because the student is 18 years old) sparked the creation of a petition Sunday night to “stop posting pictures of arrested offenders on Facebook and Twitter.” An excerpt from the description of the <a title=\"Stop posting pictures of arrested offenders on Facebook and Twitter\" href=\"http:\/\/www.change.org\/petitions\/palo-alto-police-department-stop-posting-pictures-of-arrested-offenders-on-facebook-and-twitter?share_id=svJHNAsBnd&amp;utm_campaign=autopublish&amp;utm_medium=facebook&amp;utm_source=share_petition&amp;v=control&amp;x=~open_graph_autopublish_experiment\">petition<\/a>, which had over 250 signatures as of this afternoon, reads as follows:<\/p>\r\n<p dir=\"ltr\"><em>The Press Releases should be kept only on the PAPD website and off social media sites. … The PAPD should continue to post Press Releases, but in the form of short, summarized posts. A link to the full Press Release in the post should be provided to those who want to learn more about the incident. This allows the PAPD to alert the community on incidents without posting distressing pictures, but still allowing for the interested to learn more.<\/em><\/p>\r\n<p dir=\"ltr\">According to the petition creator, Paly junior Fabian Garduño, the appeal was created after the recent Paly arrest out of concerns for psychological health effects of arrested offenders.<\/p>\r\n<p dir=\"ltr\">“There are people behind these photos that have their lives totally changed when these photos are put up because everyone sees them,” senior Will Hare said.<\/p>\r\n<p dir=\"ltr\">The general reaction Garduño has received regarding the petition has \"been mostly positive,\" Garduño said. \"A lot of people have signed it, and I'm hoping I can get above 500 signatures.\"<\/p>\r\n<p dir=\"ltr\">While students feel concern for the emotional well-being of their peers, many hold differing opinions on how the PAPD should maintain a consistency with the law.<\/p>\r\n<p dir=\"ltr\">“It’s just unfortunate that he [the arrested student] is still in high school, and since high school kids can be very judgmental, it's definitely disappointing,” junior Kelly Swanson said. “But ... you can’t really distinguish between what can and can’t be posted, so I think it is fair that if you are over 18, it [the offender’s information] is public and can be posted on Facebook.”<\/p>\r\n<p dir=\"ltr\">Junior Eliza Ackroyd also voiced her own sentiments on how to maintain a balance with social media.<\/p>\r\n<p dir=\"ltr\">“They [the PAPD] want their actions to be very transparent with the community, but I also think it’s important to preserve his [the arrested student's] privacy,\" Ackroyd said. \"I think it’s not fair for him to face the repercussions ... from the community … and publicizing the incident isn’t necessarily a good thing.”<\/p>\r\n<p dir=\"ltr\">Many students, including junior Seth Alston and sophomore Molly Kraus, agree that instead of having the PAPD completely cut off social media posts of criminals, alternative solutions can be found.<\/p>\r\n<p dir=\"ltr\">“If he was a suspect and people still needed to look out for someone who was still at large, I think that’s different,” Alston said. “But once it all happens and he’s already booked, I think it should be pretty much internal.”<\/p>\r\n<p dir=\"ltr\">Alternatively, Kraus believes that stories on arrested students should still be posted, as long as certain information is withheld.<\/p>\r\n<p dir=\"ltr\">“I think that both the public and the police have the right to understand the information given to them,” Kraus said. “At the same time, I think that because he [the arrested student] is still a student, they [the PAPD] should hold his name and possibly just discuss the charges and the fact there was a student at Palo Alto High School who did this.”<\/p>\r\n<p dir=\"ltr\">[poll id=\"2\"]<\/p>","excerpt":"After the Palo Alto Police Department (PAPD) posted on its social media feeds the press release of the arrest of a Palo Alto High School student, members of the Paly community have responded with various reactions including a petition.","date":"2014-04-10 20:59:40","author":"Emma Chiu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo-1-3.jpg","categories":["News","Spotlight"],"tags":{"13028":"daiki minaki","13034":"eliza ackroyd","13032":"fabian garduno","13031":"kelly swanson","13035":"molly kraus","8944":"palo alto high school","10178":"palo alto police","8953":"paly","13029":"paly student arrest","13030":"PAPD","13033":"petition"}},{"id":70462,"title":"Administration implements new system for teacher adviser selections","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/administration-implements-new-system-for-teacher-adviser-selections\/","content":"<p dir=\"ltr\" id=\"docs-internal-guid-28df9e87-4d7b-ab08-e2e2-93910ff67bd3\">Palo Alto High School freshmen will be the first to partake in a newly implemented selection process for their sophomore-to-senior-year teacher advisers on April 17 during advisory.<\/p>\r\n<p dir=\"ltr\">According to Assistant Principal Kathleen Laurence, the new system strives to better pair students with TAs through computer-conducted surveys that will match similar interests of students and advisers.<\/p>\r\n<p dir=\"ltr\"> \"The ninth grade students grade students will take a survey, and the TAs will take a survey. ... That [the result of the survey] is what we will base the system off of,” Laurence said.<\/p>\r\n<p dir=\"ltr\">The administration has been discussing the plans for a new selection process for two years in an effort to accommodate growing class sizes, according to Laurence.<\/p>\r\n<p dir=\"ltr\">“The school’s getting a lot bigger,\" Laurence said. \"We're finding that we’re not being able to give students their first choice, and this seemed like a much more efficient way for students.”<\/p>\r\n<p dir=\"ltr\">This system is also aimed to better match students with their advisers, adviser and English teacher Julia Taylor said.<\/p>\r\n<p dir=\"ltr\">“[The new system is] responding to student requests to have a TA that shares their interests, so that was why the change came about,” Taylor said. “A lot of freshmen often said that when they were choosing from just the picture and little paragraph that they didn’t really know anything about that person.”<\/p>\r\n<p dir=\"ltr\">According to Laurence, while changes are being put in place for the selection of  10th to 12th grade TAs, the random lottery selection for freshmen TAs will remain the same as it is now.<\/p>\r\n<p dir=\"ltr\">According to the handout given to freshmen during advisory today, students will be notified of their newly matched advisers at the beginning of next school year when their course schedules are also released.<\/p>\r\n<p dir=\"ltr\">The 10th to 12th grade advisers were also asked about their interests for the selection process, according to Taylor.<\/p>\r\n<p dir=\"ltr\">“We [10th to 12th grade TAs] answered one question that had a number of options on it about what kind of things we’re interested in,” Taylor said.<\/p>\r\n<p dir=\"ltr\">Taylor said that she thinks the system will work well.<\/p>\r\n<p dir=\"ltr\">“I think it [the switch to the new system] will be great,” Taylor said. \"[Students will be able] to pick a TA that has similar interests.\"<\/p>\r\n<p dir=\"ltr\">Junior Eric Lu has a more skeptical view of the new system.<\/p>\r\n<p dir=\"ltr\">“I think that people are going to try to game the system to get the advisers they want, and it won’t work out to their [the students'] advantage,” Lu said.<\/p>","excerpt":"Students of the Palo Alto High School freshmen class of 2017 will be the first to partake in a newly implemented selection process for their sophomore-to-senior-year teacher advisers on April 17 during advisory.","date":"2014-04-10 18:41:52","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/photo.jpg","categories":["News"],"tags":{"8721":"freshmen","13292":"new system","13290":"tas","13291":"teacher adviser"}},{"id":70420,"title":"ASB carries out last-minute preparations for record-breaking Prom","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/asb-carries-out-last-minute-preparations-for-record-breaking-prom\/","content":"[caption id=\"attachment_70429\" align=\"alignright\" width=\"423\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg\"><img class=\" wp-image-70429\" alt=\"image\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg\" width=\"423\" height=\"317\" \/><\/a> A banner promoting Prom with an image of the venue hangs on a fence at the Churchill parking lot on the Palo Alto High School campus. Photo by Takaaki Sagawa[\/caption]\r\n<p dir=\"ltr\">The Associated Student Body is working on final preparations for Prom, which will be held from 8 p.m. to midnight Saturday at the Exploratorium in San Francisco. According to ASB adviser Matt Hall, Prom ticket sales have reached the maximum number of 750, and the wait-list is growing.<\/p>\r\n<p dir=\"ltr\">ASB is currently making sure that the event preparations are proportional to the number of students attending the event, according to Hall.<\/p>\r\n<p dir=\"ltr\">“We’ve been talking with our event planner,” Hall said. “We have to keep them up to date so they can prepare enough food for 750 people … As the numbers change, the calculations change so to speak.”<\/p>\r\n<p dir=\"ltr\">There may be a chance for an increase in the maximum limit of attendees, however there is no guarantee or confirmation yet, according to Hall.<\/p>\r\n<p dir=\"ltr\">“It pretty much depends on the buses and the venue [capacity],” Hall said. “There are several kind of things that must fall in alignment and that determines our overall number of people who may attend prom.”<\/p>\r\nFor students attending Prom, Hall emphasizes that they remind themselves to arrive promptly to prevent any delay.\r\n\r\n“Main thing is time, make sure you get there,” Hall said. “We want them to be there no later than 5:45 p.m. If they want to take pictures with Lifetouch, they want to be there earlier, probably 5:30 p.m. or so because the photographers will be there from 5:30 p.m. to 6 p.m. and we’ll start loading the buses precisely at around 6 p.m. to 6:15 p.m.”\r\n\r\nMore information, including a map of the parking lot for students to find their bus, will be posted on the <a href=\"https:\/\/www.facebook.com\/palyasb\">ASB Facebook page<\/a>.","excerpt":"The Associated Student Body is working on final preparations for Prom, which will be held from 8 p.m. to midnight Saturday at the Exploratorium in San Francisco. ","date":"2014-04-10 14:33:22","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/image.jpg","categories":["News","Spotlight"],"tags":{"8496":"ASB","9016":"prom","13286":"sold out","9163":"ticket","13287":"wait-list"}},{"id":69653,"title":"Feature: What is Smash Bro club?","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/feature-what-is-smash-bro-club\/","content":"Ever seen a sign during Club Day that captures your interest enough to wonder what the club might be up to, but never had the time to find out? This is the story for you.\r\n\r\n[caption id=\"attachment_69737\" align=\"alignright\" width=\"450\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg\"><img class=\" wp-image-69737 \" alt=\"&quot;Super Smash Bros. Brawl&quot; by HeyGabe WW is licensed under CC BY 2.0.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg\" width=\"450\" height=\"253\" \/><\/a> \"Super Smash Bros. Brawl\" by HeyGabe WW is licensed under CC BY 2.0.[\/caption]\r\n\r\nPalo Alto High School sophomore Andy Kotik started the Smash Bro Club this year with Andrew Baer to get together and appreciate the Nintendo game <em>Super Smash Bros Brawl<\/em>.\r\n\r\n\"I hope to use this game [and] bring people together and have a good time,\" Kotic said.\r\n\r\nIt started off as a fun competition between the two friends, but ended up creating a club where people could play and share the joy together, according to Andy.\r\n\r\n\"It can create a little bit of tension, but most players don't let it get to them,\" Kotic said.\r\n\r\nVice president Baer agrees that competition is great.\r\n\r\n\"The players are really eager to play their tournament games and keep checking the brackets as it gets updated,\" Baer said.\r\n\r\n\"The competition really seems to help people connect and get to know each other,\" Baer said. \"Regardless of any trash talk we might spew out in the middle of the match\".\r\n\r\nIt is not all about playing together and the club is set to compete in mid-April against Los Altos High School in a crew battle according to Baer.\r\n\r\nThe game itself is a fighting game where various Nintendo characters come to fight it out, according to Kotic.\r\n\r\nKotic admits to being influenced by his older brother who founded a similar club two years ago.\r\n\r\n\"However, the idea didn't start developing until I saw a sign advertising Club Day II,\" Kotic said.\r\n\r\nThe game was released in 2008 and Andy got it the day of, he said.\r\n\r\nThe club meets on Wednesdays at lunch in room 204 and even people not necessarily interested in Super Smash Bros are welcome to come.\r\n\r\n\"We're an open, friendly community of people passionate about video games,\" Baer said.","excerpt":"Ever seen a sign during Club Day that captures your interest enough to wonder what the club might be up to, but never had the <a href=\"http:\/\/palyvoice.com\/2014\/04\/10\/feature-what-is-smash-bro-club\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-04-10 13:29:15","author":"Amanda Carlsson","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/03\/2369500057_fbcc82afdb.jpg","categories":["Features"],"tags":[]},{"id":70349,"title":"Robotics team places 22nd out of 58 at Silicon Valley Regional","permalink":"http:\/\/palyvoice.com\/2014\/04\/10\/robotics-team-places-22nd-out-of-58-at-silicon-valley-regional\/","content":"[caption id=\"attachment_70354\" align=\"aligncenter\" width=\"501\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg\"><img class=\"wp-image-70354   \" alt=\"The Palo Alto High School robotics team robot rolls onto the competition arena. At the Silicon Valley Regionals, the team placed 22nd out of 59 teams.\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg\" width=\"501\" height=\"333\" \/><\/a> The Palo Alto High School robotics team robot rolls onto the competition arena. At the Silicon Valley Regional, the team placed 22nd out of 58 teams. Photo by Chris Linn.[\/caption]\r\n<p dir=\"ltr\">The Palo Alto High School robotics team ranked 22nd out of 58 teams at the Silicon Valley Regional over Spring Break in its final competition of the school year and is now preparing for next year's program.<\/p>\r\n<p dir=\"ltr\">At its <a href=\"http:\/\/palyvoice.com\/2014\/03\/13\/robotics-falls-short-in-first-competition\/\">previous tournament<\/a>, the Central Valley Regional, the team placed 44th out of 45 teams. Following the Silicon Valley Regional, the team is happy to have improved its ranking, according to senior co-captain Freddy Kellison-Linn.<\/p>\r\n<p dir=\"ltr\">“Generally the top 24 is where you want to be,” Kellison-Linn said. “We didn’t get picked for elimination rounds but given how we performed at the previous competition everyone was very happy with how we did and it was a good end to the season.”<\/p>\r\n<p dir=\"ltr\">Sophomore Claire Kokontis said the team came across a few obstacles, including a part of the robot that was scratching the ball, the object that the robot was meant to shoot into baskets, throughout the competition.<\/p>\r\n<p dir=\"ltr\">However, it faced fewer problems than it did the last tournament, according to Kokontis.<\/p>\r\n<p dir=\"ltr\">“For a couple of members it was less stressful for us because there was less to fix so we got more time to just hang out with each other,” Kokontis said.<\/p>\r\n<p dir=\"ltr\">Kellison-Linn mirrors Kokontis’ sentiments, stating that the Silicon Valley Regional ran significantly smoother than the Central Valley Regional tournament for the team.<\/p>\r\n<p dir=\"ltr\">“We had an issue in Madera where we couldn’t get the shooter working until the very end, but for this competition we had our shooting working and we did significantly better than we did in Madera,” Kellison-Linn said.<\/p>\r\n<p dir=\"ltr\">The Paly robotics team is proud that its robot is built almost entirely by students, without much mentor help, according to Kokontis.<\/p>\r\n“It was really surprising for people at the competition to see this robot that had been mainly built by students,” Kokontis said. “That’s something that makes Paly robotics unique and that’s something that we’re proud of.”\r\n\r\nThis is the final tournament for the Paly robotics team during this school year, but the team has much in store for the future including a summer camp program, teaching robotics to younger children and getting ready for the Cal Games tournament during the fall.","excerpt":"The Palo Alto High School robotics team ranked 22nd out of 58 teams at the Silicon Valley Regional over Spring Break in its final competition of the school year and is now preparing for next year's program.","date":"2014-04-10 13:08:30","author":"Addie McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/robot.jpg","categories":["News","Spotlight"],"tags":[]},{"id":70352,"title":"Preview: Boys’ lacrosse to face off against Sacred Heart","permalink":"http:\/\/palyvoice.com\/2014\/04\/08\/preview-boys-lacrosse-to-face-off-against-sacred-heart\/","content":"The Palo Alto High School boys’ lacrosse team (6-3, 3-1) will play the Sacred Heart Preparatory team (7-3, 5-0), the first-place seed in the De Anza League, at 4 p.m. today at Sacred Heart.\r\n\r\nThe Paly Vikings lost to the Gators earlier this season, and were knocked out of the Santa Clara Valley Athletic League playoffs in the semi-finals by the Gators last year.\r\n\r\nSenior midfielder Zach Rizk, however, expects Paly to play well at the upcoming game.\r\n\r\n“Obviously, we’ve lost to Sacred Heart six times in a row now,” Rizk said. “We’d like to break that streak today. They have some great shooters, but we have a really balanced team. I think we have a better defense this year, and we’re looking to beat them this year.\"\r\n\r\nSophomore attack Matthew Seligson echoes Rizk's optimism.\r\n\r\n“We expect to win,” Seligson said. “They [Scared Heart] have got two great players, but we’re deep all around.”\r\n\r\nCurrently, Sacred Heart is ranked third in SCVAL and first in the De Anza League, while Paly is is ranked sixth in SCVAL and third in the De Anza League.  Both teams are expected to qualify for the playoffs.\r\n\r\n“We’re looking to go for number two seed at least, if not the number one seed,” Rizk said. “We’re on track for that right now with one loss.”\r\n\r\nThe Vikings will kick off against the Gators at 4 p.m. today at Sacred Heart.","excerpt":"The Palo Alto High School boys’ lacrosse team (6-3, 3-1) will play the first place De Anza League Sacred Heart Preparatory team (7-3, 5-0) at 4 p.m. today at Sacred Heart.","date":"2014-04-08 14:09:46","author":"Julia Asin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/11\/image_1.jpeg","categories":["Sports"],"tags":{"12015":"boys lacrosse","8836":"Lacrosse","8944":"palo alto high school","12968":"sacred heart preparatory","9120":"sports"}}]