[{"id":77180,"title":"Preview: Timeless fun for Generations Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/preview-timeless-fun-for-generations-day\/","content":"More than halfway through Spirit Week, Palo Alto High School students are preparing for \"Generations Day.\"\r\n\r\nFor Day Four of Spirit Week, students will dress up as babies, teeny boppers, sophisticates and senior citizens, in ascending class order.\r\n\r\n[caption id=\"attachment_77517\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6331.jpg\"><img class=\"wp-image-77517\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6331.jpg\" alt=\"Julia Kwasnick and Noam Shemtov, Class of 2014, competed in the best dressed contest for Generations Day. Photo by Liana Pickrell.\" width=\"350\" height=\"233\" \/><\/a> Julia Kwasnick and Noam Shemtov, Class of 2014, compete in the best dressed contest for \"Generations Day\" last year. Photo by Liana Pickrell.[\/caption]\r\n\r\nThe two rallies of the day will be held during lunch on the football field and during Advisory in the Big Gym. The lunch rally will include two new games this year: \"Mannequin Painting\" and \"Rapid Fire,\" according to the Associated Student Body's Spirit Week <a href=\"https:\/\/docs.google.com\/a\/palyvoice.com\/document\/d\/1bPEzIA7J8f9gzzhj8F6MBPIL22QhTcWecieUYFyMTGM\/edit?pli=1\" target=\"_blank\">master doc<\/a>.\r\n\r\nFor \"Mannequin Painting,\" four students from each grade must completely paint a white mannequin in their respective class color within three minutes with paintbrushes only. The scores for \"Mannequin Painting\" will be announced after the rally to give judges time to inspect the mannequins, and first place will receive 300 points.\r\n\r\n\"Rapid Fire\" involves two students from each grade knocking over 10 cans from a distance using rubber bands. The winners of this activity will earn 100 points.\r\n\r\nIn accordance with recent years, there will be a multi-round 3-point contest in the gym during Advisory, with one girl and one boy from each class competing. The shooter has to make as many 3-pointers as possible within a minute, and the winners from both genders will each earn 100 points for their grade.\r\n\r\nFreshman Adee Newman believes that the 3-point contest will fare better than rally activities so far for her class.\r\n\r\n\"In the 3-point contest, we're going to do pretty well because we have some really good basketball players, but tomorrow at the rally at lunch, I don't think we're going to do as well,\" Newman said. \"We haven't had that much success [so far], which isn't that good, but at least we tried – that's the thing that matters.\"\r\n\r\nAdditionally, Newman is excited for the baby-themed apparel.\r\n\r\n\"I'm looking forward for tomorrow for dressing up as a baby and being really comfortable,\" Newman said.\r\n\r\nJunior Bryn Sullivan said she has her sophisticates outfit planned out for Generations Day.\r\n\r\n\"We're sophisticates, so [I'm wearing a] black skirt, a blazer, a blue shirt, a leather handbag and a coffee mug,\" Sullivan said.\r\n\r\nWith the juniors maintaining the lead, the seniors hope to improve throughout the rest of the week.\r\n\r\n\"I think [because of] the Spirit Dance, float building and our improvement in cheers, the seniors will take the lead,\" senior Cary Faulkner said.\r\n\r\nMake sure to keep up with all things Spirit Week, including slideshows and point break-downs, by checking back with <a href=\"http:\/\/palyvoice.com\/spiritweek-2014\/\" target=\"_blank\">The Paly Voice<\/a>.\r\n\r\n&nbsp;","excerpt":"More than halfway through Spirit Week, Palo Alto High School students are preparing for \"Generations Day\" with new rally activities in store.","date":"2014-10-29 20:59:57","author":"Lizzie Chun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6331.jpg","categories":["Spirit Week 2014"],"tags":{"31302":"3 point","10098":"basketball","8729":"Generations day","31301":"mannequin painting","8944":"palo alto high school","9852":"rally","9119":"Spirit Week","27181":"spirit week 2014","9162":"Thursday"}},{"id":77566,"title":"Slideshow: Spirit Week Day Three","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/slideshow-spirit-week-day-three\/","content":"Day Three of Spirit Week kicked off with the \"Hula Hoop\" brunch rally, resulting in a senior victory. Juniors won the relay race at the lunch rally. Check back to The Paly Voice for more Spirit Week coverage.\r\n\r\n[slideshow post_id=77566]\r\n\r\n&nbsp;","excerpt":"Day Three of Spirit Week kicked off with the \"Hula Hoop\" brunch rally, resulting in a senior victory. Juniors won the relay race at the lunch rally.","date":"2014-10-29 20:03:56","author":"Amy Leung","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6435.jpg","categories":["Spirit Week 2014"],"tags":{"31304":"cheer","9717":"color day","8633":"Day 3","31303":"greens","31299":"hula hoop","9760":"juniors","8928":"Orange","9852":"rally","9033":"Red","9038":"relay race","9090":"seniors","9119":"Spirit Week","9244":"Yellow"}},{"id":77553,"title":"Video: Spirit Week Day Three","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/video-spirit-week-day-three\/","content":"The Paly Voice recapped Day Three of Spirit Week 2014, including a brunch and lunch rally. All grades participated in the \"Hula Hoop\" game during brunch, with the seniors getting their first win in an activity this week. The lunch rally followed with a \"Relay Race\", resulting in a junior win and seniors coming behind in second place. Click <a style=\"color: #31318c;\" href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">here<\/a><span style=\"color: #000000;\"> for the Palo Alto High School Associated Student Body’s master document for more information.<\/span>\r\n\r\n<iframe src=\"\/\/www.youtube.com\/embed\/_MFxqk6CoIQ\" width=\"560\" height=\"420\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice recaps the Day Three of Spirit Week.","date":"2014-10-29 17:53:23","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-29-at-5.23.33-PM.png","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","12701":"2014","31298":"balloon","9717":"color day","31276":"day three","31300":"first win","8745":"Green","31299":"hula hoop","31296":"junior win","8928":"Orange","9033":"Red","9038":"relay race","31297":"senior win","9119":"Spirit Week","9244":"Yellow"}},{"id":76959,"title":"Football preview: Vikings to host Santa Clara in homecoming game","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/football-preview-vikings-to-host-santa-clara-in-homecoming-game\/","content":"The Palo Alto High School football team (2-5, 1-2) will seek to rebound from last week's blow-out loss against the Los Gatos Wildcats (6-1, 3-0) as it hosts the Santa Clara Bruins (2-5, 0-3) this Friday at Hod Ray Field in the Paly homecoming game.\r\n\r\nAfter regaining confidence with a 41-35 victory at Monta Vista (1-6, 0-4) on Oct. 17, the Vikings were trounced right from the first snap last week, 49-7. The Wildcats outscored the Vikings 42-0 in the final three quarters, as the Vikings defense surrendered 256 rushing yards and five touchdowns on the ground. This week, head coach Jake Halas emphasized moving on from last week's disaster and focusing on the pass-heavy offense of Santa Clara.\r\n\r\n[caption id=\"attachment_77412\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o1.jpg\"><img class=\"size-full wp-image-77412\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o1.jpg\" alt=\"Junior receiver Oliver Svirsky cradles in a pass during the Vikings 20-19 loss against Wilcox. The Vikings return home this Friday to take on the Santa Clara Bruins. Photo by Josh Yuen. \" width=\"600\" height=\"321\" \/><\/a> Junior receiver Oliver Svirsky cradles in a pass during the Vikings 20-19 loss against Wilcox on Oct. 17. The Vikings return home this Friday to take on the Santa Clara Bruins. Photo by Josh Yuen.[\/caption]\r\n\r\n\"To win a football game, you have to be able to stop the run and run the ball,\" Halas said. \"Obviously, we had a heck of a time shutting down Los Gatos' running game. Having said that, we're playing a team that throws the ball 75 percent of the time, so even though they do have a running game, they throw the ball a lot. That's what we're focusing on more. But if they want to run the ball, we have to stop it.\"\r\n\r\nThe Bruins, still winless against league opponents, are coming off of a break-out 54-14 victory over the Lynbrook Vikings (0-7, 0-3) from the El Camino League. Despite a disappointing performance last week, junior wide receiver and captain Eli Givens said that the Vikings' mindset has not wavered from its winning attitude.\r\n\r\n\"We're just going to continue onto this week's game and forget about last week's,\" Givens said. \"Our mindset is to just win this week. Again, finish plays and make every play count and win.\"\r\n\r\nWhen asked about potential rainy weather forecasted for Friday evening, Halas said that his team is eager to build off of previous success that they have had in bad weather.\r\n\r\n\"We've had great success in bad weather games since I've been here,\" Halas said. \"I like it. The kids like it. We're looking forward to it.\"\r\n\r\nAlthough the contest will have a more ceremonial vibe to it due to homecoming activities, Givens accentuated that the team is treating it just like any other game.\r\n\r\n\"It's just another game to play,\" Givens said. \"It's another chance to get the W [win].\"\r\n\r\nThe Vikings and Bruins kick off at 7 p.m. this Friday, Oct. 31 at Hod Ray Field. All fans are encouraged to wear as much black as they can to display their Paly spirit, according to senior Livi Clarissa Musil. If you are not going to be at the game due to Halloween festivities, check The Paly Voice Friday night for our liveblog of the game.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School football team (2-5, 1-2) will seek to rebound from yet another blow-out loss against the Santa Clara Bruins (2-5, 0-3) this Friday at Hod Ray Field in the Paly \"black-out\" homecoming game.","date":"2014-10-29 17:33:07","author":"Josh Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/10722247_771709889553738_1626690407_o.jpg","categories":["Sports","Spotlight"],"tags":[]},{"id":77476,"title":"Pearl milk tea comes to Palo Alto from Taiwan&#8217;s T4","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/pearl-milk-tea-comes-to-palo-alto-from-taiwans-t4\/","content":"[caption id=\"attachment_77487\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_0813.jpg\"><img class=\"wp-image-77487\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_0813.jpg\" alt=\"Many Palo Alto High School students visited T4 for it's grand opening. Palo Alto has never had as good PMT as Mountain View, so Paly students are excited to taste T4. Photo by Alex Merkle-Raymond\" width=\"300\" height=\"400\" \/><\/a> Many Palo Alto High School students, including freshmen Chris Jawetz and Sam Kim, visited T4 for its grand opening. Palo Alto has never had as good PMT as Mountain View, so Paly students are excited to taste T4. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\nT4, Palo Alto's only solely Pearl Milk Tea shop, hosts its grand opening today at 165 University Ave.\r\n\r\nT-4 has other locations around the Bay Area, including San Leandro and Fremont. The T4 brand started in Taiwan in 2004 and is working its way around the globe, according to its <a href=\"http:\/\/www.t4.com.tw\/en\/about.php#a1\" target=\"_blank\">website<\/a>.\r\n\r\nT4 replaced the Loving Hut, which went out of business at the beginning of the school year. Loving Hut served PMT while it was in business, but it was vegan and had very few flavor options.\r\n\r\nMany Palo Alto High School students have been impatiently waiting for a PMT place in Palo Alto.\r\n\r\n“It's hard to be environmentally friendly when you have to drive all the way to Mountain View to get a quality PMT drink,\" sophomore Nathaniel Hancock said. \"It also would take up a large amount of a day that could be spent doing homework or socializing.\"\r\n\r\n<em>What I ordered:<\/em> <del><\/del>Large Jasmine Pearl milk tea with extra pearls ($4.89)\r\n\r\n<em>Overall Rating:<\/em> 7.5\/10\r\n\r\n[caption id=\"attachment_77486\" align=\"alignright\" width=\"300\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_0811.jpg\"><img class=\"wp-image-77486\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_0811.jpg\" alt=\"T4 has a lot of customer options for sweetness and ice amounts. Next time, I would order less sweetness because it was very sweet. Photo by Alex Merkle-Raymond \" width=\"300\" height=\"400\" \/><\/a> T4 has a lot of customer options for sweetness and ice amounts. Next time, I would order less sweetness because it was very sweet. Photo by Alex Merkle-Raymond[\/caption]\r\n\r\n“I liked to get PMT at Loving Hut too, but this is better since they specialize in it,\" junior Rowan Lee said. \"One thing I wished they [T4] would change is that they should have pearls with flavors.\"\r\n\r\nT4 has two sizes: small and regular. The menu provides the customer with a variety of options. For example, both the ice and sweetness levels can be adjusted from the standard to be at 30 percent or 80 percent.\r\n\r\nI personally got the standard amounts and found it a little sweet. The pearls are fairly large and very soft. The drink itself is not very thick and creamy, but the tea flavor is not overpowering.\r\n\r\nThe current Palo Alto location is very clean and has a blue color theme around the entire restaurant. There is room for seating, and it is easy to see into the back work area where the drinks are made.\r\n\r\nThe staff is very friendly and can answer any questions. Manager Miki Murphy was excited to mention that all tea is brewed on site and changed out every hour, even if it not used up completely.\r\n\r\nT4 is currently scheduled to be open from 11 a.m. to 11 p.m. and currently does not have a significant line.\r\n\r\n“It’s delicious. It’s about time we had [a Pearl Milk Tea place] in Palo Alto,” junior Eli Craveiro Frankel said.\r\n\r\n&nbsp;","excerpt":"T4 Pearl Milk Tea celebrated it's grand opening on University Avenue today. T4 is the main PMT place in Palo Alto and specializes in natural tea drinks and customer options. ","date":"2014-10-29 17:28:52","author":"Alex Merkle-Raymond","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_0804.jpg","categories":["The ultimate PMT challenge"],"tags":{"30882":"Alex","29703":"boba","27710":"grand opening","29705":"pearl milk tea","29704":"pmt","31268":"t-4","31270":"t4","31269":"taiwan"}},{"id":77541,"title":"Storify: Spirit Week Day Three as seen through the eyes of students","permalink":"http:\/\/palyvoice.com\/2014\/10\/29\/storify-spirit-week-day-three-as-seen-through-the-eyes-of-students\/","content":"<div class=\"storify\">\r\n<div class=\"storify\">\r\n<div class=\"storify\">Follow this year's Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts!\r\n<div class=\"storify\">\r\n<div class=\"storify\"><iframe src=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-three\/embed?header=false&amp;border=false\" width=\"100%\" height=\"750\" frameborder=\"no\"><\/iframe><script src=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-three.js?header=false&amp;border=false\"><\/script><noscript>[<a href=\"\/\/storify.com\/palysandiego\/spirit-week-2014-day-three\" target=\"_blank\">View the story \"Spirit Week 2014 Day Three\" on Storify<\/a>]<\/noscript>\r\n\r\n\r\n\r\n","excerpt":"Follow Day Two of Spirit Week with a collection of the Palo Alto High School community's #palyspirit posts.","date":"2014-10-29 15:41:36","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2013-10-23-at-2.41.27-PM.png","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","12701":"2014","30024":"3","31277":"color","9717":"color day","31276":"day three","8745":"Green","30939":"instagram","8928":"Orange","9033":"Red","30938":"social media","9119":"Spirit Week","30934":"storify","29808":"twitter","9244":"Yellow"}},{"id":77371,"title":"Preview: Spirit Week in full swing as &#8220;Color Day&#8221; approaches","permalink":"http:\/\/palyvoice.com\/2014\/10\/28\/preview-spirit-week-in-full-swing-as-color-day-approaches\/","content":"[caption id=\"attachment_42822\" align=\"alignnone\" width=\"419\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_5219.jpg\"><img class=\" wp-image-42822\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2012\/10\/IMG_5219.jpg\" alt=\"The Freshman dressed in orange, their class color, cheer during the rally at lunch. Photo by Phoebe So.\" width=\"419\" height=\"275\" \/><\/a> The Class of 2016 cheers while dressed in orange, the freshman class color, during the lunch rally at Spirit Week last year. Photo by Phoebe So.[\/caption]\r\n\r\nPalo Alto High School students are gearing up to dress inn their respective classes' color for \"Color Day\" on Day Three of Spirit Week tomorrow.\r\n\r\nEach class will wear their respective colors: seniors will wear green, juniors will wear yellow, sophomores will wear red and freshmen will wear orange.\r\n\r\nTomorrow's activities include two rallies: one during brunch and one during lunch. The brunch rally features a hula hoop game, which involves passing a hoop in between people holding hands in a line as fast as possible. The first team to get the hoop across the line and back wins and earns 200 points. The lunch rally will feature a relay race, involving five separate stations tasks. Whichever grade finishes first wins will gain 400 points.\r\n\r\nSenior Hannah Nguyen has enjoyed Spirit Week so far and is excited for the next few days.\r\n\r\n\"I think seniors have the best themes,\" Nguyen said. \"I've had a lot fun dressing up in '90s gear and togas, and I'm really looking forward to Color Day.\"\r\n\r\nNguyen also has high hopes for the senior class despite the juniors' lead after the first two day's events.\r\n\r\n\"I think that our spirit could be stronger,\" Nguyen said. \"If we stay focused and energetic, we can definitely pull ahead.\r\n\r\nSophomore Andrea O'Riordan is also looking forward to Color Day.\r\n\r\n\"I'm really excited for all of the activities, especially the relay,\" O'Riordan said. \"I'm excited for all of Spirit Week. I think every activity is really fun to watch and participate in.\"\r\n\r\nO'Riordan is proud of her class so far.\r\n\r\n\"We've really improved,\" O'Riordan said. \"We're really spirited this week, and we're ready to come out and do well. We've come a long way.\"","excerpt":"Palo Alto High School students will dress by color for \"Color Day\" on Day Three of Spirit Week tomorrow.","date":"2014-10-28 22:45:44","author":"Ido Gal","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_5219.jpg","categories":["Spirit Week 2014"],"tags":{"12701":"2014","9717":"color day","9852":"rally","9119":"Spirit Week"}},{"id":77372,"title":"Spirit Week Day Two results","permalink":"http:\/\/palyvoice.com\/2014\/10\/28\/spirit-week-day-two-results\/","content":"<p>At the conclusion of the second day of Spirit Week, Salad Dressing Day, the juniors maintain their lead over the seniors. View official scores on ASB’s <a href=\"https:\/\/sites.google.com\/site\/pahsasb\/sw2014\">website<\/a>.<br \/>\r\n<iframe style=\"overflow-y: hidden;\" src=\"https:\/\/magic.piktochart.com\/embed\/3168706-spirit-week-2014-day-2\" width=\"600\" height=\"930\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\r\n","excerpt":"At the conclusion of the second day of Spirit Week, Salad Dressing Day, the juniors maintain their lead over the seniors. View official scores on ASB’s website.","date":"2014-10-28 21:16:23","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6810.jpg","categories":["Spirit Week 2014"],"tags":{"9700":"#palyspirit","9119":"Spirit Week","27181":"spirit week 2014","31193":"spirit week day 2 scores"}},{"id":77392,"title":"Juniors maintain lead: Day Two recap","permalink":"http:\/\/palyvoice.com\/2014\/10\/28\/juniors-maintain-lead-day-two-recap\/","content":"[caption id=\"attachment_77462\" align=\"aligncenter\" width=\"500\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_0261.jpg\"><img class=\"wp-image-77462\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_0261.jpg\" alt=\"The juniors tugged their class all the way to a 1st place victory in tug-of-war during the Day Two rally. Photo by Saba Moussavian. \" width=\"500\" height=\"333\" \/><\/a> The juniors tugged their class all the way to a first place victory in tug-of-war during the Day Two rally. Photo by Saba Moussavian.[\/caption]\n\nThe junior class maintains its lead on \"Salad Dressing\" day after securing first place in the tug-of-war event during the lunch rally for Palo Alto High School’s Spirit Week activities.\n\n[caption id=\"attachment_77433\" align=\"alignright\" width=\"194\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-28-at-2.36.06-PM.png\"><img class=\"wp-image-77433\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-28-at-2.36.06-PM.png\" alt=\"The sophomore class set up hay bales on the Quad to represent their Ranch dressing theme. Photo by Chloe Fishman. \" width=\"194\" height=\"209\" \/><\/a> The sophomore class set up hay bales on the Quad to represent their Ranch dressing theme. Photo by Chloe Fishman.[\/caption]\n\nDay Two started off with a decorative morning on the Quad. The junior class covered an area of the Quad with inflatable pools and palm trees along with beach chairs and toys to represent its Thousand Islands dressing theme. With the theme of Ranch dressing, the sophomore class added to the spirit by placing hay bales on the Quad.\n\nPaly students made their way to the football field for the tug-of-war competition during lunch. In the first round, the senior class dominated the freshman class, advancing to the winner's bracket. In the second round, the juniors steadily overcame the sophomore class to advance to the winner's bracket as well.\n\nIn the fight for third place, the sophomores barely defeated the ultimately fourth place freshman after an intense match.\n\nSophomore Jackson Dahl has high hopes for his class's final Spirit Week ranking.\n\n\"We just put our hearts into it, and I think we're going to win,\" Dahl said. \"We probably could've done better [in tug-of-war], but we were missing our strongest players.\"\n\nFreshman Ole Erickson felt that his class's performance was disappointing.\n\n[caption id=\"attachment_77434\" align=\"alignright\" width=\"285\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-28-at-2.35.50-PM.png\"><img class=\"wp-image-77434\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/Screen-Shot-2014-10-28-at-2.35.50-PM.png\" alt=\"A group of junior boys crouch by their Hawaiian Island dressing themed decorations on the Quad. Photo by Chloe Fishman.\" width=\"285\" height=\"251\" \/><\/a> A group of junior boys crouch by their Hawaiian Island dressing themed decorations on the Quad. Photo by Chloe Fishman.[\/caption]\n\n\"I hope that tomorrow more people will come out and support,\" Erickson said.\n\nFreshman Philip Ericsson echoed these sentiments.\n\n\"I think we need to work on our cheers,\" Ericsson said.\n\nTo claim the overall victory of first place, the junior class was able to triumph over the seniors, who took second place.\n\nJunior Britt d'Arezzo expressed her satisfaction with the junior class's performance today.\n\n\"I think we brought our 'A' game. We gave it 100 percent, and it paid off,\" d'Arezzo said. \"Tug-of-war was great.\"\n\nSenior participant of the tug-of-war, Michael Pappas, is looking at the positives and trying to help the senior class as much as he can.\n\n\"I'm not exactly proud, but it's better than last place,\" Pappas said. \"I'm looking at the glass half full. I'm just trying to go out there and do a good job for my team.\"\n\nToday’s scores will be posted by ASB after float building tonight. Keep checking The Paly Voice for more Spirit Week related information to come.\n\n&nbsp;","excerpt":"The junior class maintains its lead on \"Salad Dressing\" day after securing first place in the tug-of-war event.","date":"2014-10-28 20:45:17","author":"Claire Krugler","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/DSC_0261.jpg","categories":["Spirit Week 2014","Spotlight"],"tags":[]},{"id":77438,"title":"Slideshow: Salad Dressing Day","permalink":"http:\/\/palyvoice.com\/2014\/10\/28\/slideshow-salad-dressing-day\/","content":"Spirit Week continued today with \"Salad Dressing\" Day at Palo Alto High School. During the lunch rally, students participated in a game of tug-of-war, resulting in a junior class win. For more information about today's events, <a href=\"http:\/\/palyvoice.com\/2014\/10\/27\/spirit-week-to-continue-with-salad-dressing-day\/\">click here<\/a>.\r\n\r\n[slideshow post_id=77438]","excerpt":"Spirit Week continued today with \"Salad Dressing\" Day at Palo Alto High School. During the lunch rally, students participated in a game of tug-of-war, resulting in a junior class win.","date":"2014-10-28 16:26:40","author":"Saba Moussavian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/10\/IMG_6788.jpg","categories":["Spirit Week 2014"],"tags":{"31272":"day two","8944":"palo alto high school","31271":"salad dressing day","9107":"slideshow","9119":"Spirit Week","27181":"spirit week 2014"}}]