[{"id":72150,"title":"Mandatory meeting for incoming AP Lit students at lunch on May 19 in the ERC","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/mandatory-meeting-for-incoming-ap-lit-students-at-lunch-in-the-erc-on-may-19\/","content":"","excerpt":"","date":"2014-05-18 13:24:58","author":"Charles Yu","categories":["Ticker"],"tags":[]},{"id":72148,"title":"Senior baccalaureate on May 25 at the Flint Center in Cupertino","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/senior-baccalaureate-on-may-25-at-the-flint-center-in-cupertino\/","content":"","excerpt":"","date":"2014-05-18 13:20:20","author":"Lizzie Chun","categories":["Ticker"],"tags":{"19372":"baccalaureate","19373":"flint center","9090":"seniors"}},{"id":72146,"title":"Mandatory meeting for Link Crew applicants at lunch on May 21 in the ERC","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/mandatory-meeting-for-link-crew-applicants-at-lunch-on-may-21-in-the-erc\/","content":"","excerpt":"","date":"2014-05-18 12:37:57","author":"Lizzie Chun","categories":["Ticker"],"tags":{"8852":"Link Crew"}},{"id":71978,"title":"Boys&#8217; lacrosse season ends in 11-10 loss to M-A in SCVAL semifinal","permalink":"http:\/\/palyvoice.com\/2014\/05\/18\/boys-lacrosse-season-ends-in-11-10-loss-to-m-a-in-scval-semifinal\/","content":"[caption id=\"attachment_72088\" align=\"alignnone\" width=\"767\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5144.jpg\"><img class=\"wp-image-72088\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5144.jpg\" alt=\"IMG_5144\" width=\"767\" height=\"511\" \/><\/a> Senior midfielder Jordan Gans sprints down the field alongside a Menlo-Atherton player during Wednesday's Santa Clara Valley Athletic League semifinal. The Vikings lost the game 11-10, ending their season. Photo by Addie McNamara.[\/caption]\r\n\r\nDespite a strong showing in the first quarter of the game, the Palo Alto High School boys' lacrosse team (13-7, 9-5) was unable to fend off a comeback from the Menlo-Atherton (13-11, 9-5) Bears in the Santa Clara Valley Athletic League semifinal on Wednesday, resulting in a 11-10 loss for the Vikings and an end to the team's season.\r\n\r\nThe Vikings pulled ahead quickly at the start of the game, with a 4-0 lead by the end of the first quarter. In the second quarter, however, M-A began its comeback, with the Vikings still leading 6-5 at half-time but reaching a 9-9 tie at the end of the third quarter.\r\n\r\n\"We came out unbelievably strong in the first quarter and fell apart in the second quarter,\" Paly coach DJ Shelton said.\r\n\r\nSenior midfielder Jordan Gans, who scored five goals for the Vikings throughout the game, echoed Shelton's sentiment that the second quarter was a turning point in the game.\r\n\r\n\"Second quarter is where we fell apart and they came back twice in the second and third quarter,\" Gans said. \"That's where we broke down and lost the game.\"\r\n\r\nIn the final quarter, M-A pulled ahead with two more goals, compared to Paly's one, ending the game 11-10 for M-A.\r\n\r\nAccording to Shelton, Paly lacked energy in the second half of the game.\r\n\r\n\"Second half was just kind of playing catch-up, not necessarily with the score but with random swings of energy,\" Shelton said. \"They definitely took it from us and we were just clawing our way back.\"\r\n\r\nPreviously, Paly had beaten M-A on two separate occasions throughout the season, and both Gans and Shelton attributed this game's loss to inadequate execution.\r\n\r\n\"We just had a couple of problems executing at the end,\" Shelton said. \"Everyone in this game had issues with consistency.\"\r\n\r\nHad it not been for lack of consistency, Gans said he feels that the team certainly had the strength to win the game.\r\n\r\n\"Everybody played really hard,\" Gans said. \"It wasn't a lack of effort, it was just a lack of execution. We could've won that game.\"\r\n\r\nThe loss marks the end of the Vikings' season, a disappointment for the team, according to Gans.\r\n\r\n\"It's really tough,\" Gans said. \"It was really disappointing. ... I would've loved to have played in the championship.\"\r\n\r\nShelton said the loss was not a result of any individual team member.\r\n\r\n\"This isn't a game about individuals,\" Shelton said. \"You win as a team and you lose as a team.\"","excerpt":"Despite a strong showing in the first quarter of the game, the Palo Alto High School boys' lacrosse team (13-7, 9-5) was unable to fend off a comeback from the Menlo-Atherton (13-11, 9-5) Bears in the Santa Clara Valley Athletic League semifinal on Wednesday, resulting in a 11-10 loss for the Vikings and an end to the team's season.","date":"2014-05-18 10:06:16","author":"Addie McNamara","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_5144.jpg","categories":["Sports","Spotlight"],"tags":{"12015":"boys lacrosse","19371":"DJ Shelton","8811":"jordan gans","8836":"Lacrosse","10306":"menlo-atherton","9078":"scval"}},{"id":71348,"title":"Review: &#8220;Amazing Spider-Man 2&#8243; catches audiences in its web","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/review-amazing-spider-man-2-catches-audiences-in-its-web\/","content":"[caption id=\"attachment_71373\" align=\"alignright\" width=\"350\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg\"><img class=\"wp-image-71373\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg\" alt=\"&quot;The Amazing Spider-Man 2&quot; is fun for all ages. It has exciting fighting scenes, fun characters and a cute love story. Photo by Columbia Pictures.\" width=\"350\" height=\"361\" \/><\/a> \"The Amazing Spider-Man 2\" is fun for all ages. It has exciting fighting scenes, fun characters and a cute love story. Photo by Columbia Pictures.[\/caption]\r\n\r\nBad guys, fighting scenes, a cute superhero and young love are just some of the things that makes \"The Amazing Spider-Man 2\" great for a movie night with friends. It is a fun movie that is definitely worth seeing as it is fun to watch and the ending will take you by surprise with its unexpected twist.\r\n\r\nAs a fan of the Spider Man series, starring Tobey Maguire, I had some concerns when I heard about a new adaptation of the movies in 2012. Tobey Maguire was a great choice for that role, so imagining someone else play Spider Man was sad. However, once I saw \"The Amazing Spider-Man,\" I instantly loved the new Peter Parker (Andrew Garfield) as well as Gwen Stacey (Emma Stone). Garfield was a perfect fit for the role with his initial shyness and later more extroverted personality that emerged as he put on the spider suit. Since I was so happy with the first movie, when I heard about \"The Amazing Spider-Man 2,\" I knew I had to see it.\r\n\r\nIn theaters now, \"The Amazing Spider-Man 2\" portrays Parker's struggle with pursuing his love interest, Stacey, figuring out the back story of his parent's leaving him as a child and, of course, stopping the criminals of New York. Parker and Stacey fell in love in the first movie, but in the new movie, his protectiveness of her leads to a tense relationship. Since Parker is Spider Man, Stacey would be a target for his enemies, and he does not want to be responsible for anything that could happen to her.\r\n\r\nIn the new movie, Spider Man is soaring through New York City, trying to catch yet another criminal when he saves the life of Max Dillon (Jamie Foxx) by pulling him out of the way of a moving vehicle. Dillon is very excited that someone notices him, later becoming obsessed with Spider Man. When Dillon is trying to fix a leak for his company, Oscorp, he falls into a tub of electric eels, transforming him into Electro, a man who gains the ability to control electricity. As Electro tries to become accustomed to his new powers, he develops a dislike for Spider Man, who he thinks is trying to hurt him.\r\n\r\nAnother enemy of Spider Man arises from Harry Osborn (Dane DeHaan). Osborn and Parker were friends when they were younger, but Osborn was sent to boarding school before Parker became Spider Man. When Osborn comes back to take over his father's multibillion-dollar company, Oscorp after his death, they rekindle their friendship. Upon realizing that he has a deadly genetic disease, Osborn decides he must figure out how to survive. When Spider Man refuses to help Osborn live, Osborn becomes angry with him and decides to take revenge. Through dangerously inserting spider venom into his blood, Osborn is able to live as he becomes the Green Goblin and tries to destroy Spider Man.\r\n\r\nWhile the plot is entertaining, Osborn's part seems unimportant toward the story. It is interesting that the writers brought in a friend from Parker's past, but once Osborn becomes evil, his role just seems like an unnecessary twist to the plot. The Green Goblin (Willem Dafoe) from the original Maguire series, had a better back story that set him up for the plot. Osborn's transformation into an evil villain seems thrown together with not much thought behind it.\r\n\r\nThe cinematography, by Daniel Mindel, is one of the most enjoyable parts of the movie. In the beginning of the film, Spider Man is going around over the city, flying back and forth. The way it was filmed makes it feel like the audience is flying through the city with him. Not only is it fun to watch, but it also lets the audience be a part of the action.\r\n\r\nDespite the problem I had with Osborn's character, I thoroughly enjoyed it and would suggest that people see \"The Amazing Spider-Man 2\". The great battle scenes and Spider Man flying around keep audiences stuck to their seats, while the adorable love story between Stacey and Parker pull at the audience's hearts, especially at the end.\r\n<p dir=\"ltr\"><b>The Amazing Spider-Man 2\r\n<\/b><\/p>\r\n<p dir=\"ltr\"><strong>2 hours 22 minutes<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Rated PG-13 for sequences of sci-fi action\/violence<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>Directed by Marc Webb<\/strong><\/p>\r\n<p dir=\"ltr\"><strong>With Andrew Garfield, Emma Stone, Jamie Foxx<\/strong><\/p>","excerpt":"Bad guys, fighting scenes, a cute superhero and young love are just some of the things that makes \"The Amazing Spider-Man 2\" great for a movie night with friends. It is a fun movie that is definitely worth seeing as it is fun to watch and the ending will take you by surprise with its unexpected twist.","date":"2014-05-15 13:45:12","author":"Julianna Heron","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/spider-man.jpg","categories":["Reviews"],"tags":{"17513":"amazing spider-man 2","17515":"andrew garfield","11885":"emma stone","17797":"jamie foxx","17517":"sally fields","17514":"spider-man","17798":"spiderman"}},{"id":71977,"title":"Girls&#8217; lacrosse to play Saratoga in finals","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/girls-lacrosse-to-play-saratoga-in-finals\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_72021\" align=\"aligncenter\" width=\"512\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg\"><img class=\"wp-image-72021\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg\" alt=\"The Palo Alto girls' lacrosse team huddles after their win against St. Francis. Photo by Molly Fogarty.\" width=\"512\" height=\"384\" \/><\/a> The Palo Alto girls' lacrosse team huddles after their win against St. Francis. Photo by Molly Fogarty.[\/caption]\r\n\r\nThe Palo Alto High School girls' lacrosse team (14-4) will take on Saratoga High School (14-5-1) in the Santa Clara Valley Athletic League final at 10 a.m. Saturday at Paly.\r\n\r\nThe Vikings are coming off a dramatic 10-9 win against the St. Francis Lancers (12-6) on Wednesday at St. Francis.\r\n\r\nThe Vikings have beat Saratoga twice in the regular season. The Falcons defeated Gunn High School (15-3) by a score of 9-8 in the semifinals on Wednesday to advance to the finals.\r\n\r\nJunior midfielder Paige Bara says she is proud of how the team's season has turned out.\r\n\r\n\"We are so incredibly excited to be going to the championships,\" Bara said. \"In the past we have struggled with beating Saint Francis in the playoffs so it feels pretty great to have finally accomplished that. I think we've really proven ourselves as a program and a team. Going into the season everyone thought we were the underdogs because we lost so many amazing seniors. But the fact that we've made it this far just proves how great of a team we have.\"\r\n\r\nComing into the playoffs, the Vikings were seeded third, even though they had more wins than St. Francis, the No. 2 seed. Saratoga, seeded fourth, beat the No. 1 seed Gunn, which was a big upset as Gunn had beaten Saratoga twice in the regular season.\r\n\r\nThe Vikings are going to the finals for the second year in a row, but last year they lost to St. Francis in triple overtime.\r\n\r\n\"I think we're all just so proud to have made it this far and Saturday is just going to be a test of how badly we really want it,\" Bara said. \"We know Saratoga is going to come out really hard and we have to really keep our focus if we want to become the SCVAL champions.\"\r\n\r\nThe Vikings will face Saratoga at 10 a.m. on Saturday at the El Camino Field.\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School girls' varsity lacrosse team (14-4) is preparing to take on Saratoga High School (14-5-1) in the Santa Clara Valley Athletic League final, which takes place at 10 a.m. Saturday at Paly.","date":"2014-05-15 13:41:45","author":"Callie Walker","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0850.jpg","categories":["Sports"],"tags":{"8736":"girls' lacrosse","8751":"gunn","8836":"Lacrosse","18836":"palo alto high school lacrosse","9063":"saratoga","18834":"scvals","18835":"semifinals","10253":"st. francis"}},{"id":71987,"title":"Boys and Girls Club to host Battle of the Bands","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/boys-and-girls-club-to-host-battle-of-the-bands\/","content":"[caption id=\"attachment_71989\" align=\"alignnone\" width=\"616\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png\"><img class=\"size-full wp-image-71989\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png\" alt=\"The Boys and Girls Clubs of the Peninsula are hosting their event on May 18 in the Fox Theatre. Flyer courtesy of Kathleen Xue.\" width=\"616\" height=\"389\" \/><\/a> The Boys and Girls Clubs of the Peninsula are hosting an event on May 18 in the Fox Theatre. Flyer courtesy of Kathleen Xue.[\/caption]\r\n\r\nThe Battle of the Bands event is being held to fundraise for the club’s art, music and enrichment programs.\r\n\r\nThe event will feature four bands from different high schools around the Bay Area, including PALP and Remi and Chloe from Palo Alto High School.\r\n\r\n“We are really excited about the event,” said Remi Wolfe, of Remi and Chloe. “It is going to be awesome to listen to and compete against the other bands.”\r\n\r\nIn addition to the high school bands, Ryan McDermott, a Paly grad and professional musician signed to G.O.O.D. Music, will be performing at the end of the night.\r\n\r\nThe event is organized by the Boys and Girls Club High School champions, a group of high school volunteers from around the peninsula.\r\n\r\nAlex Matthys, a junior at Gunn High School and volunteer drums instructor at the Boys and Girls Club of Redwood city, said he wants to help the kids have more opportunities to learn how to play music.\r\n\r\n“I've been working to expand the amount of access BGCP kids have to musical instruments, so I decided to fundraise for music with music,” Matthys said.\r\n\r\nTickets can be bought in advance on the Fox Theatre’s <a href=\"http:\/\/foxrwc.showare.com\/eventperformances.asp?evt=17\">website<\/a> for $20 or at the door for $25. For more information, please visit the Fox Theatre’s website or the event’s <a href=\"https:\/\/www.facebook.com\/events\/239421926249471\/?notif_t=plan_user_invited\">Facebook page<\/a>.","excerpt":"The Boys and Girls Clubs of the Peninsula will hold its Battle of the Bands event at 6 p.m. on Sunday, May 18 in the Fox Theater in Redwood City.","date":"2014-05-15 13:39:20","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.18.44-PM.png","categories":["News"],"tags":[]},{"id":71984,"title":"Paly girls&#8217; lacrosse ousts Saint Francis in semi-finals","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/paly-girls-lacrosse-ousts-saint-francis-in-semi-finals\/","content":"[caption id=\"attachment_71990\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\"><img class=\"size-full wp-image-71990\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg\" alt=\"The Palo Alto High School girls' lacrosse team poses for a post-victory picture. The Vikings triumphed over the Lancers, 10-9, and will face Saratoga in the finals on Saturday. Photo by Molly Fogarty.\" width=\"600\" height=\"450\" \/><\/a> The Palo Alto High School girls' lacrosse team poses for a post-victory picture. The Vikings triumphed over the Lancers, 10-9, and will face Saratoga in the finals on Saturday. Photo by Molly Fogarty.[\/caption]\r\n\r\nAfter a slow start, the Palo Alto High School girls’ lacrosse team (14-4) finished strong for a 10-9 victory at Saint Francis (12-7) to advance to the Santa Clara Valley Athletic League championship.\r\n\r\n“At first we were a little slow,” senior midfielder Kristen DeStefano said.  “We had to get things together, probably because of the heat.”\r\n\r\nHowever, after falling behind at halftime, Paly took over in the second half.\r\n\r\n“That second half was the best we have ever played,” DeStefano said.  “We really came together and we had so much momentum.”\r\n\r\nCoach Jamie Nesbitt appreciates her team’s ability to stay with it to the end.\r\n\r\n“We played really hard, and we didn’t let the amount of time we spent on defense dictate the pace of the game,” Nesbitt said.  “We kept up the energy through the end.”\r\n\r\nDeStefano believes the ability to win draws played a role in the Vikings’ late success.\r\n\r\n“When we had the momentum, we had several 10 second draws in a row that just kept us going,” DeStefano said.  “Next game, we want to do that right from the beginning.”\r\n\r\nSophomore midfielder Maya Benatar thinks the team underperformed.\r\n\r\n“We have played better,” Benatar said. “I think we are the better team and we didn’t completely show it today. We brought it when we needed to bring it and we took advantage when the momentum switched and that was enough to win.”\r\n\r\nNesbitt thinks the team will perform well on Saturday, when Paly takes on Saratoga in the SCVAL Championship.\r\n\r\n“I think there was a lot of emotion associated with this game,” Nesbitt said.  “Now we are in this confident space where we know we can take care of it [the game against Saratoga].  We have the advantage going into this next game of having depth on our bench, and the ability to move people around into different positions.”\r\n\r\nBenatar also expressed her confidence going into the championship.\r\n\r\n“We will bring what we really have to the finals on Saturday and it will be a more controlled win,” Benatar said.\r\n\r\nThe Vikings will take on Saratoga at 10 a.m. on Saturday at the Paly lacrosse field.","excerpt":"After a slow start, the Palo Alto High School girls’ lacrosse team (14-4) finished strong for a 10-9 victory at Saint Francis (12-7) to advance <a href=\"http:\/\/palyvoice.com\/2014\/05\/15\/paly-girls-lacrosse-ousts-saint-francis-in-semi-finals\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-15 13:38:31","author":"Jared Schwartz","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/LAXG.jpg","categories":["Sports Recap","Spotlight"],"tags":{"8736":"girls' lacrosse","8836":"Lacrosse","12016":"lax","10981":"win"}},{"id":71998,"title":"Voice Verbatim: Seniors&#8217; advice to Paly","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/voice-verbatim-seniors-advice-to-paly-2\/","content":"<div id=\"watch-description-text\">\r\n<p id=\"eow-description\">With graduation a mere 15 days away, The Paly Voice asked students of the Senior class of 2014 for any advice they could impart upon the Palo Alto High School community.<\/p>\r\n<iframe src=\"\/\/www.youtube.com\/embed\/WJB_J6pRJc0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n","excerpt":"With graduation a mere 15 days away, The Paly Voice asked students of the Senior class of 2014 for any advice they could impart upon the Palo Alto High School community.","date":"2014-05-15 13:29:13","author":"Noa Braun","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-13-at-10.30.31-PM.png","categories":["Multimedia","Spotlight","Video"],"tags":[]},{"id":71980,"title":"Voice Verbatim: What are your summer plans?","permalink":"http:\/\/palyvoice.com\/2014\/05\/15\/voice-verbatim-what-are-your-summer-plans\/","content":"<iframe src=\"\/\/www.youtube.com\/embed\/e_ZztnMS9ok\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Paly Voice asks: \"What are you doing over the summer?\"","date":"2014-05-15 13:12:26","author":"Maddy Jones","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-shot-2014-05-15-at-1.06.49-PM.png","categories":["Spotlight","Verbatims"],"tags":{"9137":"summer","18408":"summer plans","9201":"verbatim"}}]