[{"id":71361,"title":"Girls&#8217; lacrosse to celebrate senior night Thursday","permalink":"http:\/\/palyvoice.com\/2014\/05\/09\/girls-lacrosse-to-celebrate-senior-night-thursday\/","content":"The Palo Alto High School girls' lacrosse team (11-4) will be celebrating their senior night before their game against Los Gatos High School (7-7), at 6:40 p.m. Friday at home.\r\n\r\nSeniors will be presented to the crowd accompanied by their parents and siblings, with brief comments from their coach, Jamie Nesbitt.\r\n\r\nThe team is amped for the game against Los Gatos.\r\n\r\n\"We are very excited about the game on Friday,\" junior Paige Bara said.\r\n\r\nEvery senior night, the team tries to get each senior to score and this year, with only six seniors as opposed to last year's 12, it should be a capable task.\r\n\r\nBara expressed her sadness about losing the outgoing seniors.\r\n\r\n\"We have an amazing group of seniors that we all love so much,\" Bara said. \"We're a very close group this year and it's going to be very hard to see our seniors leave. It's going to be really sad to see our seniors play their last game at home, but we will always be a Paly lacrosse family even when they graduate.\"\r\n\r\nSenior Olivia Peeps has mixed emotions about the game.\r\n\r\n\"Senior night is going to be really fun,\" Peeps said. \"I'm really looking forward to the game. I think it's something everyone looks forward to. It's also going to be very sentimental, especially for the girls who have been on varsity for four years, like Kristen [DeStefano]. So everyone should come out and watch us.\"\r\n\r\nThe game will start at 7 p.m. following the ceremony honoring the seniors on Friday at the lacrosse field.","excerpt":"The Palo Alto High School girls' lacrosse team (11-4) will be celebrating their senior night before their game against Los Gatos High School (7-7), at 6:40 p.m. Friday at home.","date":"2014-05-09 17:56:07","author":"Callie Walker","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/photo.jpg","categories":["Sports"],"tags":[]},{"id":71241,"title":"Preview: Tim McGraw coming to Shoreline tomorrow","permalink":"http:\/\/palyvoice.com\/2014\/05\/09\/preview-tim-mcgraw-coming-to-shoreline-tomorrow\/","content":"If you missed Stagecoach, you're in luck with a local opportunity to hear from your favorite country musicians. Many Palo Alto High School students plan to put on their cowboys boots and kick off country concert season with Tim McGraw at 7 p.m. on May 10 at Shoreline Amphitheatre. Three-time Grammy award winner McGraw will be accompanied by his concert openers, Cassadee Pope and Kip Moore.\r\n\r\nMcGraw entered the music industry in the early 1990s and is still going strong. He has sold over 40 million albums, according to <a href=\"http:\/\/www.imdb.com\/name\/nm0005210\/\">IMDb<\/a>. His music has claimed the No. 1 spot on the Billboard Hot Country 100 chart over 20 times.\r\n\r\nOpening act Cassadee Pope is best-known for her victory on season three of the popular television series, The Voice, while Kip Moore is climbing up the ranks of country music since the release of his first album, Up All Night, in 2012.\r\n\r\nThis show will be the second of McGraw's summer-long, Sundown Heaven Town 2014 tour across the country. Tim McGraw and his openers' concerts have been very popular among Paly students in years past.\r\n\r\nSenior Hayley Tawzer went to Tim McGraw's concert at Shoreline last summer with a group of Paly friends.\r\n\r\n\"The concert was definitely a highlight of my summer,\" Tawzer said. \"I really like concerts at Shoreline, because it's nice to see friends from different schools on the lawn.\"\r\n\r\nJunior Kelly Swanson, well-known among her peers for her passion for country music, recently attended Stagecoach, an annual country music festival located in Indio. However, McGraw, Moore, and Pope did not perform at Stagecoach. She wants to attend the concert this weekend to hear the rest of her favorite country songs.\r\n\r\n\"I'm so excited that I will get to enjoy country music with all my Paly friends this time,\" Swanson said.\r\n\r\nJunior Corey Bicknell will attend the concert with Swanson.\r\n\r\n\"I look forward to the incredible music and seeing so many true country fans,\" Bicknell said.\r\n\r\nTickets are available online on sites such as <a href=\"http:\/\/www.stubhub.com\/tim-mcgraw-tickets\/tim-mcgraw-mountain-view-shoreline-amphitheatre-10-5-2014-4452766\/\">StubHub<\/a>, ranging from $50-60 for general admission on the lawn, $70-90 for seats in the upper concourse, and and $110-125 for seats in the lower concourse.","excerpt":"Students plan to attend Tim McGraw, Cassadee Pope, Kip Moore concert. ","date":"2014-05-09 14:58:58","author":"Chloe Fishman","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/600404_10201478646752475_1708804987_n.jpg","categories":["Entertainment"],"tags":{"17665":"corey bicknell","17667":"country concert","17779":"hayley tawzer","13031":"kelly swanson","17666":"tim mcgraw"}},{"id":71561,"title":"Pitcher&#8217;s one-hitter powers Paly by Wilcox","permalink":"http:\/\/palyvoice.com\/2014\/05\/08\/pitchers-one-hitter-powers-paly-by-wilcox\/","content":"[caption id=\"attachment_71577\" align=\"alignnone\" width=\"504\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0876.jpg\"><img class=\"wp-image-71577\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0876.jpg\" alt=\"Paly head coach Erik Raich talks it over during a Wilcox pitching change.  Paly went on to win the contest 5-0 and clinching a SCVAL championship series birth.\" width=\"504\" height=\"336\" \/><\/a> Paly head coach Erik Raich talks base-running strategy over with the team during a Wilcox pitching change. Paly went on to win the contest 5-0 and clinched a SCVAL championship series birth.  Photo by Matthew Fogarty.[\/caption]\r\n\r\nThe Palo Alto High School varsity baseball team won a 5-0 victory over Wilcox High School today on a one-hitter, propelling the Vikings into the Santa Clara Valley Athletic League championship series.\r\n\r\n“It’s nice to have the opportunity for another league title,” Paly head coach Erick Raich said.\r\n\r\nAfter this sweep against the Chargers Paly will advance to face either Los Gatos or Saratoga in a championship series next week.\r\n\r\nSmith, who issued three walks in the first three innings of the game, got help from his catcher, senior Austin Kron, who picked off two people in scoring position. He settled down in the latter half of the game and placed the ball where Wilcox failed to find a hit.\r\n\r\n“We’re a really good coaching staff when he pitches like that,” Raich said. “When he throws like that, it’s a pretty easy game.”\r\n\r\nSenior Bowan Gerould put the Vikings ahead with a two-run single in the third inning, which according to Raich, allowed Smith to attack the strike zone.\r\n\r\n“When we got a lead, it helped him be able to pitch a little more aggressive,” Raich said.\r\n\r\nThe Vikings added to their lead with a one-run single, and later a bases loaded single from sophomore Justin Hull.\r\n\r\nPaly’s next opponent is still to be determined, but the Vikings will take the extra day of rest Friday, and anticipate a 4 p.m. game Tuesday, location also to be determined.","excerpt":"The Palo Alto High School varsity baseball team won a 5-0 victory over Wilcox High School today on a one-hitter, propelling the Vikings into the <a href=\"http:\/\/palyvoice.com\/2014\/05\/08\/pitchers-one-hitter-powers-paly-by-wilcox\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-08 22:47:04","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0870.jpg","categories":["Sports Recap","Spotlight"],"tags":{"8410":"Baseball","17780":"boys baseball","10021":"paly sports","9200":"varsity"}},{"id":71452,"title":"Boys&#8217; tennis gears up for CCS after successful league season","permalink":"http:\/\/palyvoice.com\/2014\/05\/08\/boys-tennis-gears-up-for-ccs-after-successful-league-season\/","content":"The Palo Alto High School boys' tennis team (13-6) will take on Archbishop Mitty High School (15-5) in their first match of the Central Coast Section playoffs at 3 p.m. on Friday at home, after finishing third in the De Anza Division of the Santa Clara Valley Athletic League.\r\n\r\nHead coach Andy Harader is more than satisfied with the results of the league as well as the team's record outside of league matches.\r\n\r\n\"We went way beyond what we thought we would do,\" Harader said. \"We had successes against many of the real tough teams in our league, and we only lost one match outside of our league, so it speaks highly of our level of competition.\"\r\n\r\nJunior Kevin Huang reflected Harader's view, emphasizing the prestige of the league. Four teams from the league placed in the eight seeding spots for Central Coast Section, with Paly placing in the No. 8 seed.\r\n\r\n[caption id=\"attachment_71495\" align=\"alignright\" width=\"486\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-07-at-11.43.58-PM.png\"><img class=\"wp-image-71495\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/Screen-Shot-2014-05-07-at-11.43.58-PM.png\" alt=\"Boys' tennis CCS table\" width=\"486\" height=\"544\" \/><\/a> Paly will face Mitty tomorrow at home as they enter CCS in the second round with the 8th seeding.[\/caption]\r\n\r\n\"The league was really tight in points,\" Huang said. \"I think the top four or five places were really close, and we finished among the top five. A lot of the teams were around our level and posed a challenge. I think it's a learning experience every time we play in the league.\"\r\n\r\nPaly will enter in the second round of CCS to play against Mitty, who beat Sacred Heart Prep (12-10) in the first round of CCS on Wednesday.\r\n\r\n\"We played Mitty last year,\" senior Gabriel Mechali said. \"They weren't that great, but I think they've improved a lot since last year considering our record. They're definitely a solid team we shouldn't underestimate.\"\r\n\r\nWith a senior dominance in the squad, many are looking to make it a memorable CCS playoff.\r\n\r\n\"For most of us, this CCS will be our last one since more than half of the team are seniors,\" Mechali said. \"We're pretty excited for it, and we're going to try to go as far as we can.\"\r\n\r\nThe biggest threat of CCS, however, is Menlo School (17-3), which the team will possibly face in quarterfinals.\r\n\r\n\"Unfortunately, if we make it by Friday, the quarterfinals will be against the No. 1 seed and the national champion Menlo,\" Harader said. \"The chances of us winning that match are practically nil. We're outmatched in all seven spots, so the chance of us winning that [match] is practically non-existent.\"\r\n\r\nDespite the lack of hope for proceeding past the quarterfinals, the team believes facing Menlo would be a beneficial experience for all players.\r\n\r\n\"It's always fun to play against them,\" Huang said. \"I think it's a good learning experience for everyone who plays, especially since we're losing a lot people the next year. It might be good to play against the elite to see where we stand and what we need to improve on before the next season.\"\r\n\r\nThe Viking's first match of CCS against the Lions will start at 3 p.m. on Friday at Paly.","excerpt":"The Palo Alto High School boys' tennis team (13-6) will take on Archbishop Mitty High School(15-5) in their first match of the Central Coast Section playoffs at 3 p.m. on Friday at home.","date":"2014-05-08 22:19:07","author":"Takaaki Sagawa","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/smitty1.jpg","categories":["Sports","Spotlight"],"tags":{"11724":"boys tennis","8568":"CCS","11725":"Harader","17729":"Menlo","17730":"Mitty","9078":"scval","17731":"SHP","10016":"tennis"}},{"id":71347,"title":"Yearbook ready to go despite small Madrono staff","permalink":"http:\/\/palyvoice.com\/2014\/05\/08\/yearbook-ready-to-go-despite-small-madrono-staff\/","content":"[caption id=\"attachment_71522\" align=\"alignright\" width=\"400\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/unnamed1.jpg\"><img class=\"wp-image-71522\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/unnamed1.jpg\" alt=\"Sophomore Liam Noroian and junior Edward Chen work in the yearbook's computer lab. Palo Alto High School's yearbook staff plans to distribute the 2013-14 yearbook the week of May 20. &quot;It's going to be very colorful,&quot; Editor-in-Chief Sarah Limb, a senior, said. &quot;There's more autographing space.&quot; Photo by Allison Cowie.\" width=\"400\" height=\"300\" \/><\/a> Sophomore Liam Noroian and junior Edward Chen work in the yearbook's computer lab. Palo Alto High School's yearbook staff plans to distribute the 2013-14 yearbook the week of May 20. \"It's going to be very colorful,\" Editor in Chief and senior Sarah Limb said. \"There's more autographing space.\" Photo by Allison Cowie.[\/caption]\r\n\r\nAfter nearly a year of taking pictures, interviewing students and designing features, the yearbook staff is nearly ready to distribute copies of Madrono, Palo Alto High School's annual student yearbook.\r\n\r\nSenior Sarah Limb, who has held the position of Madrono's Editor in Chief since the fall of her sophomore year, has seen the yearbook class enrollment drop to low levels.\r\n\r\n\"In these past couple of years, the staff number has been declining, and it's been just enough to keep the class going,\" she said. Currently, only 19 students are enrolled in the course, but Limb said having nearly 30 members would be ideal.\r\n\r\nHowever, Limb hopes that with the opening of the new Media Arts Center, scheduled for the start of the 2014-15 school year, more students will sign up for the class.\r\n\r\n\"Because it [the class] is going to be in the new building next year, that's an incentive for people to join,\" Limb said. \"There are more resources, and if we increase numbers, we can increase sections [and] have more senior polls.\"\r\n\r\n<span class=\"Apple-style-span\">Sophomore Liam Noroian, who will lead the staff next year along with junior Edward Chen, agreed that the Media Arts Center should entice more people to join the staff.<\/span>\r\n\r\n<span class=\"Apple-style-span\">\"The new building offers a better working atmosphere,\" he said. \"It allows us to collaborate with other publications to acquire better information and resources ... [and it] <span class=\"Apple-style-span\">is fully equipped with interview rooms, kitchen and comfortable lounge area.<\/span>\"<\/span>\r\n\r\nEspecially with the new resources that come with the Media Arts Center, the yearbook class should be fun, according to Chen.\r\n\r\n<span class=\"Apple-style-span\">\"Yearbook [Madrono] creates memories that will last a lifetime,\" Chen said. \"Twenty years from now, as you glance back at your Madrono, you can proudly proclaim that you were a crucial part of the yearbook workforce.\"<\/span>\r\n\r\nNoroian agreed, highlighting the skills students learn throughout the course.\r\n\r\n<span class=\"Apple-style-span\">\"Yearbook provides a fairly laid back environment where people can learn basic photography, page design, and general organization,\" Noroian said. \"<span class=\"Apple-style-span\">All full year yearbook students receive a free yearbook, while half year students receive one for half price.\"<\/span><\/span>\r\n\r\nSenior Young-Ju Lee, who joined Limb as Co-Editor in Chief this year after serving as the Arts and Academics editor as a sophomore, said that if the staff gets much smaller, the quality of the book will decline.\r\n\r\n\"You're going to take out a lot of sections of the yearbook, like featured pages ... because there's no one there to work on it,\" Lee said. \"The senior section is definitely a lot of work, and if there aren't people there willing to work on it [it will shrink].\"\r\n\r\nLimb and Lee attributed the small class size to the muted presence Madrono has on campus throughout most of the school year.\r\n\r\n\"Yearbook's usually ... one of the publications that's not seen in the limelight as much, and because [of this], I think the journalism class feeds more into the other publications,\" Limb said.\r\n\r\n\"We only have one product that comes out at the very end of the year, and then every other publication comes out with monthly issues,\" Lee added. \"You only think about us at the end of the year and then it's too late.\"\r\n\r\nChen and Noroian are ready for the challenge of leading the staff, small or not, next year.\r\n\r\n<span class=\"Apple-style-span\">\"Edward and I are extremely happy to be leading the yearbook this coming year,\" Noroian said. \"We plan to make some changes involving how the staff goes about acquiring photos and designing our pages so that we can build another great yearbook. ... and there [will be] free food.\"<\/span>\r\n\r\nThis year's team has worked hard to create a polished finished product.\r\n\r\n\"It's going to be very colorful,\" Limb said. \"It's a little bit more creative than in years past. The yearbook cover [is made of a] different material; people might like that since we've had the same texture for the past three years.\"\r\n\r\n\"We're going to make it a fun yearbook,\" Lee said. \"That's what we told ourselves this whole year.\"\r\n\r\nIndividual copies of Madrono are tentatively scheduled to be available for seniors starting after school May 20 and for all other students starting May 21 by Room 101. More information will be distributed next week via class Facebook groups, Limb said.","excerpt":"After nearly a year of taking pictures, interviewing students and designing features while short-staffed, the yearbook staff is nearly ready to distribute copies of Madrono, Palo Alto High School's annual student yearbook.","date":"2014-05-08 14:01:23","author":"Allison Cowie","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/unnamed1.jpg","categories":["Editor's Pick","News"],"tags":{"8862":"Madrono","8944":"palo alto high school","17518":"paly madrono","9881":"sarah limb","17519":"young ju lee"}},{"id":71503,"title":"Vikings to host Wilcox in second game of series","permalink":"http:\/\/palyvoice.com\/2014\/05\/08\/vikings-to-host-wilcox-in-second-game-of-series\/","content":"[caption id=\"attachment_71519\" align=\"alignnone\" width=\"629\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_02141.jpg\"><img class=\"wp-image-71519\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_02141.jpg\" alt=\"The Palo Alto High School baseball field awaits Thursday's game between Paly and Wilcox High School.  Paly defeated the Chargers 6-5 at Wilcox Tuesday.\" width=\"629\" height=\"354\" \/><\/a> The Palo Alto High School baseball field, featured in this 2013 drone photograph, awaits Thursday's game between Paly and Wilcox High School. Paly defeated the Chargers 6-5 at Wilcox Tuesday.  Photo by Matthew Fogarty.[\/caption]\r\n\r\nThe Palo Alto High School baseball team will host Wilcox High School at 4 p.m. today for the chance to advance to the Santa Clara Valley Athletic League championship series.\r\n\r\n\"Today's game is very important,\" Paly's junior outfielder Phil Lewis said. \"To sweep Wilcox would be a huge momentum boost going into the championship series.\"\r\n\r\nThe Vikings will look to senior ace Chris Smith to get the job done.  Smith, who finished the regular season with a 1.12 earned run average, pitched a six-inning one-run gem in his only previous start against Wilcox this season.\r\n\r\nSmith said he will try to be consistent with what he has done all year.\r\n\r\n\"I just have to hit my spots and get people out,\" Smith said.\r\n\r\nPaly will also look to keep up their recent offensive production. Hot-hitting junior outfielder Phil Lewis went 3-4 in Tuesday's game raising his season average to .423.  The Vikings look to follow Lewis' example by executing in the same manner that they have in their most recent three-game winning streak.\r\n\r\n\"We need to execute and stick to our game plan,\" Lewis said.\r\n\r\nAlthough the Vikings did pile up nine hits in Tuesday's victory, a large portion of their offensive success can be attributed to the sloppy defense of the Charges, which accounted for four errors.\r\n\r\nDepending on the outcome of today's contest, the Vikings will either play Friday 4 p.m. at Wilcox or 4 p.m. next Tuesday at a location to be determined. If they win, they will play against the winner of the game between Saratoga High School and Los Gatos High School.  If they lose they travel to Wilcox for the rubber match to take the series.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Palo Alto High School baseball team will host the Wilcox High School Chargers at 4 p.m. Thursday for the chance to advance to the Santa Clara Valley Athletic League championship series.\r\n","date":"2014-05-08 13:39:06","author":"Matthew Fogarty","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0214.jpg","categories":["Baseball","Sports","Spotlight"],"tags":{"8410":"Baseball","17733":"chris smith","8944":"palo alto high school","17732":"phil lewis"}},{"id":70905,"title":"Five fun tricks to combat senioritis","permalink":"http:\/\/palyvoice.com\/2014\/05\/06\/five-fun-tricks-to-combat-senioritis\/","content":"[caption id=\"attachment_71249\" align=\"alignnone\" width=\"526\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg\"><img class=\"wp-image-71249\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg\" alt=\"Symptoms of senioritis may include spending excessive amounts of time playing 2048 instead of studying for Advanced Placement Psychology. Photo by Gavin Libbey.\" width=\"526\" height=\"394\" \/><\/a> Symptoms of senioritis may include spending excessive amounts of time playing 2048 instead of studying for Advanced Placement Psychology. Photo by Gavin Libbey.[\/caption]\r\n\r\nWith less than a month until graduation, who <em>really<\/em> wants to study for that calculus test second period tomorrow? As wave after wave of senioritis sweeps the school it doesn't seem so ridiculous to ditch sixth period to go to the beach or take the train up to the city. After all, you're in college, so there's nothing to worry about, right?\r\n\r\nWell, maybe.\r\n\r\nIf you're like me and falling off the academic bandwagon possibly a little <em>too<\/em> hard, check out these super fun tips and tricks to hold your senioritis at bay because, hey, nobody likes being rescinded.\r\n\r\nTIP NUMBER ONE: Study outside. Next time you're headed to the park to work on your tan, grab a textbook on your way out the door. Got a 5th period prep? Head out to the Quad with some homework. Now you can work on that summer glow AND learn about biology. Multi-tasking at its finest.\r\n\r\nTIP NUMBER TWO: Make a calendar for yourself. Sure, maybe you're headed to Santa Cruz Wednesday afternoon, but that's no reason you shouldn't do your Spanish homework on Thursday. If you set aside time to work and time for fun, you'll feel a lot less guilty about slacking off one day if you know you'll have time to write that essay the next.\r\n\r\nTIP NUMBER THREE: Reward yourself for being productive. That may mean a Chipotle run, a fresh batch of chocolate-chip cookies or a new pair of shoes, whatever works for you. Maybe reviewing for a quiz means a scoop of ice cream while finally turning in that eight page paper merits a whole banana split.\r\n\r\nTIP NUMBER FOUR: Find a study buddy. Work is more fun with friends, everyone knows that. Pretty soon you'll be looking at each AB Calc review assignment as an excuse to hang out with that cute boy who sits across the room from you, and who doesn't want that?\r\n\r\nTIP NUMBER FIVE: Everything in moderation. For some people, senioritis is partying six nights a week, while for others symptoms include nine hour long Netflix marathons. Try cutting that in half (three parties a week is nothing to shake a stick at...) and spend all your new free time catching up on those 80 pages of AP English reading.\r\n\r\nSo go ahead, skip 3rd period tomorrow, and the next day and the day after that. But really, with four weeks left of school make sure to drop by Paly at least once or twice before graduation.","excerpt":"Check out these super fun tips and tricks to hold your senioritis at bay because, hey, nobody likes being rescinded.","date":"2014-05-06 22:01:46","author":"Paige Esterly","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/IMG_0554.jpg","categories":["Opinion"],"tags":[]},{"id":71416,"title":"Paly student hit by car on route to school","permalink":"http:\/\/palyvoice.com\/2014\/05\/06\/paly-student-hit-by-car-on-route-to-school\/","content":"A Palo Alto High School student was hit by a car around 8:15 a.m. on route to campus this morning at the intersection of Churchill Avenue and Castilleja Avenue.\r\n\r\n<span class=\"Apple-style-span\">According to an email sent out after the incident by Dean of Students Craig Tuana to Paly faculty, the student, whose injuries were not serious, was taken to the hospital by her parents as a precaution.<\/span>\r\n\r\n[caption id=\"attachment_71458\" align=\"alignright\" width=\"476\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg\"><img class=\"wp-image-71458\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg\" alt=\"The intersection of Churchill Avenue and Castilleja Avenue during hours while students are in class. Photo by Kate Marinkovich.\" width=\"476\" height=\"357\" \/><\/a> The intersection of Churchill Avenue and Castilleja Avenue is known for its lack of traffic lights and stop signs. Photo by Kate Marinkovich.[\/caption]\r\n\r\nFreshman Steven Marinkovich was at the intersection at the time of the incident.\r\n\r\n\"I got out of my car with my sister and I heard a car hit something,\" Marinkovich said. \"I turned around and saw the girl fall onto the ground and saw her laying there for awhile.\"\r\n\r\nFreshman Louie Marzano also saw the incident while he was biking to school.\r\n\r\n\"I ... saw a bunch of cars lined up on Churchill and a girl lying on the ground,\"  Marzano said. \"[There was] a lot of commotion, people on the phone. The girl was crying – she had her hand on her head.\"\r\n\r\nThe intersection is recognized as an unsafe area for students and other commuters during busy hours, according to Marinkovich.\r\n\r\n\"I felt bad for her but wasn't surprised somebody eventually got hit in that intersection,\" he said.\r\n\r\nIn 2010, traffic lights were added to the Embarcadero Road crosswalk, a similar location for Paly parking traffic that provides access to Paly from three directions. Some students feel as though a traffic light system should be added to the Churchill Avenue and Castilleja Avenue crossing as well.\r\n\r\n\"A traffic light system should be added because if the pedestrians know that it's their right of way, then they will be more confident in crossing,\" junior Savannah Feriante said. \"Drivers will be sure of the pedestrian actions because they will be following light signals rather than intuition.\"","excerpt":"A Palo Alto High School student was hit by a car around 8:15 a.m. on route to campus this morning at the intersection of Churchill Avenue and Castilleja Avenue.","date":"2014-05-06 20:22:51","author":"Lydia Barry","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/street.jpg","categories":["News","Spotlight"],"tags":{"8453":"accident","9672":"car","17668":"churchill","8953":"paly","17670":"safety","9129":"student","17669":"traffic"}},{"id":70912,"title":"Baseball Season Update: Vikings confident for playoffs","permalink":"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/","content":"[caption id=\"attachment_49426\" align=\"alignnone\" width=\"900\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/02\/mce_022013_0024.jpg\"><img class=\"size-full wp-image-49426\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2013\/02\/mce_022013_0024.jpg\" alt=\"Starting pitcher Chris Smith throws a fastball in the first inning of Paly's 9-3 season opener loss to St. Ignatius last year.  Photo by Matt Ersted.\" width=\"900\" height=\"600\" \/><\/a> Starting pitcher Chris Smith throws a fastball in the first inning of Paly's 9-3 season opener loss to St. Ignatius last year. Photo by Matt Ersted.[\/caption]\r\n\r\nAfter falling short of a league title this year, the Palo Alto High School baseball team (13-12) looks forward to making a run in the upcoming Santa Clara Valley Athletic League and Central Coast Section playoffs.\r\n\r\nThe Vikings will open the SCVAL playoffs on Tuesday at Wilcox High School.\r\n\r\n\"We have had some stumbles along the way, but we are hoping to finish strong,\" senior outfielder Bowen Gerould said.  \"We need to play well as a team in playoffs to beat some of the solid teams that we will face.\"\r\n\r\nSo far, strong pitching has led the team to a successful season, finishing third in league, according to senior second basemen Anthony Lim.\r\n\r\n\"Our pitching so far has been really good and consistent,\" Lim said.  \"Our hitting over the past couple of games needs some work.\"\r\n\r\nWhile the Vikings' pitching continues to be successful, other areas leave room for improvement, according to senior third baseman Noah Phillips.\r\n\r\n\"All of our pitchers are throwing strikes, and we are doing a good job playing strong defense behind them,\" Phillips said.  \"We can improve a little on our offensive execution - bunting and base-running especially.  Those things might end up being the difference in a game, especially down the stretch.\"\r\n\r\nGerould agrees that the offense needs to step it up in the coming games.\r\n\r\n\"All of us need to hit better as a whole,\" Gerould said.  \"We need to improve on getting guys home once we get them on base.\"\r\n\r\nThe Vikings finished third in the De Anza League,  and are hoping to be placed in the open division for CCS playoffs, according to Phillips.\r\n\r\n\"We all think we can make a deep run,\" Phillips said.\r\n\r\nOverall, Lim agrees that the Vikings will be able to pull together and make a run in league and CCS playoffs.\r\n\r\n\"The team is bonding well,\" Lim said.  \"We have a very tightly knit group.\"\r\n\r\nSenior ace Chris Smith will likely take the mound as the Vikings opening playoff game takes place at 4 p.m. on Tuesday at the Wilcox baseball field.","excerpt":"After falling short of a league title this year, the Palo Alto High School baseball team (13-12) looks forward to making a run in the upcoming <a href=\"http:\/\/palyvoice.com\/2014\/05\/05\/baseball-season-update-vikings-confident-for-playoffs\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-05 22:41:28","author":"Jared Schwartz","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/05\/chris-smith.jpg","categories":["Sports"],"tags":{"15103":"anthony lim","8410":"Baseball","15102":"bowen gerould","15104":"noah phillips","8944":"palo alto high school","15100":"paly baseball","15101":"season update"}},{"id":71115,"title":"How to prepare for AP testing","permalink":"http:\/\/palyvoice.com\/2014\/05\/04\/how-to-prepare-for-ap-testing\/","content":"[caption id=\"attachment_71126\" align=\"alignnone\" width=\"634\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png\"><img class=\"size-full wp-image-71126\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png\" alt=\"Staff writers Becca Raffel and Jared Schwartz demonstrate perfect AP testing preparation. \" width=\"634\" height=\"477\" \/><\/a> Staff writers Becca Raffel and Jared Schwartz demonstrate perfect AP testing preparation. Photo by Callie Walker.[\/caption]\r\n\r\nWith Advanced Placement tests are right around the corner, many Palo Alto High School juniors are likely wondering how they should prepare for their first round of AP testing. Having taken AP tests last year, the Voice's own Jared Schwartz and Becca Raffel offer their two cents on advice to prepare, and several other seniors as well as AP U.S. History teacher Jack Bungarden join the conversation.\r\n\r\nFirst of all, many people greatly overestimate the need to frantically prepare for these examinations, and they forget one crucial element: they have been preparing for the exam all year.\r\n\r\nWhy did you read every chapter of <em>American Pageant<\/em>? And learn how to use a voice recorder in Spanish? And diligently participate in all the biology labs?\r\n\r\nThe fact of the matter is, AP tests are made to reflect what you have learned all year, not how much content you can cover in the next few days. Staying focused all year is crucial to success on the tests, according to senior Sarah Ohlson.\r\n\r\n\"Your teachers prepared you well throughout the year and as long as you stayed focused first semester you will do well second semester,\" Ohlson said.\r\n\r\nDon't get us wrong – a little spot review on areas that you might have forgotten is a great plan, but there is no need to go overboard with it. AP U.S. History teacher Jack Bungarden addresses the importance of reviewing.\r\n\r\n\"Study,\" Bungarden said. \"Go to review sessions, review your notes, go back and look at class materials, review the stuff you learned back in first semester.  Take some practice exams.\"\r\n\r\nPurchasing an AP practice booklet can also be beneficial, according to senior Jack Shapiro.\r\n\r\n\"It's really important to buy an AP test prep book if you can,\" Shapiro said. \"They have lots of tips on what problems you'll find and face and what you should review.  It's definitely worth it to get one to at least practice.\"\r\n\r\nAnother aspect of AP testing that is overlooked is the huge curve on the test. Depending on what AP class you're in, chances are that you have been taking simulated AP tests all year and have been receiving your raw grades on them. On the AP test, that C you have could turn into a 5.\r\n\r\n<em>Three suggested steps to dominating the test:<\/em>\r\n\r\n1. Pick out the topics that you have struggled with or haven't seen in a while. Make flashcards or have a friend explain them to you.\r\n\r\n2. Briefly skim over all the other material to remind yourself how much you know.\r\n\r\n3. Relax, get a good night's sleep and enter the test with confidence! \"Always choose sleep over study,\" senior Anthony Lim said.\r\n\r\nAll in all, we would like to stress the importance of not stressing about the tests. Sure, do some review and make sure you know your stuff, but getting worked up about the tests is neither necessary nor beneficial.\r\n\r\n\"Take it easy and relax about it, it's not a big deal,\" senior Jonathan Mackris said. \"Paly prepares you well for the AP's.\"","excerpt":"With Advanced Placement tests are right around the corner, many Palo Alto High School juniors are likely wondering how they should prepare for their first <a href=\"http:\/\/palyvoice.com\/2014\/05\/04\/how-to-prepare-for-ap-testing\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2014-05-04 21:21:50","author":"Becca Raffel","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/04\/Screen-shot-2014-04-29-at-1.07.21-PM.png","categories":["Opinion"],"tags":[]}]